{
    "Отдаю NFT за 880 миллионов долларов": {
        "href": "https://habr.com/ru/company/ruvds/blog/653085/",
        "content": " «Код — это единственный закон, которому подчиняются цифры»\n\r\nЕсли вы читаете этот текст, но ни разу не слышали про NFT, то, наверное, вы моя мама (мама, привет). Про этот феномен уже должен был кто-то написать человеческим языком без пустых восторгов и пересказывания мифов, но, похоже, эту траншею придётся копать мне. Странная штука: чем больше народу обсуждает NFT, тем ниже процент понимающих хоть что-то. Изначально этот материал задумывался как короткий обзор в духе «А король-то голый!», но по мере изучения проблемы, становилось всё яснее, почему так сложно сформировать собственное мнение относительно происходящего безумия.\n\r\nНеприятность ситуации заключается в том, что широко тиражируемое объяснение смысла NFT является наглой ложью, в противовес которой пока не сформировалось имеющее вес экспертное мнение. Человек с ра́звитым критическим мышлением чувствует в происходящем нечто, мягко говоря, подозрительное, но объективное суждение требует подробного анализа устройства этой системы, который могут осуществить «немногие лишь те», кто обладает хорошими знаниями в разных областях. Так что, как говорится, давайте раскидаем всё по фактам. Информации по теме получилось много, в этот раз будут основные моменты, а в последующих статьях копнём глубже и разберём практические аспекты.\n\n\n\nЧто было до NFT?\r\nНичего принципиально нового не произошло, в прошлом существовало достаточное количество самых разнообразных аналогов NFT, со многими из которых вы точно сталкивались. Сам же термин получил широкое распространение в процессе намеренной раскрутки формирующегося рынка, новой в этой истории является только упаковка. Вот лишь несколько примеров того, что существует давно и по смыслу почти не отличается от NFT:\n\n\nМногопользовательские RPG обычно предполагают существование рынка обмена игровыми предметами, каждый такой предмет можно считать NFT. В зависимости от популярности игры эти предметы могут торговаться за живые деньги. Подобные системы обмена являются самыми близкими родственниками NFT.\nКогда-то давно начинающие авторы хабра гонялись за «инвайтами», которые переводили новичка в разряд проверенных авторов, что позволяло выбраться из отстойника с небольшими просмотрами в общий поток статей. Инвайты водились у опытных авторов, которые получали их автоматически в качестве награды за статьи. Так как инвайты можно было передать кому угодно, их частенько выпрашивали, иногда у совсем незнакомых людей. Инвайты хабра — это NFT, ограниченные однократной передачей.\nКлючи для регистрации программ тоже являются NFT.\nQR-код с подтверждением вакцинации — это NFT без права передачи.\nЖетон на метро — это NFT, который можно потрогать.\nБилет на спектакль — это тоже NFT.\n\n\nИтак, что же такое NFT?\r\nСам термин появился в техническом документе ERC-721, который является одним из тысяч стандартов на смарт-контракты в блокчейн-сети Ethereum. Полноценное определение NFT имеет смысл только в контексте разработки под инфраструктуру Ethereum, что, конечно, делает его недоступным для понимания абсолютным большинством читателей, но так как за сложным определением скрываются простые вещи, можно составить несколько равноценных определений с разным уровнем технических подробностей.\n\n Самое простое объяснение\nNFT — это фишка как в настольных играх, только виртуальная. Без конкретики, просто фишка. Точно так же как игральная фишка обретает конкретное назначение в конкретной игре, способ использования виртуальных фишек должен определяться инициаторами выпуска конкретной партии NFT.\n\n\n\nОбъяснение для программистов\nNFT — это запись в key-value хранилище, где «key» — это уникальный идентификатор NFT, а «value» — идентификатор пользователя, владеющего данным NFT. Ничего кроме возможности менять value для key не предполагается, практическая польза возникает, если данные по владельцам NFT связываются с другими системами.\n\n\n\nОпределение для любопытных\nNFT — это токен, созданный смарт-контрактом ERC-721 в блокчейн-сети Ethereum.\n\r\nИзбавимся от технических заборов с помощью грубых аналогий и найдём суть:\n\r\n1. Блокчейн-сеть Ethereum — это база данных, живущая на нескольких тысячах компьютеров в интернете. Это база является открытым для всех единым гроссбухом, в котором записываются перемещения виртуальных активов пользователей.\n\r\nКогда пользователи блокчейн-сети добавляют записи в общий гроссбух, то новые записи одновременно проверяются множеством компьютеров. Правильные записи замораживаются, при этом каждая такая запись содержит «отпечаток» предыдущей записи. Получается, что все записи сцеплены между собой последовательностью отпечатков, отсюда название «блокчейн» («цепь из блоков»). Записи невозможно изменить, расхождение будет быстро обнаружено, поэтому записи могут только добавляться. Хотя существует множество способов организовать надёжную базу данных, о блокчейне говорят отдельно, так как защищённость записей в гроссбухе является результатом совместных действий множества пользователей, это свойство необходимо для систем, в которых гарантированная неприкосновенность данных важнее накладных расходов.\n\r\nПонятие «блокчейн-сеть» с точки зрения пользователя похоже на понятие «смартфон». Понятие одно, но оно реализовывается разными платформами, например, есть смартфоны на iOS и Android. Для каждой из этих платформ существуют миллионы приложений и игр. Точно так же существуют несколько блокчейн-сетей с сотнями сервисов. Криптовалюты и NFT — это сервисы, работающие внутри блокчейнов.\n\r\n2. Смарт-контракт — это автоматическое обязательство, которое выполняет перемещение виртуальных активов пользователей при наступлении определённых обстоятельств. По сути — это малюсенькая программка, которая сама добавляет записи в гроссбух. Например: «Если Вася 1 января шевелил мышку 6 часов, то перевести Васе 10 виртуальных единиц».\n\n\n\r\n3. Токен — это просто случайный набор цифр, который используется как пометка, зарубка, узелок на память.\n\r\nВ итоге получается простое определение:\n\nNFT — это галочка в гроссбухе рядом с фамилией пользователя, имеющая уникальный номер.\n\n\n\n▍ Пересказ ERC-721 для самых дотошных\r\nСтандарт ERC-721 предлагает способ добавления в описанный выше гроссбух специальных записей, которые противопоставляются криптовалюте. Если криптовалюта — это виртуальное богатство в попугаях, и его ценность зависит от количества, то NFT преподносится как виртуальный актив сам по себе, с ценностью, определяемой рынком. Одна виртуальная единица криптовалюты равна по ценности другой единице, но запись в гроссбухе о владении NFT некоторым пользователем неэквивалентна записи о владении NFT другим пользователем. Технически разница между виртуальными активами только в идентификационных номерах: пользователь Вася обладает активом #A01, пользователь Миша обладает активом #A02. Поэтому возникает возможность использовать термин «non-fungible token», т. е. «невзаимозаменяемый токен»: у тебя NFT #A01, у меня #A02.\n\r\nВ тексте указывается на возможность использовать другие термины вместо NFT: «актив», «различимый актив», «патент», «жетон», «капитал», «талон». Сами авторы рассуждают о следующих способах применения:\nМы считаем, что NFT подходит для владения и обмена частными лицами, а также операторами вроде брокеров, хранилищ, аукционов. NFT может представлять право собственности на цифровые или физические активы. Подразумеваются самые разные формы владения, мы также уверены, что найдутся иные способы применения:\n\nФизическая собственность: дома, уникальные произведения искусства.\nВиртуальные коллекционные предметы: уникальные фотографии котят, коллекционные открытки.\nАктивы с «отрицательной стоимостью»: кредиты, обременения и прочие обязательства.\n\r\nСуществует множество вариантов использования смарт-контрактов Ethereum, привязанных к неделимым активам. Указывать на применимость NFT может то, что актив неудобно представлять числами в гроссбухе, вместо этого каждый такой актив должен иметь своего владельца и атомарно отслеживаться.\nЧто можно сделать с NFT?\n\nСоздать, получив в своё распоряжение.\nОтдать другому пользователю.\nУничтожить свой NFT по желанию.\nИзменить метаданные в своём NFT (про это далее).\n\r\nНо при чём тут владение, искусство, коллекционирование, про которые в первую очередь доносится со всех сторон? Ни при чём! Исключительно человеческая фантазия, не более. Стандарт ERC-721 определяет только способ занесения в гроссбух уникальной «галочки» и ничего больше. NFT — это только абстрактный технический инструмент, смысл которому придаёт конкретный сервис. За любой ширмой пользователь в итоге распоряжается «галочкой» и ничем больше.\n\r\n«Позвольте!», воскликнут многие, «ведь известно, что NFT — это собственность на интернет-ссылку, в которой и заключено ценное содержание». Это утверждение ложно. Формат ERC-721 определяет наличие в NFT метаданных. Метаданные — это дополнительные данные для служебных целей. В метаданные NFT, соответствующие стандарту ERC-721, входит ссылка и текстовая строка. И то и другое могут дополнительно что-то сообщать о «галочке», но не являются обязательной частью NFT. Цитата из ERC-721:\nПредусматривается механизм, позволяющий ассоциировать NFT с URI. Мы предполагаем, что все NFT будут использовать этот механизм. Рекомендации по размеру изображения взяты у Instagram, они, похоже, неплохо разбираются в картинках. URI МОЖЕТ быть мутабельным (т. е. может изменяться). Если NFT представляет собственность на дом, то в таком случае метаданные с информацией о доме (фото, жильцы и т. д.) могут естественным образом изменяться.\nВладелец NFT может изменять метаданные, а значит у них нет ценности. Кроме того, бессмысленна «несертифицированная» интернет-ссылка, которая может в любой момент поменять адрес назначения или само содержимое страницы может раствориться в великом ничто. Главный источник недопонимания состоит в том, что NFT это только базовая часть технологии, самая нижняя, которая ничего из себя не представляет. NFT — это символ без значения. Именно в этом проблема, что люди пытаются натянуть смысл на голый NFT. Без дополнительных технологических слоёв ценность NFT существует только в чьих-то мыслях и нигде больше.\n\r\nОбладание криптовалютой похоже на обладание реальным кошельком с лежащими внутри денежными купюрами разных номиналов. В рамках такой аналогии NFT — это расписка, не имеющая объявленной ценности («Расписка о получении данной расписки»), которая лежит в банковском сейфе, владелец может её разорвать, передать кому-то (при передаче работник банка проверяет наличие договора между сторонами, контролирует процесс перемещения в новый ящик), предъявить кому-то (при этом работник банка удостоверяет, что это подлинная расписка и она принадлежит владельцу).\n\r\nЕсли посмотреть на уже объективно существующий рынок NFT, то напрашивается другая аналогия: криптоденьги обмениваются на криптоалмазы. Стоимость алмаза почти не связана с его практической пользой, а зависит от смеси объективных и субъективных причин. Чем меньше конкретный алмаз похож на то, что уже массово продаётся, тем значительнее субъективный фактор. Когда продают NFT, продают только «галочку», «расписку». Картинки и текст — это лишь приправа, которой сдобрен символ. Чипсы с беконом, чипсы с зеленью, чипсы со вкусом картошки. Это всё один и тот же продукт с разным вкусом, который добавляется для преобразования одного наименования товара в несколько и для повышения продаж за счёт удовлетворения спроса потребителей на разнообразие. Так и NFT c картинками — это записи в базе данных с разным ароматом. Расписку можно напечатать на бумаге, на папирусе, на шёлке, но во всех случаях «расписка о получении расписки» будет иметь эквивалентное значение. Всамделишная ценность NFT создаётся инфраструктурой, которая предоставляет некий сервис в обмен на токены.\n\nПроблемы существующего рынка NFT\r\nВ интернете полно однообразной критики NFT, сопровождающейся скриншотами картинок от NFT. «Посмотрите, эти дураки покупают то, что можно взять бесплатно!» — таков их посыл. «Да, но делает ли возможность нагуглить известную картину вас владельцем?» — гордо отвечают им криптоевангелисты. Спутав владение галочкой и владение собственностью, ослеплённые NFT не замечают горы очевидных проблем, неизбежных при цифровом обмене:\n\n\nЯвляется ли создатель NFT настоящим владельцем? Можно выставить на «продажу» что угодно.\nНет никакой гарантии уникальности товара. Можно продавать одно и то же бесконечно.\nДаже если появится система контроля уникальности контента, то как она сможет работать? А если я чуть-чуть изменю чужой контент? А если я автор и хочу выложить изменённую версию? А если я подарил копию работы другу, которую теперь он хочет продать? Максимум, что получится сделать в этом направлении — это показать уведомление покупателю: «есть ещё 10 похожих дешевле!»\nПосле покупки вам передаётся только само NFT, никаких возможностей распоряжаться активом от этого не возникает.\nПокупка NFT с активом по ссылке на некий ресурс точно так же никого ни к чему не обязывает, сегодня ресурс есть, завтра нету (отдельно для любителей IPFS: ссылка — это метаданные, они могут неожиданно изменяться. Есть букет причин, противоречащих использованию URL в качестве жёсткой связи, существующая практика — это неумный костыль).\nБольшинство предлагаемых сценариев использования NFT уже реализованы где-то или могут быть реализованы на обычных БД. Это будет проще и дешевле для самих пользователей. Случаи, когда действительно необходимо использовать доказательство владения виртуальным активом в среде с нулевым взаимным доверием — это какие-то штуки, лежащие в области криптофинансов.\nОтсутствие внятных механизмов установки подлинности и цены, без них торговые площадки — это барахолки, работающие по ночам без света.\n\r\nВсе эти пункты решаются использованием дополнительных технических надстроек, что будут связывать NFT и право владения, что-то можно автоматизировать и поднять на том же блокчейне (например, можно сделать настоящий криптодепозитарий для виртуальных активов, который внутри себя будет ссылаться на NFT), но владение реальными ценностями никак не организовать без государственного участия (подробнее это будет рассмотрено в третьей части материала).\n\nКак бесплатно создать NFT?\r\nНичего не мешает вам создать собственный NFT за 10 минут. Вот инструкция:\n\n\nОткрыть криптобазар OpenSea.\nНачать логиниться, выбраться способ — MetaMask (менеджер криптокошельков).\nПоставить расширение для браузера MetaMask.\nВ расширении MetaMask запустить создание нового кошелька.\nПридумать и записать пароль, записать предложенную фразу для восстановления доступа.\nПродолжить вход на OpenSea c помощью MetaMask и созданного кошелька.\nСоздать новую коллекцию, обязательно в свойствах переключить blockchain с Ethereum на Polygon, так как создание NFT в Ethereum сопровождается оплатой.\nСоздать в коллекции предмет продажи, собственно сам NFT.\nПосле создания выставить его на продажу.\n\r\nА если вам захочется поддержать автора, то вот та самая NFT с первой картинки, можно купить её тут.\n\nКак можно использовать NFT?\n▍ Спонсорство\r\nПокупка NFT — это понятный вариант поддержки чужого творчества.\n\n▍ «Продажа» цифрового искусства\r\nПод сказку о «владении оригиналом» происходит чистое безумие. «Продаются» картины, картинки, видео, музыка, алгоритмическое искусство. По факту это то же самое спонсорство.\n\n▍ В играх\r\nМножество игр использует NFT для представления игровых персонажей и игровых предметов, которыми могут владеть игроки. Считается, что это создаёт прозрачный рынок, лишённый серой составляющей, но на самом деле это либо способ раскрутить новую игру, либо финансовый проект в обёртке игры, либо беготня от налогов. Экономика в полноценных играх это очень тонкий механизм, который сложно наладить и поддерживать по мере изменения, задача сохранять игру привлекательной становится в 1000 раз сложнее, если можно за реальные деньги получить возможности, лишающие интереса залипать в игру. Некоторые игры могут быть чистой воды игровыми автоматами, скрывающими азартную суть, например, под видом карточной игры.\n\n▍ Коллекционирование\r\nОчень непонятная история с продажей NFT-коллекций. Преподносится всё в духе коллекционирования марок и тому подобного. Уже существует рынок специальных программ, которые комбинируют несколько графических элементов в тысячи разных картинок, при этом намеренно ограничивается редкость появления каких-то комбинаций, таким образом создаётся объяснение для разной стоимости галочек в блокчейне. При этом никому нет дела до визуальной составляющей получающихся изображений. Никто не трудится объяснять, с чего вообще цифровой мусор является товаром. Больше похоже на удачную находку отмывальщиков денег, перекупка ботами этих токенов создаёт иллюзию ликвидности, что привело к какому-то цунами одинаковых «NFT-проектов». Люди на полном серьёзе создают подобные россыпи картинок и яростно пиарят их в надежде заработать. Чем больше таких коллекций продаётся, тем проще ботам отмывальщиков.\n\n▍ Доменные имена\r\nЕсть такой местечковый стандарт, который позволяет вместе с покупкой NFT получить в распоряжение специальное доменное имя второго уровня (в особых зонах .eth и .crypto). Пропагандируется, как это децентрализовано и хорошо, грустная правда заключается в том, что это хозяйство мало где работает из коробки. К тому же резолв адресов производится через сервер конторы unstoppabledomains, которая собственно яростно форсит эту идею. Где децентрализация, Билли? Пока похоже на замкнутый круг «никем не поддерживается, потому что никто не пользуется».\n\n▍ Залоговое обеспечение\r\nВсё как в настоящем мире, если есть децентрализованные финансы (DeFi) будут и кредиты. Если NFT имеет ценность, то почему бы его не заложить. DeFi, конечно, станет тем ещё рассадником МММ. Есть прогноз, что из этой чёрной дыры скоро столько всего полезет, что про NFT с картинками начнут забывать.\n\n▍ Токены сообществ\r\nТакие NFT могут иметь самое разное назначение, но их объединяет то, что они обладают полезными свойствами внутри сообществ. Например, это может быть аналогом платной подписки, дающей доступ к эксклюзивным материалам, которую можно проверять в чатах и на сайтах. Либо выражением какой-то локальной ценности, например, плюсики на хабре могли бы тратиться из копилки пользователя. Другой вариант — это талон на квант чужого ресурса (времени, действия, внимания). Допустим, блогер продаёт свои ненаписанные комментарии, вы покупаете такой комментарий и в любой статье, под которой вам бы хотелось увидеть комментарий этого блогера, втыкаете токен. Дальше возможен идиотский вариант и нормальный. В идиотском будет достаточно влепить заглушку от известного блогера, чтобы получить позитивную реакцию остальных хомячков. В нормальном будет ожидаться, что блогер действительно зайдёт написать текст, можно усложнить систему, возвращая NFT блогеру в случае добавления реального текста, тем самым ограничив количество таких токенов. А самое интересное, что эти токены кроме выполнения полезных функций можно передавать или продавать. Скорее всего — это самая интересная ветка развития NFT.\n\r\nЕсли кому-то захочется придумать новое полезное применение NFT, то следует держать в голове простую аналогию, что NFT — это талон, как талон на проезд или билет на аттракцион. Но у этого талона есть несколько особенностей, следующих из того, что он живёт в блокчейне.\n\r\nНапример, NFT классно подходит для отслеживания распределения средств. Это не гостайна, что бюджетные деньги пропадают в огромном количестве. Постфактум уже невозможно разобраться, в какой яхте или машине поселились эти деньги, потому что все рубли одинаковые. Но если представить, что существует параллельная система расчётов, в которой каждый крипторубль будет проштампован уникальным номером, ситуация круто поменяется.\n\r\nКроме различимости у NFT есть ещё одно интересное свойство — точно известно сколько раз произошла смена владельца. Если сделать специальный подвид NFT с однократной передачей, то получится простая система борьбы с перекупщиками (билетов, телефонов, приставок, видеокарт).\n\r\nВ случае билетов — достаточно приложения с регистрацией по номеру телефона и привязкой криптокошелька к этому приложению (чтобы избежать любых схем с перепродажей самого кошелька).\n\nИнформации очень много, первая часть пришла к логическому концу, в следующей части мы проанализируем историю формирования рынка NFT и попробуем ответить на вопрос: кто и зачем всем этим занимается?   "
    },
    "Про NFT и деньги": {
        "href": "https://habr.com/ru/company/ruvds/blog/654537/",
        "content": " Завершаю серию материалов про NFT. В первой части я подробно разобрал, что такое NFT. Вторая статья посвящена хронологии большого взрыва NFT-вселенной. На этот раз мы обсудим денежки.\n\n\n▍ Является ли NFT обманом?\r\nНачнём с непременно всплывающей темы мошенничества. Сам по себе NFT не может быть пузырём, пирамидой или кидаловом. Стараться доказать, что «NFT — это скам», так же бессмысленно, как доказывать обратное. NFT — это абстрактный инструмент для хранения данных. Конкретный проект, построенный на NFT, может быть изначально надувательством, а может и не быть.\n\r\nNFT лишь часть криптовселенной, которая является полным аналогом Дикого Запада, где каждый сам отвечает за себя, в этот мир приходят ради наживы и приключений. Можно уверенно сказать лишь одно: все схемы, прибыльность которых основана на вирусности, обязательно исчезают. Есть масса способов потерять деньги с помощью NFT, для этого даже не нужны знания, вам всё подскажут и расскажут создатели многочисленных «NFT-проектов». Значительно заработать на спекуляциях картинками крайне сложно без длительного погружения в тему и навыков трейдера. При наличии коммерческого таланта гораздо проще привлечь чужие деньги в некую коллективную активность, что стало причиной бурного роста так называемых NFT-projects. Абсолютное большинство из них повторяет схему мошенничества pump&dump, то есть раскрутка и слив на пике роста. Заработать на участии в подобном мероприятии можно, если заранее угадать, какой проект пойдёт в рост и когда начнётся процесс слива. Увы, но эта схема работает для 95% таких историй, разница лишь в длительности существования пика.\n\r\nПсихолог Роберт Чалдини, который исследовал феномен убеждения, обнаружил, что магия привлечения чужих средств строится на шести принципах: взаимовыгодность, исполнение обещаний, социальное признание, личная симпатия, дефицит и убедительность. В начале XIX века авантюрист Грегор МакГрегор по наитию использовал такие приёмы, чтобы создать обман впечатляющего размаха. Если пропустить феерическую медиакомпанию, то всё сводилось к продаже земли и денежных банкнот изнывающей от обилия ресурсов колонии Пойас (Poyais), что должна была находиться в районе Центральной Америки. Когда первые корабли «владельцев» небывалых сокровищ дошли до района, обозначенного на поддельной карте, вместо рек из жидкого золота они обнаружили непроходимые джунгли. К моменту возвращения оставшихся в живых «инвесторов», МакГрегор собрал сумму условно соответствующую современным 4 млрд $. Законодательство Европы тогда позволяло улаживать подобные проблемы быстрым перемещением в другую страну. Во Франции МакГрегор не смог удержаться и снова удачно повторил всю схему, правда, на этот раз правительству Франции показался странным сбор экспедиции в никому неизвестное место.\n\r\nЭта история про то, как легко воспользоваться доверием в условиях непроверяемости информации на фоне лихорадки открывшихся возможностей. NFT — это рулетка, в которой ставки делаются на обещания. Люди эволюционно созданы для совместного выживания, мы запрограммированы кооперироваться и испытывать агрессию к предателям. Самые умные люди попадаются в правильно расставленные простые ловушки, поэтому участие в этой вечеринке может превратиться в негативный опыт.\n\n▍ Пиастры! Пиастры!\r\nТридцать лет назад обеспеченный человек был полностью уверен, что банковские счета недоступны третьим лицам. Даже мысль, что посторонние могут получать информацию о владельце счёта, казалась абсурдной. Банковская тайна имела самостоятельную ценность, что стало источником значительной прибыли для отдельных государств. В мире всегда были желающие самостоятельно управлять степенью откровенности отношений с отечеством. В начале 1989 была создана международная организация FATF, которая потихоньку начала откусывать кусочки от финансовой приватности, выпуская предложения «за всё хорошее» и лишь в редких случаях под прикрытием выполнения этих требований происходило настоящее изъятие данных. После известного события 2001 года глобальная слежка получила возможность невозбранно умножить свой охват, а финансов это касалось в первую очередь, нет ничего важнее информации о том, кто с кем дружит, где и почём торгует. Чтобы понять, где ещё не разучились хранить секреты, загляните в последнюю редакцию «чёрного списка FATF». Что-то список слишком короткий — Иран и Северная Корея. Это означает, что почти все страны мира отнеслись серьёзно к рекомендациям FATF и стали им следовать. И как же звучат эти рекомендации?\n\r\nСамые интересные пункты:\n\n\nВведение требований по борьбе с отмыванием денег в отношении альтернативных систем денежных переводов.\nУсиление мер по идентификации клиентов при переводе денежных средств.\nСообщение о подозрительных операциях, относящихся к финансированию терроризма.\nОбеспечение невозможности подозрительных перемещений наличных денежных средств и оборотных инструментов на предъявителя через национальные границы.\n\r\nНи одно из этих требований не может быть выполнено в отношении криптоактивов. Простая задачка: в условиях ужесточения законодательства стоит ли воспользоваться неконтролируемой системой гарантированного обмена виртуальными ценностями? Сам по себе NFT ничего нового не добавляет, он может быть лишь одним из промежуточных элементов в многошаговой комбинации, а может играть самостоятельную роль. Хотя даже поверхностный анализ продаж NFT выявляет постоянно снующие туда-сюда миллионы долларов, что совсем непохоже на яростное удовлетворение потребностей в искусстве или развлечения миллиардеров, ещё меньше это похоже на сознательное инвестирование.\n\r\nПосмотреть происходящие на рынке можно с помощью следующих ресурсов:\n\n\nТекущие котировки NFT cryptoslam.io\nАналогичный сервис icy.tools\nАнализ потоков в популярных блокчейнах, самый показательный индикатор — распределение комиссии, позволяет видеть, где бурлит жизнь pro.nansen.ai\nПользовательская аналитика, SQL+дашборды по Ethereum, Polygon, Binance Smart Chain, Optimism, Gnosis Chain dune.xyz\n\r\nСреди существующих дашбордов на dune.xyz, моё внимание привлекла оценка уникальных покупателей и продавцов.\n\n\n\r\nКакая-то подозрительно сильная корреляция между продавцами на рынке и покупателями. Ни разу продавцов не было больше чем покупателей, то есть никто не совершает несколько покупок на один кошелёк? По ссылке доступен SQL-запрос, выглядит вменяемо: по всем сделками считаются уникальные источники и получатели. Особенно смущает отсутствие пересечения графиков. Может, я чего-то не понимаю, но почему строго выполняется неравенство «количество кошельков покупателей» >= «количество кошельков продавцов»? Одна картинка в одни руки — это какое-то правило клуба?\n\r\nА давайте посмотрим на скорость появления новых кошельков.\n\n\n\nИнформация по уникальным адресам от etherscan.io\n\r\nРегистрируется примерно 100 000 новых кошельков в день.\n\r\nА давайте посмотрим: как много покупок NFT совершается с существующих кошельков, а сколько со свежих.\n\n\n\r\nПолучается, что в декабре 2021 года в среднем каждый день в сделках участвовали 40_000 кошельков, при этом 20_000 кошельков были новые.\n\r\nА теперь оценим соотношение выпуска NFT и совершенных продаж (считая перепродажи).\n\n\n\nИнформация с дашборда «New wallets in NFT»\n\r\nЕсли эта диаграмма верна, то ежедневно на каждый кошелёк из 40_000 в среднем совершается 5 покупок (цифра очень условная, надо смотреть распределение).\r\nПонятно, что три картинки не являются серьёзным анализом, но использование NFT для отмывания денег и взяток — это реальность. Если вам хочется больше информации по поводу отмыва денег с помощью NFT, то вот свежая статья от эксперта по финансовым преступлениям, кроме того, можно полистать отчёты FATF за последние два года, где есть описание реальных схем.\n\r\nКстати, так ли уж сложно сделать примитивный игровой проект вроде Axie Infinity, имея гору ненужных денег? Совпадение ли, что большинство игроков Axie Infinity проживает на Филиппинах и там же действует широкая сеть подпольных банков, помогающих китайскому криминалу легализовывать доходы? Почему сама игра до сих пор не выложена в официальных магазинах приложений? «Смотрите далее на НТВ».\n\r\nГоворят, что все прежние лавочки для очистки бабла притушили, офшоры и торговля искусством теперь уже не те, что прежде. Если где-то убыло, значит, где-то должно прибыть, ведь борьба с отмыванием денег не останавливает механизм создания прибыли.\n\r\nПосмотрим на топ самых дорогих продаж NFT:\n\n\n\r\n500 млн? Как это возможно? Выставляете NFT за 500 млн, собираете автоматическое обязательство (смарт-контракт), которое берёт криптозайм (flash loan) на 500 млн, покупает ваш NFT и возвращает долг. Вы потеряли комиссию за операцию, но оказались в новостях. Теперь нельзя обзывать все крупные продажи подозрительными, вдруг это невинная шутка или намеренное накачивание цены. Эта «продажа», которая была проведена открыто, теперь вычёркивается из списков крупных сделок, но никто не знает, сколько аналогичных схем использовалось незаметно.\n\r\nЕсть ещё несколько причин, мешающих составить чёткий топ продаж NFT. Кроме продажи отдельных токенов, существует продажа коллекций, которая с точки зрения прибыли является одним продуктом. Бывает продажа по кусочкам, это когда один NFT допускает дробление на мелкие части, которые продаются раздельно, можно ли это считать одной продажей? Воспользуемся свежим списком, который выглядит показательно.\n\n\nThe Merge — 91.8 млн$, 6 декабря 2021, продано по кусочкам 28_983 покупателям\nThe First 5000 Days — 69 млн$, 21 февраля 2021 [аукцион Кристис]\nHuman One — 29.98 млн$, 9 декабря 2021\nКартинка № 7523 из коллекции CryptoPunk — 11.75 млн$, июнь 2021 [аукцион Сотбис]\nКартинка № 3100 из коллекции CryptoPunk — 7.58 млн$, июнь 2021\nRight-Click and Save As Guy — 7.09 млн$, 10 декабря 2021\nКартинка № 109 из коллекции Art Blocks — 6.93 млн$, октябрь 2021\nCrossroad — 6.6 млн$, февраль 2021\nThis Changed Everything — 5.4 млн$, 30 июня 2021 (не картинка, «исходник» первого концепта веб-браузера)\nSave Thousands of Lives — 4.5 млн$, 30 июня 2021\n\r\nВот интересно, а чего это у нас такие консервативные продавцы, как аукционы, лезут на мутный рынок? Говорят, что дело в новом владельце Сотбис, который мечтает натянуть на старое предприятие шаблоны Ebay, а может всё-таки есть сложности с продажами на традиционном рынке? Стирка в Европе уже не та. Ещё интересно, что аукционы теперь принимают к оплате криптовалюту. Не позавидуешь работникам, которые из десятков тысяч цифровых картинок отбирают экземпляры для торгов, хотя что сложного в генераторе случайных чисел. Можно продать любую чушь по любой цене, потому что нельзя переплатить на рынке с диким разбросом цен без единых правил.\n\r\nКак работает традиционный рынок искусства? Существует большое международное сообщество, которое выработало правила ранжирования картин по ценности. Хотя правила не являются прямыми инструкциями, рынок для опытных участников не выглядит как хаос, и эта система успешно работает больше века. Цену устанавливает сообщество экспертов, другими словами, есть отдельный рынок услуг авторитетных специалистов, которым доверяют определять ценность произведений искусства. Человек со стороны может не понимать, почему установлена та или иная цена, но внутри сообщества в среднем сохраняется согласие.\n\r\nNFT хорошо восполняет утрату традиционного wash trading, преимуществ сразу несколько, это и анонимность аукционов, и отсутствие налога с продажи произведений искусства. Отмыв денег через перепродажу виртуальных предметов не является новостью, прошли те времена, когда люди удивлялись покупке виртуального пистолетика за десятки тысяч долларов. \n\r\nС ходу можно придумать две основные схемы отмывки денег:\n\nПервый вариант. Купить на легальные деньги криптовалюту, купить любой дешёвый NFT среди начавших уверенный рост, выставлять его на продажу по всё более дурной цене, купить у самого себя с чёрных денег. Вывести деньги через легальный обменник. При любых вопросах «Откуда деньги?» отвечать «Это искусство». Совсем хорошо, если продавцом будет талантливый художник или учреждение художественного профиля.\n\nВторой вариант. Чёрные-чёрные деньги сконвертировать через чёрный-чёрный обменник в крипту, которую размолотить в критопыль, сгенерировать тысячи NFT, купить пылью у себя множество NFT, продать себе множество NFT, далее действовать по обстоятельствам: или собирать в один кошелёк и легально выводить, или снова использовать подпольные обменники.\n\n\n\r\nЛадно, а если не мыть деньги, то что ещё приводит крупных инвесторов на крипторынки?\r\nЦитата из известного доклада ЦБ «КРИПТОВАЛЮТЫ: ТРЕНДЫ, РИСКИ, МЕРЫ»:\nСогласно глобальному исследованию аналитической компании Binance Research, выделяются следующие причины инвестирования в криптовалюты:\n\nвладение криптовалютой в рамках долгосрочной стратегии инвестирования (55% респондентов, основная причина);\nнедоверие к традиционной финансовой системе (38%);\nвозможность быстрой прибыли от краткосрочных торговых сделок (31%);\nбоязнь упустить выгоду (FOMO – Fear Of Missing Out, 27%).\n\r\nВ Великобритании, по оценкам последнего исследования среди потребителей финансовых услуг, около 38% опрошенных заявили, что приобрели криптовалюту в азартных целях, 30% в 2021 году стали приобретать криптовалюту в дополнение к другим инвестициям.\nОсновными целями приобретения ЦБ считает: спекуляции, инвестиции, трансграничные переводы, уход от требований по контролю. Что тут скажешь, каждый, так или иначе, живёт надеждой, про крипту ходят тысячи легенд, воплощающих общечеловеческую мечту про удачное обретение Емелей волшебной силы. Было бы странно, если бы рассказы о случайном богатстве оставались без внимания.\n\r\nОценим идею криптоинвестирования по критериям Роберта Чалдини:\n\n\nВзаимовыгодность. Каждый новый участник повышает ценность сообщества.\nИсполнение обещаний. Нет человеческого фактора, только формулы, которые лежат в открытом виде.\nСоциальное признание. Членство в элитной группе, быть криптомэном модно.\nСимпатия. Участники прогрессивного сообщества становятся сообщниками в противостоянии со старым миром.\nДефицит. Нужно успеть взять дешевле, вовремя прочухать новые темы.\nУбедительность. Криптотехнологии одобряют даже девушки в инстаграме.\n\r\nПочему так много людей схватилось за идею о том, что нечто становится ценностью, если об этом много говорят? Потому что это так работает. Увеличивающийся спрос повышает цену, что привлекает новых покупателей. Следует разделить утилитарное использование криптовалют для сиюминутных транзакций (деньги->крипта->[товар->крипта]->деньги) и инвестиционное. При утилитарном использовании безразлично сколько стоит биткоин, его функция — быть трубой для телепортации денег. Поэтому никакие колебания курса, никакая рыночная паника не уменьшает востребованность биткоина, но когда-нибудь он уйдёт в тень на фоне более удобной с технической точки зрения альтернативы. Что же касается инвестиций, то это феномен веры, универсальной веры, вдруг лично у тебя всё получится?\n\r\nВсе проекты в криптомире подчиняются одному похожему закону. Вот график изменения объёмов продаж (кол-во * цена) в NFT-проекте CryptoKitties, том самом, что запустил существующий ажиотаж.\n\n\n\r\nПодобно мотылькам, участники слетаются на свет и, сгорая в пламени, питают огонь. Если экономика проекта не подразумевает производства какого-то полезного продукта или услуги, то это, либо схема pump&dump, либо пирамида (доход участников берётся из средств новичков). Внимание конечно по объёму, а, значит, стабильное существование таких построений невозможно.\n\n▍ Как определить, стоит ли вкладываться в NFT-проект?\r\nЖелая всё-таки побаловаться с этим рынком, вот на что следует обратить внимание:\n\n1. Какое взаимодействие предполагается с участниками после покупки NFT?Что потенциально будет увеличивать стоимость? Примеры: игра play-to-earn, доступ к уникальным возможностям.\n\n2. Кто стоит за выпуском NFT? Есть ли подробная информация о создателях? Что они рассказывают сами о себе? Команда с понятной историей в интернете, сложившимся сообществом и вызывающими отклик идеями более вероятно выстрелит, нежели анонимное творение.\n\n3. Сообщество вокруг конкретного проекта. Наличие социальной активности с позитивным знаком создаёт веру в будущее проекта, вера в будущее создаёт уверенность в росте цены, это ключевой показатель для инвесторов и коллекционеров.\n\r\nКак оценить качество сообщества:\n\n\nНаличие средств оповещения о происходящем на проекте: Discord, twitter, телеграм, TikTok, что угодно, главное, чтобы это был канал общения с обратной связью от аудитории, а не SMM-шизофазия.\nОтслеживаемое участие создателей в жизни проекта, они должны появляться перед аудиторией с болями и радостями, их личные посты должны подтверждать вовлечённость в процесс.\nСуществование дискуссии вокруг направления развития проекта, открытый план (roadmap) в виде документа должен быть у любого проекта сложнее продажи картинок.\nЖизнь NFT нестабильна и требует постоянного реагирования на уход-приход участников, действия внутренних и внешних сил, если нет драк и споров, то это какая-то фигня.\nРегулярные отчёты по развитию проекта.\n\n\n▍ Какие права даёт NFT?\r\nБольше всего недопонимания вызывает концепция владения объектами посредством NFT, чтобы разобраться, что к чему, придётся начать издалека. Для человека существует два вида права: внутреннее и внешнее. Внутреннее является проекцией субъективного понимания «я это хочу, это моё, я здесь давно», условимся называть это естественным правом, как следствие потребности любого организма получать энергию из окружающей среды. Внешнее право идёт в комплекте к добровольным или вынужденным социальным связям, его хранителями являются семья, коллективы (все варианты сосуществования), государство, медиасообщества.\n\r\nВнутреннее право органично работает по отношению к личным вещам, нет необходимости доказывать посторонним, что ваша чашка действительно ваша. Когда дело касается чего-то большего, неизбежно столкновение двух желаний разных людей. Без авторитетного посредника конфликт будет решаться силой (ума, слов, кулаков, товарищества). Внешнее право может существовать неформально в виде традиций, имеющих обязательный статус выполнения для конкретной группы, либо в формализованном стандарте, действующем единообразно с привязкой к некоторой территории. Формализованное право для своего функционирования требует работы согласованной системы, состоящей из разных механизмов, которые обеспечивают: проектирование стандартов, выполнение, проверку исполнения, реакцию на нарушения, принуждение к выполнению, реакцию на невыполнение. Согласованная работа всех элементов создаёт феномен правового государства, которое наделяет граждан правами, в том числе правом на владение собственностью.\n\r\nЗакон определяет виды собственности и определяет порядок фиксации права владения. Владение чем-то в юридическом смысле возникает, если исполнена процедура, закрепляющая это право. Фиксация права собственности нужно не для демонстрации окружающим, оформленное право является основанием для разрешения спорных ситуаций посредством формализованной проверки, которую может осуществлять только специальный механизм. Арбитр, имеющий широкие полномочия (в том числе на насилие), необходим для приведения хаоса к единому стандарту. Без арбитра естественное право будет постоянно конфликтовать с другими видами неформальных прав.\n\r\nNFT — это некая запись в каком-то блокчейне. Государству всё равно где хранить цифровой реестр собственности, хоть на бумаге, хоть используя NFT, выбор технологии не поменяет сути: собственность закрепляется в установленном законом порядке. Если вам продают право на что-то с помощью NFT, вас нагло обманывают. Единственное что вам действительно продают — это естественное право на сам NFT (запись в блокчейне). После оплаты он привязывается к вашему кошельку и только вы можете решать его судьбу. Право владения песней или картинкой, как следствие владения NFT может возникать, если такая продажа совершена в рамках конкретного сервиса, и наличие NFT необходимо для доступа к покупке. В таком случае ваше естественное право уважается доброй волей владельца сервиса и ситуация ничем не отличается от владения домом в игре. Всамделишное право может возникать, если покупка цифрового товара осуществлена по законам РФ за нормальные деньги с оформлением чека, а NFT используется как ключ доступа к товару. Продажа криптоактивов с привязкой к праву иностранного государства (такие случаи есть) ничего нового не добавляет, на территории РФ силу имеют только законы РФ. Сделки с NFT не отличаются от сделок в игре «Монополия», если вы проиграли в «Монополию» реальные деньги, то для юридической системы это делает вас дурачком, а не потерпевшим.\n\r\nЕсть ещё одна замечательная вещь, про которую редко встречается упоминание. Все NFT, что сейчас продаются на криптобазарах, существуют только в рамках этих базаров.\n\nИз условий использования криптобазара OpenSea:\nМы не гарантируем, что любые NFT, хранящиеся на OpenSea, всегда будут видимыми и/или доступными для покупки, продажи или передачи.\n\r\nБазар — это не просто посредник, если он исчезнет, то нет, вы не потеряете привязки NFT к вашему кошельку, но вы больше не увидите страничку с названием, картинкой и описанием, всё это хранится в недрах конкретного базара. В лучшем случае вашу картинку можно будет увидеть, используя ссылку, хранящуюся внутри NFT, если она есть. Похвастаться вашим NFT в соцсетях станет невозможно, от красивого токена останется пачка байтов, которые висят в недрах блокчейна, а от креативного никнейма владельца останется только номер кошелька. Никому не интересно проводить раскопки, без которых не вычислить владельца NFT и его содержимое, такое не лайкнут в твиттере. В обычный NFT нельзя записать данные, которые он представляет, хранение файлов в обычном блокчейне технически расточительно. Для хранения данных внутри NFT нужно разработать не только новый стандарт, но и специальный блокчейн. Попытки что-то прикручивать к текущему NFT останутся костылями, пользователь покупает естественное право на галочку внутри блокчейна и ничего больше. Даже криптографически подтверждённое право доступа посредством NFT к данным на стороннем ресурсе — это согласие владельца ресурса с вашим естественным правом.\n\nЦитата 1:\nСамое главное — это обладание, — объяснил Михаил Пиотровский Forbes. — В чём смысл этих неразменных токенов? Блокчейн обеспечивает гарантию того, что владелец именно вы. Вам совершенно неважно, что репродукции этой картины окружают вас всюду и каждый может её посмотреть. Но, видимо, важно само ощущение обладания, которое переходит в эстетическое качество. А за сколько это можно продать, не имеет большого значения.\nРазбираем:\n\n\n«Самое главное — это обладание» Обладание конкретно чем? Если обладание галочкой в блокчейне, то да.\n«Блокчейн обеспечивает гарантию того, что владелец именно вы». Всё верно, галочка лежит в вашем кошельке.\n«Вам совершенно неважно, что репродукции этой картины окружают вас всюду» Нет, это важно. Копирование интеллектуальной собственности не является кражей в точном значении, так как копирование не лишает первоначального владельца доступа к оригиналу, просто оригиналов становится больше. Владение NFT, дающее доступ к закрытому ресурсу, имеет ценность. Владение NFT на любую открытую информацию — это странная игра с самим собой.\n«… важно само ощущение обладания, которое переходит в эстетическое качество...» О, это божественное ощущение от обладания галочкой со вкусом живописи Микеланджело.\n\n\nЦитата 2, речь идёт про выступление руководства Эрмитажа против продажи NFT с фотографиями, снятыми для рекламных целей:\n«Эрмитаж — один из первых музеев в мире, который столкнулся с недобросовестным использованием его прав на объекты в мире NFT. Несмотря на то что ни одна из стран мира пока ещё не урегулировала на законодательном уровне порядок сделок с NFT, положения о заключении сделок везде одинаковы», — прокомментировала Forbes Life юрист, управляющий директор VOC Arts Ольга Калинина. По её словам, в практике европейских судов любая сделка, связанная с передачей интеллектуальных прав, подлежит письменному заключению. Аналогичные правила действуют и в России. «Между Линдеманном и Эрмитажем был заключён лицензионный договор, по условиям которого использование исключительных прав в иных целях возможно только в случае уведомления Эрмитажа. В связи с чем продажу NFT с изображениями музея действительно стоит признать незаконной и отметить, что решение по этому делу, безусловно, станет прецедентным — сторона как минимум должна получить неустойку, предусмотренную договором», — убеждена Калинина.\n«… его прав на объекты в мире NFT...» У музея есть два вида прав в мире NFT. Право на созданные музеем NFT защищать нет смысла, так как они не могут поменять владельца без его желания. Важно понимать, что в случае любого недовольства прошлого владельца, отменить такие сделки невозможно, то есть нет смысла в процедуре защиты, так как принципиально невозможно вернуть NFT. Второе право музея в мире NFT заключается в контроле использования изображений на криптобазарах, как на любых других сайтах.\n\n«… продажу NFT с изображениями музея...» NFT не содержит изображений, не является сайтом, демонстрирующим изображение. NFT может продаваться в контексте некоторого изображения, точно так же можно продавать флешку, лежащую на памятнике.\n\r\nГражданин Линдеманн может продавать любые NFT, которые ему заблагорассудится, его галочки — это его собственность. Легальность размещения картинок в качестве элементов дизайна на сайте с NFT, регулируется точно так же, как размещение этих картинок для рекламы продукции группы Rammstein в интернете. Содержание договора неизвестно, если разрешённые места публикации были чётко определены, то нарушение есть.\n\n▍ Как заработать на NFT?\nСамостоятельное инвестирование — Очень рискованное мероприятие, необходимо потратить значительное время, чтобы научиться понимать, где живёт прибыль и как её поймать человеку с улицы. Всё как в обычном мире, можно играть вдолгую, можно нацелиться на быстрые спекуляции. Покупки на длинные дистанции, не подкреплённые железобетонными аргументами, — крайне дурацкая идея, через пару лет криптофантики могут оказаться криптомусором.\n\nКриптоинвестиционный фонд — Тем, кого расстроил первый пункт, на помощь придёт специальная организация, соединяющая знания специалистов и деньги. Отличить лохотрон от добросовестной компании сложно, увы.\n\nИнфоцыганство — Продавать курсы «Миллион на NFT!» Написать книгу «NFT для чайников».\n\nНаписать приложение — Не нужно писать серверную логику, всё уже происходит в блокчейне! Что может быть проще, чем выпускать лотерейные билеты в виде NFT и проводить розыгрыши смарт-контрактом?\n\nЗапустить сбор инвестиций через продажу NFT коллекции — За продажей коллекции из нескольких тысяч штук можно декларировать идею инвестирования в дальнейшее развитие вашего дела. Конечно, придётся очень понравиться аудитории и придумать красивую историю использования этих NFT.\n\nНаписать генератор NFT коллекций — Никто не будет вручную рисовать тысячи картинок и руками их размещать на OpenSea. Специальное приложение с удобным интерфейсом и отслеживанием конкурентов — это востребованный продукт. А если ещё прикрутить нейросеть для создания изображений, у-у-у.\n\n▍ Это не всё\r\nБольшинство вариантов использования NFT, которые бурно цветут сейчас, сотрутся из общей памяти через несколько лет. То, что останется — это люди, использующие NFT, использующие их для построения конструкций, невозможных без этой технологии. Люди, разрабатывающие NFT проекты, должны стремиться к решению настоящих проблем в конкретных ситуациях. NFT — это только техническое средство, а не цель. Нелепо придумывать применение NFT ради придумывания применения NFT.\n\r\nПредыдущие части:\n\n\nОтдаю NFT за 880 миллионов долларов — что такое NFT.\nNFT, NFT, NFT — медиавирус. Хронологии большого взрыва NFT-вселенной.\n\n   "
    },
    "Из Warcraft в реальную жизнь или что такое Soulbound NFT": {
        "href": "https://habr.com/ru/post/684008/",
        "content": " 26 января 2022 года сооснователь блокчейна Ethereum Виталик Бутерин в своем блоге предложил концепцию NFT - Soulbound. В этой статье мы:разберем что это такоепоговорим про Use Casesобозначим технические проблемы реализации такого токенарассмотрим как хотят реализовывать Soulbound NFT в сети TONну и конечно же, выясним при чем тут варкрафтЧего в этой статье не будет, так это рекламы NFT или каких-то маркетплейсов NFT)Отмечу также, что Виталик недавно опубликовал расширенное описание Soulbound NFT - почитать можно здесь .Что такое Soulbound NFTИтак, в своем блоге Виталик Бутерин обращает внимание, что в игре World of Warcraft есть отличная механика - игровые Soulbound предметы. Однажды \"полученные/поднятые\" нельзя продать или передать. Обычно подобные предметы, можно получить выполняя сложные и командные квесты. Как отмечает Виталик Бутерин, Soulbound предметы, как игровая механика, побуждают игроков проходить сложные квесты, а также выделяют тех или иных игроков обладающих подобными предметами среди остальных.Блог Виталика всегда привлекает много внимания, там часто описываются блокчейн концепции, которые, говоря простым языком, выстреливают. Например, идею крупнейшей децентрализованной биржи Uniswap, основатели взяли именно из блога Виталика - ссылка на историю здесь.Причем тут NFT и игровые предметыВозникает вопрос, при чем тут NFT(Non-Fungible Tokens). Виталик отмечает, схожесть NFT и игровых предметов. Но в играх предметы могут сигнализировать о чем либо(пройденные квесты, посещенные места, принадлежность к комьюнити), а NFT в своем текущем виде, отражают, что вы умеете покупать NFT за криптовалюты, а также ваше богатство.NFT - это невзаимозаменяемый токен, каждый экземпляр которого уникален (специфичен) и не может быть замещён другим аналогичным активом. Токен - это единица учета некоторого цифрового актива в некоторой сети.Именно поэтому Soulbound NFT, могут иметь положительное влияние на крипто индустрию, так как это, что-то за рамками просто накопления и перепродаж, трейдинга и прочих вещей, связанных с богатством.Что такое Soulbound NFT функциональноКак и обычные NFT, Soulbound NFT будут представлять собой некоторый смарт-контракт, соответствующий стандарту.Для того, чтобы токены можно было использовать в других приложениях (от кошельков до децентрализованных бирж) вводятся стандарты интерфейсов смарт-контрактов для токенов. В данном случае интерфейс — это сигнатура (синтаксическая конструкция объявления функции) функций без реализации самой функции.На данный момент принятого стандарта или решения как должен выглядеть смарт-контракт Soulbound NFT, но в своей работе Виталик описывает следующее:Непередаваемость - Soulbound токены нельзя передать или продатьПубличная видимость, но с некоторым механизмом приватности - т.е. возможность скрыть видимость владельцуМеханизм восстановления - вы можете потерять ключи от своего кошелька, а с ними и все Soulbound NFT, ведь их нельзя передатьМеханизм сжигания или защиты от спама - злоумышленники могут заспамить вас Soulbound NFTЕсли говорить грубо, то основное отличие обычных NFT, от Soulbound NFT, это то, что они привязаны к крипто кошельку и их нельзя передать. А также как следствие этого необходимость механик восстановления и защиты от спама.Ниже, оттолкнувшись от проблем, мы разберем возможную реализацию.Какие могут быть Use CasesОбразовательные дипломы/сертификатыОбразовательные учреждения могли бы выпускать Soulbound NFT для своих студентов по завершению обучения. Так как Soulbound NFT нельзя перепродать или передать, подобный диплом будет отражать квалификацию человека, без необходимости подтверждать его по централизованной базе в учреждении.Доказательство присутствияОрганизаторы мероприятий могли бы выпускать Soulbound NFT для тех, кто посетил их мероприятия. Доказательство присутствия будет неизменным после того, как посещаемость будет записана в блокчейне.Цифровое резюмеРазвивая две предыдущие идеи, коллекция из Soulbound NFT могла бы быть вашим цифровым резюме - NFT о предыдущих местах работы, NFT дипломы из университетов, а также NFT с разных мероприятий, конкурсов и хакатонов.Управление децентрализованными организациямиИз-за возможности передавать токены и NFT современные DAO уязвимы к Sybil атакам и атаке 51%. Некая привязка к непередаваемым сущностям могла бы решить подобную проблемы, но здесь конечно очень большое пространство для проработки.Беззалоговое кредитованиеВыплаченные обеспеченные кредиты, могли бы отмечаться в виде Soulbound NFT, таким образом подтверждая вашу кредитоспособность, формируя некую кредитную историю, опираясь на которую кредитор мог бы выдать кредит без залога.Институт репутацииТокены Soulbound могут помочь создателям NFT создать репутацию вокруг своих проектов и сообщества. Cвязывая Soulbound NFT с коллекциями NFT, они позволят коллекционерам узнать, какие токены им принадлежат. Это поможет предотвратить фальсификацию и обман личности создателя злоумышленниками.Недостатки и проблемы реализации такого токенаИз-за того, что Soulbound NFT нельзя передавать, возникает необходимость механизма восстановления в случае потери ключей от кошелька. Возможным решением данной проблемы будет некоторое децентрализованное сообщество вокруг коллекции Soulbound NFT, которое могло бы восстанавливать Soulbound NFT, но проблема данного решения в его централизации. На данный момент \"правильный\" механизм восстановления — это дискуссионная тема.В первом приближении Soulbound NFT выглядят как полностью публичная технология, но если взять все Use Cases описание выше, то возникает явная необходимость разграничения видимости Soulbound NFT, а также вопрос приватности (Например вы не хотите чтобы работодатель просматривающий ваши Soulbound NFT, представляющие собой резюме, видел ваши Soulbound NFT достижения в играх, хобби и.т.д ). Простым решениям является наличие нескольких кошельков, хранящих разные Soulbound NFT в зависимости от потребностей, но непонятно на сколько это будет удобно.Человеческий фактор, также вносит проблемы в концепцию Soulbound NFT. Можно выпускать поддельные Soulbound NFT, например, сигнализирующие, что вы посетили некоторое мероприятия, но на самом деле вы просто заплатили, чтобы вам его выпустили и ничего не посещали.Черновик Soulbound NFT в TONНа данный момент в сети TON идет обсуждение стандарта Soulbound NFT и даже есть пример смарт-контракта. Рассмотрим отличие от обычных NFT, а также какую функциональность, предлагается решать за рамками стандарта.NFT в TONСтандарт NFT в TON, представляет собой два тип смарт-контрактов:смарт-контракт коллекциисмарт-контракт отдельной NFTДля каждой NFT в коллекции необходимо выпускать отдельный смарт-контракт. Если вы выпустите коллекцию, содержащую 10 000 элементов, то вы развернете 10 001 смарт-контракт, один контракт коллекции и 10000 контрактов для каждого элемента.Смарт-контракт коллекции реализует деплой элементов коллекции, а также Get-методы, которые возвращают информацию о коллекции.Смарт-контракт отдельной NFT передачу права владения NFT, внутренний (внутренний в том смысле, что другие смарт-контракты в сети смогут обращаться) метод возвращающий данные о NFT и Get-метод возвращающий данные об отдельной NFT.Подробнее про стандарт NFT в блокчейне TON можно почитать здесь.Soulbound NFTЧтобы NFT нельзя было продавать и передавать между разными аккаунтами, а можно было передавать только между аккаунтами его владельца. Смарт-контракт отдельной NFT будет хранить неизменяемый публичный ключ владельца, и для смены адреса владельца необходимо будет отправить перевод с нового адреса с подписью в полезной нагрузке .Также меняется и обязательный интерфейс, Soulbound NFT вместо механики передачу права владения NFT, добавляется:передача собственности - передача NFT между своими кошельками (т.е владелец остается тот же)доказать право собственности - подтверждение собственности в сетиПередача права собственности позволят также \"сжечь\" NFT отправив её на нулевой адрес. Механика передачи собственности необходима в случае изменения версии кошелька.В TON кошельки представляют собой смарт-контрактыДоказательство право собственности позволит создавать интересные механики внтури сети TON, благодаря акторной модели смарт-контрактов в TON.Модель актора — это математическая модель параллельных вычислений, которая лежит в основе смарт-контрактов TON. В нем каждый смарт-контракт может получить одно сообщение, изменить собственное состояние или отправить одно, или несколько сообщений в единицу времени.Например, смарт-контракт Soulbound NFT можно использовать как прокси, которое доказывает ваше владение Soulbound NFT. Вы можете отправить сообщение в Soulbound NFT, и он проксирует сообщение для целевого контракта с его индексом и адресом вашего кошелька в заголовке. Таким образом, целевой контракт может знать, что вы являетесь владельцем Soulbound NFT, который относится к определенной коллекции.Подобная архитектура смарт-контрактов позволяет нам переводить Soulbound NFT между кошельками владельца и в то же время ограничивает переводы третьим лицам. Чтобы привязать Soulbound NFT к адресу, нам нужно отправить сообщение с этого адреса на Soulbound NFT с подписью, поэтому вы должны быть владельцем приватного ключа и адреса одновременно.Кстати смарт-контракты на TON пишутся с помощью языка FunC, бесплатный уроки есть здесь.На 22 августа 2022 года данный стандарт является черновиком, поэтому если у вас есть идеи по реализации Soulbound NFT в TON вы можете поучаствовать.ЗаключениеТаким образом Soulbound NFT это непередаваемая NFT, с некоторым механизмом, позволяющим восстановление владения. Идея Soulbound NFT призвана создать в блокчейне некоторую систему социальных сигналов, помимо текущей системы умножения богатства. Что будет с данной технологией конечно покажет только время).P.S Подобные статьи планирую публиковать здесь, там же пишу про блокчейн TON.   "
    },
    "Что такое NFT на самом деле, сколько обмана может скрывать, и в каких сферах реально применим": {
        "href": "https://habr.com/ru/post/564676/",
        "content": " NFT — одна из самых обсуждаемых тем в криптосообществе, которая стала настолько популярной, что привлекла немало внимания и за его пределами. Единственная проблема заключается в том, что очень немногие знают, что такое NFT и как это работает на самом деле.Пришло время пролить свет на NFT и глубоко погрузиться в детали того, как они работают, и сколько обмана может быть в сфере NFT.Публикация основана на эксклюзивном переводе статьи: «NFT Madness — What they are and what they are not. Why they're great, and why they suck» для моего telegram-канала Clawed Project.Давайте начнем.Что такое NFT на самом деле?Всем известна аналогия с предметами коллекционирования. К сожалению, эта аналогия в лучшем случае совершенно неадекватна, а в худшем — явно вредна.NFT (Non Fungible Tokens, не взаимозаменяемый токен) как термин означает, что каждый цифровой токен в сети уникален. Каждый токен содержит небольшое количество данных, которые уникальны для данного токена. Вот и все. Это просто небольшие контейнеры данных, которые перемещаются по блокчейну между адресами.Сейчас у NFT на блокчейне Ethereum есть ряд особенностей, благодаря которым именно они являются весьма популярными. Также вероятно, что в других сетях будут реализованы некоторые или все подобные функции, если они еще не реализованы.Адрес создателя NFT сохраняется как часть NFT. Таким образом, информация о текущем владельце NFT является публичной.В токене NFT может быть установлен процент роялти. Когда NFT затем торгуется в любой момент времени между любыми двумя адресами ETH, роялти от этой «продажи» будет перенаправляться на адрес создателя токена.Теперь, прежде чем мы пойдем дальше, важно понять еще один аспект. NFT очень и очень малы. Хранить реальные данные в блокчейне, даже такие маленькие, как jpg размером 64x64, непомерно затратно. В большинстве NFT будет храниться всего несколько байтов данных. Например, серийный номер или URL.Короче говоря, NFT — это, по сути, уникальный клочок бумаги с серийным номером, паролем или веб-адресом.Чем NFT не являютсяNFT — это не цифровые хранилища медиаконтента. Они не хранят цифровой контент (файл) в блокчейне. Если вы покупаете NFT изображения или песни, на самом деле вы получаете токен с URL-адресом песни или изображения, размещенный на случайном веб-сервере.NFT не препятствуют копированию, изменению, удалению или любым другим действиям в отношении любых цифровых или физических объектов, на которые они ссылаются.NFT по своей сути не предоставляют права собственности и не удостоверяют авторские права на какие-либо активы, с которыми они связаны.Давайте еще раз сделаем краткое резюме: NFT — это просто уникальные торгуемые клочки бумаги с небольшим количеством нацарапанной на них информации.У NFT есть несколько потенциальных способов действительно что-то значитьNFT может разблокировать функции при подключении к внешней системе. Пример — проект NBA Topshot. Токен имеет ценность благодаря взаимодействию с внешней системой, чтобы отображать «спортивный момент», который находится на веб-сайте. Если сайт закроется, токены немедленно станут бесполезными, так как достум к «моментам NBA» теряется. То же самое с CryptoKitties. Если сайт падает, токены CryptoKitty бессмысленны и не работают. В обоих случаях NFT — это просто торгуемый серийный номер, который связан с «моментом» или «котиком» на серверах владельцев проектов. Еще один пример: NFT, которые могут быть отправлены в приложение, которое затем сжигает (уничтожает) их в обмен на отправку вам какого-либо физического товара, например, футболки.Создатель цифрового объекта (или физической вещи) может продавать законные права на него вместе с NFT. Нет гарантии, что продавец NFT владеет правами на связанный объект. Чтобы юридически передать права/собственность, нужно оформить юридически значимый договор. Для крупных объектов, как дом или бизнес, потребуется значительная юридическая работа и оформление документации. Если вы хотите купить право собственности на актив с NFT, вы должны убедиться, что продавец является правообладателем и он дает письменное согласие на продажу вам прав вместе с NFT и прилагает всю документацию, если она требуется. Однако нет причин, по которым вы не можете продать права собственности независимо от NFT в будущем. Короче говоря, в настоящее время ничто юридически не связывает NFT с владением цифровыми правами.Уникальные / секретные данные. В этом случае NFT содержит уникальные данные, видимые только адресу, которому он принадлежит, например, URL-адрес или пароль к секретному клубу. Если у покупателя есть основания полагать, что информация все еще секретна, покупка NFT становится способом ее получения. Проблема очевидна — это интернет, ничто не остается секретом надолго, и нет гарантии, что создатель или предыдущие владельцы не разгласили секретную информацию.Обман с использованием NFTКак вас могут обмануть с помощью NFT:Покупка NFT для владения связанным с ним объектом, когда продавец изначально не владеет объектом.Покупка NFT для владения объектом без фактического получения юридически подтверждаемых оформленных прав на объект.Покупка NFT для владения объектом и получение неисключительных прав (вместо исключительных прав), что означает, что автор может продолжать чеканить бесконечное количество NFT для этого же объекта.Покупка «коллекционного» NFT, после чего сайт/сервер/система с контентом, на который ссылается NFT, перестает работать или исчезает.Покупка NFT для инвестиций, при этом у NFT установлена непомерная (50–100%) выплата роялти. Это означает, что большая часть или вся выручка от ваших инвестиций поступает создателю, а не вам, когда вы перепродаете NFT.Покупка арта/прочего вместе с NFT, после чего URL-адрес хоста цифрового контента упал (или его злонамеренно изменили), так что ваш NFT больше не не ссылается на объект, который вы купили. (Но, по крайней мере, у вас все еще есть права собственности, если вы не попадаете под пункты №1 и №2).Где применимы NFT прямо сейчас?Самая большая реальная история успеха NFT на данный момент — проекты CryptoKitties, CryptoPunks, TopShot и т. д. То есть, когда веб-сайт/приложение могут взаимодействовать с NFT, чтобы показывать вам контент в качестве доказательства владения этим контентом в рамках сайта/игры.  NFT имеют большой потенциал для проектов с торговлей игровыми предметами, поскольку компания-разработчик игры может выпускать игровые предметы с определенной ставкой роялти (например, 1%) и всегда получать прибыль, если игра и торговля набирает обороты. NFT также могут служить сувенирами на мероприятиях, то есть вам может быть выдан токен за посещение концерта в качестве доказательства того, что вы там были. NFT подходят для продажи цифровых билетов. Их нельзя напрямую скопировать/клонировать, и даже если они будут перепроданы на вторичном рынке, вы получите роялти (до тех пор, пока люди не начнут обходить роялти и просто не начнут продавать адрес ETH, на котором находится токен, или принимать наличные в качестве оплаты, а затем переводить токен бесплатно). Что касается владения самостоятельными цифровыми активами или физическими объектами, там, безусловно, есть потенциал, но сейчас NFT в этой сфере юридически бесполезны. Да, NFT также отлично подходят для отмывания денег, поскольку, если вы покупаете какую-то чушь, например, коллекционную фотографию шляпы в Интернете, невозможно сказать, что вы переплатили, так как разброс цен на NFT огромен, а сами цены — произвольны.    "
    },
    "В защиту NFT": {
        "href": "https://habr.com/ru/company/jugru/blog/651067/",
        "content": " Апогей безумия-2022: в метавселенной обсуждают NFT цифровой какашкиМы без конца ругаем NFT и, разумеется, за дело. Но ощущаю, что рядом со справедливой критикой встречается и необоснованная. И часть оценок вида «скоро всё точно громко лопнет» или «это вообще никому не нужно» излишне категоричная.При этом о минусах NFT на Хабре активно пишут, а вот развёрнутых текстов с другой стороны здесь не видел. Поэтому, хотя я совсем не фанат NFT, во имя баланса решил побыть адвокатом дьявола и описать эту другую сторону. Нужно ведь, чтобы вечером пятницы Хабру было о чём похоливарить! А если вы всей душой ненавидите и NFT, и холивары, лучше просто пропустите пост.Важные оговорки:Я не суперэксперт и могу в чём-то ошибаться (поправляйте в комментариях), но старался делать только такие выводы, для которых достаточно моих познаний.Изложенное — сугубо моё личное мнение (хоть оно и в корпоративном блоге).Я не связан с NFT-проектами, так что у меня нет финансового интереса убеждать вас в их пользе.В чём согласен с критикойДо того, как возражать, перечислю те связанные с NFT проблемы, с которыми не спорю:Мошенничество. Человек, создавший NFT какого-то художественного объекта, порой не имеет отношения к этому объекту, а настоящий автор может даже не знать о происходящем. В отмывании денег технологию тоже используют.Нереалистичные финансовые обещания и ожидания. Продавцы NFT изображают золотую жилу: успей купить сейчас, и завтра перепродашь в разы дороже (хотя на деле многие явно останутся с непродаваемыми токенами). В рекламе дикий булшит из неподтверждённых заявлений:Булшит тут не только про инвестиции. Технологию порой описывают как чудо-инновацию метавселенных, которая спасёт искусство и гейминг. Тем временем многие цифровые художники, которых пришли «спасать», плюются от этого, а при геймерах вообще опасно произносить «NFT».Влияние на экологию. Ради виртуальных ссылок на виртуальные картиночки мы жжём много реального угля.Подверженность «вымиранию ссылок». У скольки NFT спустя годы перестанут быть доступны связанные с ними файлы? Что покупатели ощутят в связи с этим?Все эти проблемы считаю вполне реальными. Хорошая новость лишь в том, что многие из них могут уйти со временем (например, крупные площадки могут начать лучше бороться с плагиаторами). Многие другие сферы поначалу тоже были Диким Западом, а потом повзрослели.А вот другие претензии к NFT не готов принять настолько же безусловно, с ними согласен лишь частично. И у меня на это пять причин.Илон Маск, как водится, в трендеПервая причина (о пользе и «фантиках»)Часто говорят что-то такое: «NFT не приживутся, потому что это просто \"фантик\" без практической пользы».С определением «фантик» во многом согласен, но с выводом «не приживутся» мешает согласиться вот что. Поскольку NFT существуют в единственном экземпляре, это коллекционные объекты. Давайте вспомним, что характерно для других коллекционных объектов (редких монет и почтовых марок, картин и антиквариата, бейсбольных карточек и виниловых пластинок):У многих из них нет «практической пользы». Старую почтовую марку нельзя использовать даже для отправки письма. На неё можно только любоваться.Эти бесполезные вещи могут стоить гигантских денег. В прошлом году бейсбольную карточку продали дороже 6 миллионов долларов.Такие цены только у самых редких и желанных объектов, а массовые стоят копейки. Современную почтовую марку дорого не продашь.Ценные объекты — статусный символ. Его можно покупать не только «чтобы самому смотреть», но и «чтобы другие завидовали», гордо повесить в гостиной.Но ценность объекта непререкаемая только внутри сообщества, а для кого-то «снаружи» он может выглядеть ерундой («молятся тут на старую бумажку»).Весь этот список применим к NFT. И в этом отношении NFT получаются просто ещё одной категорией «дорогих фантиков» в дополнение к давно существующим. Только при этом NFT считаются «злом во плоти», а филателия «респектабельным хобби».И тут возникает вопрос: почему NFT не могут прижиться, если филателия прижилась?Вы считаете, что у человечества временное помутнение рассудка, потому что кто-то заплатил $250 000 за гифку с мусоркой? Так люди ещё до NFT-бума платили больше миллиона долларов за редкие почтовые марки, где изображение самолёта по ошибке оказалось перевёрнуто. То есть в 1918 году кто-то случайно накосячил при печати, а век спустя люди добровольно отдают гигантские деньги, чтобы прикоснуться к его ошибке. Чем NFT безумнее этого? Предполагаю, NFT раздражают людей попросту из-за того, что о них жужжат отовсюду всякий булшит, пока филателисты сидят тихо. Но думаю, NFT-хайп тоже стихнет, достаточно просто подождать.Конечно, ещё есть та разница, что филателия вряд ли завтра куда-то денется, а вот про NFT человечество может и забыть. Такое в истории уже бывало — скажем, в 90-х США захлестнула волна коллекционирования игрушек Beanie Babies, а потом схлынула. Но, по-моему, NFT могут оказаться как новыми Beanie Babies, так и новыми почтовыми марками, тут только время покажет.А в целом, по-моему, тут ломаются все рассуждения о «фантиках», потому что в контексте коллекционирования это не ругательное слово. Бывает даже коллекционирование настоящих фантиков от конфет (сакулумистика), то есть существуют люди, которые всерьёз коллекционируют фантики в прямом смысле слова. И непонятно, почему тогда нельзя собирать цифровые «фантики».Бейсбольные карточки — важная в США культура, и неудивительно, что в NFT-мире они тоже возникли Вторая причина (о владении)Кто-то скажет: «Но почтовой маркой ты владеешь, а NFT не дают настоящего права владения на объект, вот поэтому они и не нужны».Действительно, юридически не даёт. Но прежде чем делать вывод «не нужны», хочу задать вопрос. А другие цифровые товары, за которые люди массово платят деньги и которые им «нужны», дают право владения?Когда вы покупаете игры в Steam, вы ими не владеете. Amazon дистанционно удалял книги прямо с читалок пользователей. Про стриминги вроде Netflix со Spotify и говорить нечего. Да люди вообще кристаллы в мобильных играх покупают. И это всё им, видимо, нужно.Конечно, у NFT есть отличия (например, в Steam нельзя бесплатно сохранить чужую игру по правому клику). Но моя мысль в том, что человечество в целом согласилось на «ненастоящее владение» цифрой. Людям важнее не юридически владеть, а удовлетворять конкретные хотелки. Если фильм запускается, пользователь уже доволен, для хотелки «провести вечер» этого достаточно. И раз NFT покупают — вполне возможно, что хотелки тоже выполняются (у кого-то это будет «понтоваться в твиттере», у кого-то — «заплатить любимому художнику»).Можно печалиться из-за тенденции «ненастоящего владения» и солить на зиму жёсткие диски с файлами. Хорошо понимаю эту точку зрения. Но не понимаю, в чём провинились конкретно NFT, когда это общая ситуация.Когда речь о работе известного автора, хотелкой может быть «чтобы лично он считал меня владельцем»Третья причина (о технологиях и социальном соглашении)Есть ещё тезис из популярного хабрапоста:«Технология NFT не делает вообще ничего. \"Ваша\" картинка с обезьяной полагается исключительно на социальное соглашение».И тут до того, как делать вывод «NFT обречены», предлагаю задуматься вот о чём. Если NFT — дутый пузырь, то противоположностью этой эфемерности будет золото, проверенное веками. Вопрос: как оно получило этот статус?Конечно, оказались важны редкость, устойчивость к коррозии и красивый блеск. Но, насколько понимаю, все эти важные факторы не сработали бы без главного: люди договорились считать его ценным. То есть поначалу оно полагалось на социальное соглашение.А когда страны отказывались от обеспечения валют золотом, были опасения, что теперь валюты — «фантики» и всё рухнет. Но не рухнуло: люди согласились считать, что эти фантики имеют ценность.А когда появились криптовалюты, было много слов, что это фантики без реальной ценности и они вот-вот лопнут. Но биткоину уже 13 лет, а он жив и ценится. Из-за социального соглашения о его ценности.Смотрите, что получается: важнейший фактор в самых разных ценностях — вера людей в него. И поэтому тезис «в NFT вместо технологий всё держится на социальном соглашении» для меня не выглядит однозначно ругательным. Ведь соглашение — это самое главное и есть. За него люди и готовы платить.А технологии могут подтянуться следом. Скажем, Twitter уже работает над специальными аватарками, позволяющими демонстрировать купленный NFT. То есть вроде как NFT не даёт юридического владения, но благодаря социальному соглашению Twitter признаёт это владение и поддерживает его на технологическом уровне. А значит, скоро нельзя станет сказать «технология не делает вообще ничего». Социальное соглашение решило считать вот эти картинки особо ценнымиЧетвёртая причина (о пирамидах и пузырях)«NFT — пирамидальный пузырь, поэтому всё точно громко лопнет и будет позабыто».Продавцы NFT заманивают покупателей перспективой «сможете перепродать дороже». Но для такого необходим постоянный приток новых покупателей с всё большими суммами — напоминает финансовые пирамиды, где в итоге возможности исчерпывались, всё рушилось и люди теряли деньги. Так что велик соблазн приравнять NFT к Мавроди и Понци и уверенно пророчить системе такой же крах.Сходство понятно, но вижу и важные отличия. Скажем, Чарльз Понци врал, что деньги приносит бизнес (а не следующие вкладчики), и обещал удвоить вложения за 90 дней (что на долгой дистанции заведомо невыполнимо). А вот в случае NFT то, что для прибыли потребуется следующий покупатель (которого может и не найтись) — публичная информация. И обещаний «гарантированные 100% за 90 дней» даже в сомнительной рекламе не вижу. То есть тут люди лучше понимают, что идут на риск (хоть и не так хорошо, как хотелось бы).В историях вроде МММ сначала «всем всё платится» и люди расслабляются, а потом происходит неизбежный сбой платежей, вызывающий панику. Но в NFT изначально нет «всем всё платится», уже много людей потеряли на них деньги. А значит, в подобной потере нет сбоя системы и нет повода для массовой паники, это рядовая ситуация. Это всё не говоря о том, что нести деньги в МММ можно было только ради быстрой прибыли, а вот NFT могут покупать и не для перепродажи, не жалея о потраченных деньгах.Поэтому думаю, что ситуацию лучше описывает не слово «пирамида», а слово «лотерея». Да, большинство участников лотереи теряет деньги. Но это ожидаемая ситуация, и она не мешает лотереям существовать сколь угодно долго, в них не заложено неизбежного обрушения.Значит ли это, что я уверен в долгосрочном будущем NFT? Нет, всякое может случиться. Пузырь удобно определять уже по факту «он уже лопнул», а вот заранее сложно, это пузырь Шрёдингера.Но даже если лопнет, хочу напомнить вот о чём. В 2000 году люди массово разочаровались в интернет-проектах, и их акции рухнули, тоже был масштабный лопнувший пузырь. Но теперь мы видим, что в целом интернет-проекты победили, а тогда была лишь временная заминка, вызванная излишним хайпом. Люди сначала сами перехайпили проекты, потом сами же разочаровались, но всё это никак не отменило общей жизнеспособности интернета. И тут может быть так же: да, глупого хайпа много, но это ещё не означает, что тут нечему долгосрочно развиваться.И в контексте «пирамид» мне хочется ругать не NFT в целом, а конкретные рекламные тексты, которые изображают всё как «верное дело» и могут вводить в заблуждение. Но и реклама инвестиционных приложений от вроде бы солидных банков для меня порой выглядит так, словно её делали креативщики подпольных казино. Эта проблема не только в NFT.По-моему, когда в интернетах пишут «успей купить новинку по выгодной цене» — это значит, что уже поздноПятая причина (о допамине)Есть ещё позиция «только дураки покупают NFT». Мол, пусть даже это всё будет успешно существовать, в мире много глупостей, и нормальный человек покупать ссылки на картинки не станет. Тут хочу задуматься: по каким вообще причинам люди могут покупать NFT, помимо инвестиционных? Вижу такие: коллекционерский интерес, спортивный азарт, статус в сообществе, желание «владеть» (пусть в довольно условном смысле), желание заплатить любимому автору и быть причастным к нему, следование моде. Ну и для миллионеров новый вариант «на какие ещё блестелки можно потратить деньги».И все эти причины объединяет то, что они «делают жизнь ярче»: это штуки, которые не пощупать руками, но которых кому-то может психологически хотеться. Совсем грубо говоря, в этих случаях платят за то, чтобы в голове синтезировался допамин.А это очень субъективная штука. У кого-то мозг радуется путешествию, у кого-то концерту, у кого-то любимой еде. Каждый сам ищет, что даёт допамин ему.И когда вижу реплики, что покупать NFT не надо, мне видится следующее: люди, которые не получают допамин от NFT, объясняют другим, что им его тоже не надо так его получать и радоваться жизни.Слушайте, я и сам не покупаю NFT. Но, может быть, другим людям всё-таки виднее, что делает их жизнь ярче, и они там без нас как-нибудь разберутся?ВыводыНа всякий случай проговорю ещё раз: я не пытаюсь сказать, что NFT — это очень хорошо и у них точно будет долгая счастливая жизнь. Возможно, скоро их цены резко рухнут. Возможно, через год о них тихо забудут. Возможно, они останутся пристанищем мошенников, а «конструктивные» применения завянут. Всё возможно.Но хочу сказать вот что:Попытки уверенно похоронить NFT («эта пирамида точно скоро рухнет») выглядят для меня преждевременными. По-моему, это явление вполне может оказаться долгосрочно устойчивым и привлекающим людей.Утверждения «у NFT нулевой смысл» для меня выглядят чрезмерными. При всех недостатках NFT и булшит-безумии вокруг них, для части людей смысл в них тоже есть. Просто не надо измерять его практической применимостью.А напоследок минутка рекламы совершенно о другом. Мы проводим конференции для разработчиков, и они по своему духу противоположны NFT-хайпу. Потому что мы терпеть не можем булшит, завышенные обещания и бессмысленные общие слова. Мы любим профессионализм, хардкор и пользу.Так что основа наших конференционных программ — техническая конкретика и практическая полезность, у нас на слайдах часто можно увидеть код. Если вы ненавидите NFT, а такой подход цените, обратите внимание на наш весенне-летний сезон!   "
    },
    "NFT, NFT, NFT — медиавирус": {
        "href": "https://habr.com/ru/company/ruvds/blog/653665/",
        "content": " В прошлый раз мы попробовали разобраться в том, что вообще такое NFT. Из этой части вы узнаете как выглядел процесс перерождения технологии организации данных в медиавирус.\n\n\r\nКриптоархеологи проводят самые настоящие раскопки блокчейнов в попытке обнаружить токены, которые могли бы считаться первыми NFT. Из-за разногласий по поводу формулировки требований к NFT имеют право на существование разные мнения, но превалирует версия, что смарт-контракт Terra Nullius, появившийся 7 августа 2015 г. был первым в своём роде.\n\r\nСсылки: [Анонс на reddit] [Код контракта]\n\r\nФункционально это была демонстрация возможности записывать произвольные данные в блокчейн: пользователи могли создать токен, содержащий некое текстовое сообщение. Каждый токен маркировался уникальным порядковым номером, но отсутствовала возможность поменять владельца, то есть их было невозможно продать.\n\n\n\r\nНе так давно на базе первых сообщений были сделаны современные NFT, что позволяет удобно почитать послания от первых криптонавтов для потомков.\n\r\nДля особых ценителей старины существует возможность потыкать ручками в содержимое токенов  тут.\n\n\n\r\nИгра Blockplots (второе название Etheria 1.1) была запущена 29 октября 2015 г. Пользователи покупали участки на карте, которые потом можно было перепродавать другим участникам. В блокчейне каждый кусочек виртуальной землицы был представлен как отдельный токен. Именно наличие функции смены владельца является причиной, по которой этот вид токенов борется за право называться первыми NFT в истории.\n\n\n\r\nНа тот момент идея продавать кусочки виртуальной собственности уже давно была неновой. В 2005 году некий находчивый студент придумал веб-сайт Million Dollar Homepage для креативного сбора средств на оплату учёбы. Идея сайта заключалась в продаже места на пустой картинке размером 1000x1000 пикселей. Покупатели размещали на выкупленной площади изображение и ссылку на свой ресурс. Один пиксель стоил один доллар, через полгода после запуска сайта молодой человек собрал свой миллион.\n\n\n\r\nИменно этот сайт стал вдохновением для разработчика по имени William Entriken (@fulldecent), айтишная активность которого настолько бурная, что его эксперименты даже засветились в журнале Хакер.\n\r\nБлокчейн Ethereum давно привлекал интерес Уильяма. Имея за плечами серьёзный опыт разработки, Уильям видел себя в роли организатора, его целью было собрать группу единомышленников для нового проекта. Среди существовавших идей его сразу заинтересовали неразмениваемые токены, так как ему показалось, что именно NFT должно было раскрыть настоящий потенциал распределённых реестров, хотя на тот момент подобное мнение мало кто разделял.\n\r\nТак совпало, что именно тогда уже вовсю гудел проект CryptoKitties, который стал первым NFT-проектом, вызвавшим широкий общественный резонанс. Милые картинки с котиками, игровая механика, построенная вокруг скрещивания и система аукционов привлекли столько внимания, что игра достигла грандиозного коммерческого успеха.\n\n\n\r\nВ игре CryptoKitties токены представляют котиков. Игроки обменивают NFT (как бы котиков) на криптовалюту Ethereum. Игровой процесс включает размножение и торговлю, пользователи стремятся заполучить самые редкие породы, чтобы заработать на их продаже. Все процессы в игре выполняются с помощью смарт-контрактов. Не только транзакции, но и данные о котятах находятся в блокчейне. Есть два способа заполучить котёнка. Первый — это победить на аукционе. Аукционы позволяют получить котёнка навсегда или в аренду. Другой вариант — это размножение. Чтобы «создать» нового котёнка необходимо иметь доступ к двум родительским особям. Рост системы опирался на желание игроков заполучить самых дорогих котят и выгодно их продать. Подробный анализ справедливости игры на англ. языке\n\n\n\r\nИз-за технических и экономических проблем проект затух через год и про него почти забыли, но в 2021 г. вместе со вспышкой интереса к NFT внимание к котятам в блокчейне снова вернулось.\n\r\nА в начале 2018 желанием повторить успешную идею загорелось множество разработчиков, которые были вынуждены искать помощь в разработке стандартов на NFT, так как на тот момент не существовало единого мнения относительно правильного устройства этой штуковины. Несколько конкурирующих команд работали над проектами экосистем, состоящих из смарт-контрактов, кошельков и торговых площадок.\n\r\nЛичные таланты и работоспособность Уильяма привели его к роли ведущего автора стандарта ERC-841, который позже был переименован в ERC-721. Получившийся стандарт был позитивно принят сообществом, работа над альтернативными вариантами была остановлена, и в течение нескольких лет не было предложено никакой замены. 6 июня 2018 г. работа над ERC-721 была официально завершена.\n\r\nПосмотреть подробное перечисление заметных проектов в мире NFT можно там.\n\n\n\n▍ Начало настоящего хайпа\r\nNFT длительное время оставалось словом известным лишь специалистам по криптовселенным, больше обозначением технологии организации данных, чем поводом для широкого обсуждения. Проекты, использовавшие подобные токены, возникали и исчезали, но никакого внимания технические детали не привлекали. Внезапно в начале 2021 года неразмениваемые токены вырвались за рамки профессиональных форумов и стали большим явлением, брендом с собственным рынком. Давайте посмотрим на динамику поисковых запросов по этой теме.\n\n\n\r\nСписок стран, из которых приходило больше всего запросов, выглядит очень странно. В первых строчках нет ни США, ни других стран, население которых объективно обладают средствами для рискованных инвестиций. Зато мы видим Китай, откровенно небогатые страны и страны, известные финансовыми «услугами». Причины такого распределения должны нам рассказать много нового о том, как используется NFT. А пока обратим внимание на пик, возникший в феврале 2021 г. Что же тогда случилось?\n\n\n\r\nИсточник: DappRadar\n\r\nК тому времени рынок «продажи» цифрового искусства посредством токенов уже появился, но отношение к нему было на уровне очередной высокотехнологичной забавы. Шум возник вокруг видеоролика CrossRoad за авторством компьютерного художника с ником Beeple, дело происходило на криптобазаре «Nifty Gateway (NG)», где эта работа была впервые продана за 66_666 $ пользователю Pablo (@pablorfraile). Сам NFT содержал ссылку на короткий анимационный ролик, который символически связан с выборами в США в 2020 г. Pablo затем выставлял на продажу этот лот несколько раз, значительно увеличивая цену, в феврале 2021 некто anonymous10 приобрёл его за 6_600_000 $ и передал пользователю Delphina Leucas (@babybeluga). Продажи цифровых фантиков за десятки и тысячи долларов на фоне криптобума никого до этого момента не шокировали, но мир не смог не обратить внимания на то, что какая-то непонятная нелепица стала объектом многомиллионных сделок. Это запустило снежный ком невероятных продаж, и процесс начал сам себя подогревать.\n\n\n\r\nБудет ли рынок двигаться дальше или три миллиарда это потолок? Пока неизвестно, прошло слишком мало времени, чтобы судить. Являются ли 200_000 кошельков, совершавших операции, уникальными пользователями? Нет, один пользователь может использовать несколько кошельков по самым разным причинам. Почему распределение по сумме сделок не является нормальным? Скорее всего, провал в распределении связан с существованием как минимум двух разных целей совершения сделок. Небольшие суммы — это то, что соответствует декларируемому назначению NFT: игровые покупки, коллекционирование, пожертвования и баловство. Крупные сделки являются клубком из разных причин, которые сводятся к двум базовым: погоня за прибылью и ЧСВ (чувство собственной важности).\n\n▍ Анализ регионального интереса\r\nВозвращаясь к странному списку стран, проявивших интерес к NFT, стоит воспользоваться свежими данными по поисковой активности за последние три месяца. В таблице ниже проранжированы регионы по количеству запросов, начиная с самых активных, раскраска ячеек соответствует классификации стран по ВВП+ППС на душу населения.\n\n\n\r\nВместо ожидаемой картинки, повторяющей распределение богатства в мире, имеем топ, в котором одновременно присутствуют богатые, умеренно обеспеченные и совсем грустные страны. Похоже, что NFT привлекает тех, кто активно ищет новые формы заработка в силу бедности или, наоборот, развитости финансовой системы. Чтобы продвинуться дальше, следует пристально посмотреть на Китай, который славится любовью к технологиям и имеет очень давнюю историю развития крипторынка.\n\n▍ Анализ китайского крипторынка\r\nЧто нам могут рассказать Google Trends? Вот список тем, интересовавших пользователей, которые искали информацию про NFT:\n\n\nТема\nПояснения\n\n\nИскусство\nИмеются в виду продажи цифрового искусства посредством NFT\n\n\nBinance\nСамая известная криптовалютная биржа\n\n\nOpenSea\nОдин из самых популярных NFT-базаров\n\n\nБанковские переводы\n-\n\n\nТокены\n-\n\n\nТорговые площадки\nИмеются в виду NFT-базары\n\n\nКошелёк\nПодразумевается личный счёт для операций в блокчейне\n\n\nDiscord\nМессенджер, в котором происходит максимум общения по разным темам, которые касаются NFT\n\n\nАватар\nПодвид NFT-картинок для аватарок\n\n\nВзаимозаменяемость\n-\n\n\nЦифровое творчество\n-\n\n\nОбезьяна\nИмеется в виду известный набор NFT „Bored Ape Yacht Club“\n\nКовыряния среди расширенных запросов на keywordtool.io, к сожалению, не выявили никаких неожиданных применений NFT в Китае. Похоже, придётся копать ещё глубже.\n\r\nДавайте посмотрим, какие выводы можно сделать из новостей про китайский крипторынок:\n\nКитай занимается регулированием биткоина больше 10 лет.\nЗапрет легальных обменников криптовалюты привёл к росту использования неофициальных децентрализованных бирж.\nВ 2013 банкам было запрещено прикасаться к биткоину, но человечки тут же насочиняли массу схем с промежуточным обменом живых денег на что-то, что позволяло продолжать покупать и продавать криптовалюту.\nНедавно майнинг был убит совсем, а вместе с ним любые операции с криптовалютой объявлены незаконными, что имеет последствия в отличие от простых запретов.\nВсе биржи, которые, изворачиваясь, продолжали работать, свернулись окончательно.\nРаздавив то, до чего было легко дотянуться, власти устроили подводный пожар, заставив мигрировать схему «децентрализованная основа + старая инфраструктура» в сторону бурного развития децентрализации.\nВзорвался ранее маргинальный рынок DeFi (децентрализованные финансы), который за пару ближайших лет предложит аналоги всех финансовых схем видимого мира и создаст новые инструменты. При этом у DeFi не может быть регуляторов. Это будет похоже на наивный финансовый мир конца XIX века, умноженный в миллионы раз.\nС точки зрения официальных регуляторов, DeFi — это анонимные программисты, создающие всё новые блокчейн-сети для анонимных пользователей. Как говорится, нельзя запретить песнь соловья, нельзя запретить пользователю запускать программу на его собственном компьютере, нельзя запретить отправлять и получать данные (даже для одного приложения это выльется в бесконечную гонку в роли догоняющего, воевать против экспоненциального роста — только выключать физическую сеть). Самих блокчейн-сетей пока ещё несколько десятков, но все они раскиданы по тысячам компьютеров в мире, никакое правительство в одиночку не способно остановить этот процесс.\nЛюди, что создают такие проекты, сами выбирают степень взаимодействия с реальным миром. По щелчку пальцев они вольны поменять страну проживания и целевой рынок. Подчинение локальным законам для них — это мера осознанного выбора.\nВсё это звучит слишком анархично, технологические реализации пока больше напоминают ранний интернет: пионеры с барабанами под руководством финансистов удачи, но при наблюдающемся давлении со стороны регуляторов на беспорядочные денежные массы, это явление ждёт сумасшедший рост и оформление во что-то гигантское.\nМожно относительно понятно запретить явные криптовалюты. В то же время перестрелять всё семейство DeFi крайне затруднительно, во-первых, без 100 грамм невозможно понять, что несёт риски криптовалют, а что безобидно, а, во-вторых, Китай сам заинтересован в легальных криптофинансах и давно поддерживает крупные эксперименты с управляемыми блокчейнами.\nВ результате сложилась странная ситуация, что можно плодить блокчейны без токенов. При этом в запретах под словом «токен» имеется в виду значение «криптовалюта». Хотя технически токеном является что угодно, привязанное к пользователю блокчейна. NFT, похоже, не вызывают вопросов у китайских регуляторов, но компании, работающие с NFT, стараются не использовать это название, вместо этого общепринятым стал термин Digital Collection.\nКитай официально объявил о запуске в конце января 2022 г. одобренной государством сети Blockchain Services Network (BSN) для размещения правильных NFT. Инфраструктура зовётся BSN-Distributed Digital Certificate (BSN-DDC). Считается, что барьером для незаконной деятельности будет обязательное подтверждение личности пользователей.\nНа легальных NFT-базарах запрещена перепродажа новых приобретений в течение полугода.\nЕсли совместить приведённые выше факты с тем, что Китай — это богатая высокотехнологичная страна с огромным населением, которая давно варится в теме криптотехнологий, то получается, что нет ничего странного в высокой поисковой активности по теме NFT на фоне мирового ажиотажа. Было бы интересно обнаружить, что-то необычное, но, увы.\n\n▍ Кто, кто в теремочке живёт?\r\nКипр, Гибралтар, Латвия, Филиппины, Косово, Армения, Афганистан, Босния и Герцеговина, Нигерия, Венесуэла. Почему эти страны объединяет повышенный интерес к NFT? По поисковым запросам из этих регионов ничего интересного обнаружить не удалось, кроме термина nft airdrop. Это словосочетание везде находится в первой десятке, за ним кроется бесплатная раздача NFT с целью накопления аудитории вокруг дальнейшей продажи картинок.\n\r\nПрошла примерно неделя разбора потоков информации, прежде чем наконец-то удалось составить грубую классификацию людей, активно принимающих участие в теме NFT. Следующая картинка вместе с пояснениями являются субъективным авторским мнением и претендуют лишь на создание начального понимания:\n\n\n\n«95%» — Бо́льшая часть населения Земли пока никак не участвует в этом балагане.\n\n«Дети» — продвинутые несовершеннолетние, что получили уникальный шанс вырваться из многовековой финансовой дискриминации и поучаствовать в этой игре, которая самых талантливых и удачливых делает богатыми. Свободных денег у них обычно нет, поэтому путь к успеху пролегает через терпеливое участие во множестве мусорных акций по раздаче бесплатных криптоактивов и зависание в криптоиграх, что позволяет единицам таки получить нормальные деньги. Понимание рынка у большинства находится на уровне «мне сказали и я побежал». Самые целеустремлённые занимаются созданием и продвижением своих коллекций NFT.\n\n«Бедняки» — жители бедных стран, которые отличаются от «детей» лишь жизненным опытом выживания на задворках капитализма, а также небольшими сбережениями. Делают всё то же самое. Их мотивация состоит в том, что небольшая копеечка, которую можно выбить из этой истории сравнима или превышает обычный доход.\n\n«Инвесторы» — широкая группа людей, которая включает не только профессиональных спекулянтов, главное что объединяет этих людей — это фрагментарное понимание происходящего на уровне восхищённых статеек. Здесь же находятся «коллекционеры», «меценаты», инстаграмные выпендрёжники, криптоцыгане и гаджетоманы.\n\n«Криптонавты» — крепкие айтишники, которые имеют средства, знания и интерес к покорению цифровых вселенных.\n\n«Мамонты» — незамеченные в движении мысли ультрабогатые гомоэректусы, мотивированные чужими историями успеха.\n\n«Киты» — те же «инвесторы», только обладающие большими возможностями. Большинство «китов» являются различными формами коллективного управления чужими средствами. Термин позаимствован из английского интернета, в котором словом whales обозначают пользователей, ведущих самые большие криптосделки.\n\n«Акулы» — кукловоды, которые получают ожидаемую выгоду по сложным схемам, и чаще всего дело не в само́й торговле.\n\n«Криптодиваны» — фанатики криптосвободы, для которых ценность процесса на порядки превышает заинтересованность в материальной выгоде.\n\r\nТак получается, что население небогатых стран интересуется NFT не от хорошей жизни. Логическая цепочка начинается с того, что срабатывают только NFT-проекты с большой аудиторией. Непонятно, является ли это умыслом или побочным эффектом, но возможность получить мизерный процентик от больших криптопотоков привлекли в мир NFT огромные массы владельцев дешёвых андроидов. Они буквально содержат себя и свою семью на средства, полученные от игры на смартфоне. Звучит слишком странно, чтобы быть правдой. Действительно, не всё так прямолинейно и просто, поэтому давайте разберём, что же это за игры такие.\n\n▍ Криптоигры\r\nЗначительную часть экономики NFT составляют игры (сhain games, nft games), они привлекают возможностью постоянного заработка как будто без заметных вложений. Флагманом этого сегмента является игра Axie Infinity. Появившись в 2018 году, она быстро превратилась в самую популярную за счёт переизобретения старых механик на базе блокчейна. Игроки собирают виртуальных героев, которые называются Акси. Каждый Акси уникален и (сюрприз!) привязан к своему NFT, сама игра заключается в дуэлях монстриков, победитель получает немного внутреннего криптобабла, которое используется для расширения зоопарка и покупки криптоземли. Игра притягивает толпы игроков только экономической составляющей, играть там не во что. Все монстрики разделяются по «уникальности», а значит, по силе спроса на них. Зафиксирована покупка Аксика за 368_000 $, так что какие шутки. Криптобабло называется Smooth Love Potion (SLP), его тоже можно продавать и покупать на биржах.\n\r\nКонечно, ничего принципиально нового не произошло. Игровые предметы с персонажами давно продаются в реальном мире с помощью разных схем, разница только в том, что раньше это были закрытые локальные рынки, на которых действовали только фанаты конкретной игры. Добавление блокчейна всего лишь упростило доступ к этому рынку перекупщиков, которые могут единообразным образом зарабатывать на ликвидных активах из разных игр, надувая ценность NFT-рынка.\n\n\n\r\nСуществует две причины, почему криптовалюта игры обладает ценностью: коллективные ожидания и способ применения. Люди сами придают ценность токенам игры, надеясь, что токены станут ценными. Как с любой другой криптовалютой или обычным финансовым рынком, позитивная вера в токены становится стоимостью токенов. Второй причиной является наличие полезного применения, токены необходимы для процедуры выращивания новых персонажей. Наличие такого постоянно растущего спроса сглаживает спекулятивные просадки цены токена.\n\r\nСочетание комплекса факторов приводят в такие проекты множество игроков из бедных слоёв населения по всему миру. Анализ, проведённый компанией Navik, показал, что по состоянию на август 2021 года опытные игроки зарабатывали выше среднего уровня для Филиппин (41,49 $/день), а большинство игроков зарабатывало чуть больше минимума (7,03 $/день). Такое стало возможно благодаря наличию официального способа сдачи в аренду ценных питомцев, что позволяет людям без значительных вложений участвовать в битвах с другими сильными персонажами и, соответственно, получать заметные выигрыши, из которых владельцу питомцев выплачивается вознаграждение. Самостоятельное вхождение в игру возможно при наличии трёх персонажей, которых надо купить, что может обойтись в сумму, превышающую 1000$, поэтому вариант с арендой является выходом для игроков без бюджета.\n\r\nПоработившая игровой мир концепция free-to-play, начинает агрессивно отодвигаться концепцией play-to-earn. Этот термин обозначает категорию игр, в которых блокчейн используется для поощрения игроков цифровыми объектами, имеющими ценность внутри криптовселенной, в случае успеха игры эта ценность начинает выражаться в реальных деньгах. На сегодняшний день существуют десятки игр с огромной аудиторией: Gods Unchained, Alien Worlds, Splinterlands и Uplands. В самом Axie Infinity количество активных игроков превышает два миллиона. Пока в одних странах геймеры задаются вопросом «Запустить модный Axie или бесполезный Fortnite?», в других странах вопрос звучит иначе: «Заработать деньги в Axie или на заводе?».\n\r\nSky Mavis (разработчик Axie Infinity) недавно запустили автоматическую биржу Katana, где монеты Axie Infinity можно обменять на криптовалюту Эфир, что соединило напрямую игру и бурно растущий рынок DeFi, а сама Katana быстро попала в число самых востребованных сервисов. Axie Infinity притягивает воспроизведением экономической модели реального мира и размытой границей между миром воображаемых и настоящих денег. В игре есть валюта, активы и рынок рабочей силы, которые тесно переплетены. Игроки, у которых нет времени, но есть деньги, передают в аренду свои цифровые активы игрокам, у которых полно времени, но нет денег.\n\r\nКонцепция play-to-earn является воплощением другой концепции «инвестирование для развлечения», то есть вложение денег ради получения удовольствия от азарта и удовлетворения любопытства. Игроки становятся винтиками живой модели капитализма, пусть и в сильно урезанном формате: наёмный труд, инвестирование, потери и приобретения, которые имеют выражение в реальных деньгах. Людям нравится прямая зависимость между усилиями, смекалкой и результатом, то что остаётся лозунгом капитализма, но эволюционно давно исчезло. Подобные игры выводят тиражируемую в некоторых кругах фразу «каждый должен быть инвестором» на новый уровень. Буквально каждый! Ребёнок, заключённый, военнослужащий, вне зависимости от местоположения и дохода, каждый может хотя бы почувствовать себя инвестором, а может даже заработать. Геймификация инвестирования в самом органичном воплощении. Больше нет нужды работать в офисе, больше нет нужды выживать на доллар в день, NFT игры — это комфортное воплощение надежды на хорошую жизнь в условиях общемировой тряски. Если у вас что-то зачесалось, то следует чётко понимать, что это не раздача халявы, без вложения средств вам придётся долго искать незанятое приглашение на наёмничество, но гораздо хуже, что доходы напрямую связаны с притоками новых игроков и уже длительное время они падают (см. SLP Price Chart).\n\r\nПримитивная экономика Axie Infinity имеет примитивные проблемы, персонажи бессмертны, их количество растёт, то есть они дешевеют. Какое влияние в долговременной перспективе окажут такие игры на слабые экономики — тоже вопрос. Это может привести к инфляции, а может произойти рост доходов в аналоговом секторе, в качестве компенсации ухода в криптомир рабочих рук. Не следует забывать, что сама игра не децентрализована, ничто не мешает разработчикам продать свою долю игровой криптовалюты и выключить сервера, NFT-монстры останутся у пользователей, но их цена рухнет.\n\r\nСама игровая составляющая больше похожа на декорацию, её можно легко убрать, что обнажит такую схему: пользователи обменивают криптовалюту на фантики, обладание фантиками приносит ежедневный доход тугриками (при условии захода в игру), тугрики и фантики можно обменять на криптовалюту, игровая активность на доход влияет незначительно, так как верхняя планка сильно ограничена, величина дохода зависит от ценности имеющихся фантиков и количества новых покупок фантиков всеми пользователями. Если добавить необходимость платить за вход в игру, то наблюдаются все признаки пирамиды, но действительная судьба проекта зависит от того, смогут ли организаторы ловко подстраивать экономику, чтобы не распугать игроков, смогут ли подогревать интерес.\n\n▍ Какую инвестиционную ценность имеет NFT?\r\nЕсли желание собирать крошки, падающие с большого пирога, не вызывает недоумения, то к покупке NFT c картинками есть много вопросов. Никаких особых прав NFT не создаёт, но почему его покупают? Множество людей совершает сделки, они платят настоящие (иногда космические) деньги, откуда появляется стоимость у NFT?\n\r\nРазвитие технологий в очередной раз заставляют нас пересматривать устоявшиеся парадигмы. Но является ли NFT новой технологией? Тесные границы искусства в начале XX века были взорваны водородной бомбой под названием „Чёрный квадрат“, это постулирование идеи разрыва между реальным миром и миром, который можно создать воображением. «Чёрный квадрат» был манифестом, кричащим, что описание реального мира — это лишь симпатичная конструкция посреди бесконечного поля комбинирования элементов информации, символ не обязан иметь форму своего значения, ссылка равноценна содержанию.\n\r\nПохожие на NFT явления существуют давно. Игровые предметы продаются за огромные деньги с 90-х, а донаты? Уже есть целое поколение, которое не считает странным добровольно бросать деньги в пустоту и испытывать от этого приятные ощущения. Большинство случайных покупок NFT — это в чистом виде пожертвования.\n\r\nВ интернете процветает эпоха «инфлюенсеров», привлечь внимание = привлечь деньги. Если к торговле несуществующими предметами добавить блокчейн, то получается новый рок-н-ролл. NFT отлично укладывается в современную культуру, точнее, не сам NFT, а то чем он стал вместе со своей медиаобёрткой. Именно вся эта праздничная мишура и конфетти, абсурдность и бессмысленность, сопровождающаяся лавинообразным ростом внимания, это всё созвучно с культурой хайпа. В медиапространстве покупка дорогущего автомобиля и NFT выглядит одинаково, причём доказать наличие NFT проще, тем более инстаграм создаёт ощущение, что ролс-ройс сейчас есть у каждого дурачка. NFT не может столько стоить? Фабричная майка тоже не могла стоить 3000 $, пока не нашёлся первый покупатель. Роскошь напоказ потеряла связь с золотом вслед за долларом. Дорогая вещь может отличаться от дешёвой только биркой, в случае NFT даже вещь уже не нужна. За миллион долларов можно купить IZVESTNOST, которую при удачном стечении обстоятельств получится натурально перепродать.\n\r\nПодобный вид социального поведения не является чем-то новым, сжечь миллион ради видеоролика уже банально и не экологично, хотя NFT добавляет в медиабезумие элемент правдивости, имитаторы не смогут извлечь пользы из новой реальности, в которой все действия проверяемы и находятся на виду у всех.\n\r\nС помощью NFT можно построить учёт чего угодно множеством разных способов, но именно аналогия владения оказалась гениальной находкой для популяризации малопонятной технологии. Явление существования высокой субъективной ценности знакомо каждому. В самом начале жизни люди отчуждены от владения чем-либо и поэтому статусом собственности наделяются палки, стёкла, любые безделушки, которые чем-то выделяются. Но представьте, что будет, если встретятся несколько владельцев похожей квазисобственности? Они будут обмениваться.\n\r\nКогда подобным занимаются взрослые, это называется коллекционированием. У взрослых есть настоящие деньги, если они готовы платить за что-то, неизбежно появится рынок и ценообразование. Именно поэтому второй идеей, которая всплывает в контексте NFT — является коллекционирование. Коллекционированием пытаются оправдать покупку бесполезных виртуальных жетонов без содержания, хотя с тем же успехом можно собирать случайные числа.\n\nВ следующей части наконец-то спустимся на грешную землю и перейдём к вопросам, которые касаются непосредственного участия в этом странном шоу.\n\n   "
    },
    "Почему NFT умер, а крипта — нет": {
        "href": "https://habr.com/ru/post/682510/",
        "content": " После того, как пузырь NFT сдулся и с треском лопнул, пора поговорить о том, что это было. Тем более, что попытки «раскопать стюардессу» во многих местах не прекращаются. Но, в отличие от Биткоина и криптопроектов вообще, однажды сдувшись, NFT уже вряд ли вернётся. И это к лучшему.Самым ярким примером, на котором можно объяснить «что это было», является NFT Джека Дорси, основателя «Твиттера», который выпустил NFT в честь первого твита в истории, которым был его твит 2006 года. Он заскриншотил свой твит в декабре 2020, и вскоре его выкупили у него за $2,9 миллионов. Медиа тут же преподнесли это как «Джек Дорси продал свой первый твит!» Ах, если бы это было так. И покупатель, вероятно, рассчитывал, что сможет перепродать «первый твит в истории» намного дороже — но, в итоге, в следующий раз этот NFT попал в новости после эпичного обвала (скажем прямо — лопнувшего пузыря) NFT в апреле 2020, когда обнаружилось, что никто не хочет предлагать за него более $280 — одну десятитысячную, процент от процента — исходной цены. Вся история NFT в одном заголовкеТекущий оффер за этот твит на OpenSea — около $700. Вряд ли кто-то в своём уме захочет платить за этот NFT даже 10% от его исходной цены, за исключением одного вероятного сценария, о котором я напишу позже. Но пока разберём, что вообще такое NFT и что на этом примере непосвященному (или обманутому) человеку можно о них понять. На самом деле — практически всё необходимое.Что продаётся?Продажа NFT первого твита Джека Дорси не означает и не могла означать продажу первого твита Джека Дорси. Твит остаётся в его Твиттере, чтобы что-то с ним сделать — нужно иметь доступ к аккаунту Дорси или же бэкенду Твиттера. Даже с доступом к аккаунту сделать с ним ничего, в общем-то, не получится, кроме как удалить — другого функционала в отношении управления старыми твитами Twitter не предлагает. С доступом к бэкенду «Твиттера» с ним можно было бы сделать больше — добавить плашку и даже отредактировать его, но стоимость такого доступа гораздо выше $2,9М: она составляет, как узнал недавно весь мир, $44 миллиарда — и такая покупка оказалась не по карману даже богатейшему человеку мира, Илону Маску. Допустим, если бы даже Твиттер пошёл навстречу NFT-энтузиастам, и дал возможность передавать доступ к отдельным твитам,  это означало бы только доступ к их удалению, поскольку ничего другого со старым твитом сделать нельзя. Это, честно говоря, сомнительная ценность для покупки цифрового товара — возможность удалить его из интернета навсегда. Но и такой возможности функционал «Твиттера», повторюсь, не предполагает: с проданным за почти три миллиона долларов NFT со скриншотом первого твита он сам остался в полном распоряжении Джека Дорси, и дальнейшая судьба NFT никак на это не повлияет. Строго говоря, Джек имеет все возможности и полное право удалить свой первый твит в любой момент — и, если бы он это сделал, это было бы замечательным троллингом идеи NFT, потому что показало бы ещё более наглядно оторванность представлений о том, что такое NFT от того, чем они на самом деле являются.Скажем, если бы Дорси удалил свой твит, то его NFT никуда бы не делся — запись о сделанном им когда-то скрине этого твита так и осталась бы на платформе Ethereum в виде отдельного взятого non-fungible token (NFT) — исчезла бы всякая, даже воображаемая, связь этого токена с самим твитом. Стало бы очевидно, что продаётся ничего больше, чем скрин этого твита. «Но ведь скрин этого твита может сделать кто угодно! В чём же ценность конкретно взятого скрина?» — спросит внимательный читатель.Ответ: в том, что его сделал Джек Дорси. И всё. Никакой связи с самим твитом, ни цифровой, ни юридической, у этого токена нет, а о том, что его сделал лично Дорси (и то не факт, он, может, поручил это кому-то) мы знаем из медиа. Когда это объяснено именно так, то становится ясно, что NFT-бум из себя представлял спекулятивный пузырь самой чистой породы изо всех, случавшихся в истории, начиная с тюльпановой лихорадки в XVII веке. Та, по крайней мере, имела в своей основе тюльпаны — настоящие цветы, пусть, в какой-то момент, и безумно переоценённые рыночными силами. Для того, чтобы понять, до какой степени NFT являются пустышками, надо взглянуть на это философски: с точки зрения теории прав. Точнее, права собственности, которое и передаётся при продаже. Классификации прав собственности возможны разные, в зависимости от контекста, в котором они рассматриваются. В данном контексте их можно рассматривать в двух измерениях: Права договорные (когда есть некоторое обещание, которое защищается третьей стороной — законом, репутацией, или просто возможностью «устроить разборки»). Самое очевидное — это прописанные в законе и законом же защищаемые права, за нарушение которых (например, продал дом, но отказываешься в него впускать нового собственника) можно, в конечном итоге, оказаться в тюрьме. Или права основанные на обещании, нарушение которых может повлечь как ущерб репутации, так и прямой физический ущерб, если к нарушителю прав придут «разбираться». В любом случае, это предполагает вмешательство некой стороны для исполнения обещания, сделанного при продаже, в какой бы форме оно ни было сделано (и в зависимости от формы этого обещания).Права физические — иными словами, право, основанное на принципе «потому что могу». Когда при продаже объекта покупатель получает к нему исключительный физический доступ, позволяющий делать ему с ним что угодно вне зависимости от пожеланий и воли продавца. Например, когда вы покупаете ботинки, вы можете их носить, можете их подарить, а можете связать шнурки и закинуть их на провода — с момента, когда они у вас в руках, продавец ваши действия с ними уже не контролирует. В цифровом мире это тоже работает: «что скачали — то пропало». Если какой-то файл, который не должен был попадать в открытый доступ, в него утекает — сделать тем, что уже успели скачать, ничего не получится — те, у кого окажется этот сохранённый файл, могут не иметь на него ни моральных, ни договорных, ни законных прав — и всё же смогут им распоряжаться как могут потому что могут. При покупке чего-либо где-либо надо всегда учитывать эти два вида прав в виду, и понимать, что вы приобретаете. Если первое  — право, основанное на договоре, каком-то обещании — то что именно обещается, с какими ограничениями, и, главное, как это обещание будет энфорситься в случае нарушения. Судом, жалобой в социальных сетях, или просто возможностью придти кому-то набить морду.Если второе — фактическое право распоряжения объектом, то в чём оно заключается (как именно можете распорядиться получаемым объектом), и какие ограничения предполагает (скажем, скачанный фильм в стандартном формате можно скопировать и отредактировать, а вот купленные ботинки переделать или размножить просто так не получится).Совокупность этих двух измерений позволяет составить карту прав собственности в отношении любого предмета покупки или другой формы приобретения. Например, скачанная пиратским образом песня находится в полном распоряжении скачавшего даже если у них нет на неё юридических прав до тех пор, пока у них есть доступ к физическому носителю, на который она сохранена. И так же у него есть право (возможность) передачи её другому лицу. А песня, купленная в Apple Music, доступна ему в ограниченном формате — пока он не сменит регион, к которому привязан платёжный аккаунт в iTunes, и без права передачи (в подарок, по наследству, за деньги). Но зато Apple обещает восстановить к ней доступ с любого устройства — и право это защищено, в первую очередь, юридическими обязательствами компании и отчасти — репутационными соображениями. Поэтому на нашей воображаемой карте прав по оси X, физические права, песня в Apple Music будет расположена относительно низко — например, 0,2 по шкале от нуля до единицы, а по оси Y (обещанные права) — где-то посередине, 0,5. Итого: 0,2; 0,5. Весьма ограниченные права.Теперь приложим эту шкалу к NFT в чистом виде, на примере NFT первого твита Джека Дорси и получим: 0; 0.Ось X (физические права): 0. Никакой материальной (физической, цифровой) связи с оригинальным твитом при покупке его NFT не передаётся. NFT был продан и может быть перепродан бесконечное количество раз, твит всё равно остаётся в аккаунте Дорси, действия с ним может совершить только Дорси (или тот, кто имеет доступ к его аккаунту) или сам Twitter как сервис. Ось Y (обещанные права): 0. Никаких обязательств, связанных с продажей NFT со скрином своего первого твита (например, не удалять его) Дорси не давал. И, что важно для данного обсуждения — и не мог дать! Всё, что позволяет NFT как технология, ограничено возможностями блокчейна, на котором токен выпущен. И в эти возможности не входит заключение контрактов, имеющих силу за пределами этого блокчейна. Скажем, чтобы получить какие-то формальные права на этот твит — покупателю пришлось бы заключить обычный договор в какой-либо юрисдикции. Что, правда, сразу исключает из игры NFT как таковой: если уже заключён договор купли-продажи, то зачем нужен NFT? Можно, конечно, заключать договор купли-продажи NFT, но это возвращает нас к проблеме №1: не существует никакой материальной связи между NFT и объектом, который он символизирует. Поэтому в случае NFT даже при всём желании заключить договор купли-продажи не получится: ведь тогда встанет вопрос о формулировке предмета продажи. И это разоблачит всю идею, как честный мальчик — голого короля: твит продать невозможно. Можно продать действие (удаление) с этим твитом. Но это не имеет никакого отношения к NFT, Этереуму, блокчейну и всей криптосфере как таковой. Либо NFT, в котором записан скриншот этого твита — но это не имеет никакого отношения к самому твиту. И вот на этом умолчании, раздутом до размеров гигантского обмана, и держится весь пузырь NFT: он надувается, пока людям продаются какие-то невнятные ассоциации — с первым твитом, Джеком Дорси, миллионерами, миллиардерами и селебрити, или даже простыми художниками и создателями анимации, втянутыми в промо NFT — и неизбежно сдувается, как только начинаешь разбираться, что именно там продаётся: пустота. Точнее, запись на блокчейне, которая хоть и является «уникальной», ценности из себя никакой не представляет. Любой может создать NFT с другим скрином первого твита Джека Дорси, или любой картинкой из галереи «NFT-искусства» даже на том же «Этереуме», не говоря уж о множестве других блокчейнов, предлагающих функционал NFT — например, теперь уже печально известную «Солану». Собственно, этим мошенники на подъёме NFT-бума массово и занимались: воровали чужой контент, делали на его основе NFT и продавали как «цифровое искусство». Никаких прав на это искусство покупателям это не давало, авторы его, зачастую, даже не были в курсе, что их арт где-то продаётся, а покупали его или обманутые хайпом пиара, в который были втянуты практически все медиа и медиа-персоны крупнейшего калибра, люди, полагавшие, что покупают что-то большее, чем цифровую запись о скопированной или заскриненной картинке, либо жулики (простите — инвесторы), прекрасно понимавшие, что приобретают, но надеявшиеся на хайпе успеть перепродать NFT дороже, чем успели купить.Неудивительно, что этот пузырь лопнул так же быстро, как успел надуться. Если что-то его и продержало достаточно долго, чтобы он успел надуться до своих размеров — и держит до сих пор, поскольку тема NFT где-то барахатается на периферии публичного дискурса, зализывая раны и надеясь на своё возвращение (кто-то же предлагает за твит Дорси $700 даже сегодня) — то только намеренная усложнённость понимания, что такое NFT. Усложнённая в квадрате: уже существовавшая сложность для понимания массовым интернет-пользователям темы криптовалют умноженная на сложность новой темы в теме крипты.Сложность абсолютно дутая, потому что в корне NFT предельно просты: NFT — это цифровая запись, указывающая на файл в интернете. Чаще всего, картинку, но может быть любой цифровой объект. Это даже не сам файл (блокчейн не является хранилищем файлов, только записей). Иными словами, линк. Таким образом, в NFT может быть превращена любая ссылка в интернете — например, на эту статью. Но при покупке её пользователь получит не больше, чем при покупке URL этой статьи, какую бы сумму они на это не потратили — они не станут её автором, не смогут её просто так изменить, не смогут ограничить к ней доступ или пользоваться той же самой ссылкой другим — это даже не даст автоматического упоминания в статье или где-то рядом, что кто-то продал или купил на неё ссылку. В общем, когда это подано именно так — становится очевидной полная абсурдность представления NFT как рыночного товара. Именно поэтому, рассчитывая на NFT заработать, это нельзя подавать прямо. Нужно — что и было сделано, и до сих продолжается делаться — массово, организованно, коллективно и самозабвенно врать (извините, вводить в заблуждение) о том, что такое NFT и что оно означает, создавая у людей впечатление, что вместе со ссылкой на цифровой объект идут какие-то уникальные права, формальные или фактические, на этот объект. Хотя бы толика, а не ноль по обоим осям координат — абсолютный ноль с точки зрения любых прав.С точки зрения продавца — идеальный продукт для продажи. Чистый воздух в банке — усилий для создания NFT прилагается столько же, сколько нужно для того, чтобы закрыть пустую банку с воздухом крышкой и налепить на неё привлекательную этикетку, будь то скриншот первого твита, морда скучающей обезьяны или распечатанная обложка альбома «Нирваны».  Главное усилие, которое здесь требуется — это убедить кого-то эту банку с воздухом купить.С точки зрения покупателя — он купил банку с воздухом. Момент, когда кривая представлений о ценности банки с воздухом сравняется с реальной полезностью банки с воздухом — только вопрос времени, и это уже произошло в апреле, когда NFT-пузырь лопнул.Пойдёт ли спрос (и цены) на NFT вверх снова? Вполне возможно, спустя какое-то время, если публике не объяснить достаточно чётко, что NFT — это банки с воздухом. Намеренная сложность темы NFT не исключает того, что пузырь снова, через какое-то время, начнёт раздуваться, в этот раз под соусом: «Биткоин тоже падал — а потом ничего, вырос». Это единственный разумный сценарий, который я обещал выше, при котором кто-то может попытаться перекупить ссылку на скриншот первого твита в «Твиттере» за сколько-нибудь значительную сумму: когда кто-то начнёт вновь накачивать тему NFT деньгами, чтобы раздуть пузырь рынка банок с воздухом и навариться на нём ещё разок.В этом контексте очень важно понимать, что NFT — это даже не криптовалюта, и те же правила, что действуют на криптовалюты, на них не распространяется. Является ли NFT приговором криптовалютам?Нет. Хотя NFТ отражают, до какой степени абсурда может заходить блокчейн-тематика, отрываясь от реальности и затягиваясь в пучину финансовых интересов, это, всё-таки, пример именно что доведения идеи блокчейна до абсурда.  В отличие от NFT, вся «ценность» которых в их уникальности (что само по себе не ценнее абсолютно любого URL или ip-адреса в интернете, которые по определению уникальны), криптовалюты имеют ценность как средства обмена (денег), а криптотокены — ту ценность, которая связана с сервисами, на которых они используются.Поэтому, инвестировать в Биткоин имеет смысл в 2022 так же, как в 2021, и даже больше, потому что Биткоин сейчас упал — то есть, его можно купить дешевле — но он никуда не денется. Как трансграничное неофициальное средство платежей Биткоин не исчезнет никуда и никогда, только если его не запретят законом во всех странах мира разом, чего пока не наблюдается даже на самом отдалённом горизонте. А значит, потребность в нём, особенно в мире, в котором возникает всё больше заборов и преград в виде санкций и блокировок всякого рода, неизбежно будет сохраняться и в дальнейшем. А пока будет потребность — будет и ценность.Нет сомнения в том, что, когда начнёт в очередной раз расти Биткоин — полезут вверх и NFT, но ничем, кроме банок воздуха NFT от этого быть не перестанут — а реальная потребность в Биткоине для транзакций реальна и будет оставаться такой ещё очень долго. То же самое касается и токенов, особенно представляющих платформы, предлагающие реальную полезность в мире растущей цифровой цензуры. Если Биткоин позволяет игнорировать границы, запреты и санкции для монетарных транзакций, то сервисы web 3.0 расширяют их возможности, позволяя людям организовываться, общаться, совместно работать, сотрудничать, совершать оплаты и зарабатывать в независимой децентрализованной среде. Сейчас новое поколение сервисов будущего, платформ, которые составят web 3.0, только нарождается. Их можно назвать несколько: Utopia, Y messenger, Keybase и TOR. Цель всех этих сервисов – защита и безопасность контактов пользователей между собой.Самая многофункциональная система среди них — Utopia. Y messenger – это мессенджер, который создаётся, чтобы быть защищённым, но при этом удобным как Telegram или WhatsApp.Блокчейн-стартап Keybase создавал криптографически защищённое хранилище файлов. А в 2020 году его купил Zoom, и специалисты Keybase занялись повышением безопасности сервиса.Ну а всем известный Tor представляет собой только браузер, предлагающий шифровку и анонимизацию траффика. «Утопия» же — это площадка для полноценного взаимодействия людей между собой, включая общение, и платежи. Таким образом, в «Утопии» люди могут не только общаться, но и сотрудничать, создавать разные проекты, коллаборировать, строить бизнесы в настолько защищённом и безопасном режиме, насколько им необходимо.С помощью Utopia пользователи могут обмениваться мгновенными текстовыми и голосовыми сообщениями, передавать файлы, создавать групповые чаты, каналы и новостные ленты, а также организовывать приватные обсуждения. К каналу можно привязать геометку с помощью uMaps, что облегчает доступ по каналам Utopia и обеспечивает дополнительный уровень безопасности. Это позволяет не пользоваться публичными картографическими сервисами, которые, как известно, собирают данные для пополнения массивов Big Data.uMail – это децентрализованная альтернатива классической электронной почте. В передаче и хранении писем не участвуют серверы. Аккаунт uMail, который можно создать за минуту, предоставляет возможность пользоваться неограниченным количеством сообщений и местом для хранения вложенных файлов. Применяемое экосистемой Utopia шифрование гарантирует безопасность передачи и хранения почты. Аккаунт uMail, являющийся неотъемлемой частью Utopia, не может быть заблокирован или захвачен.Все финансовые инструменты доступны во встроенном в Utopia кошельке uWallet: отправляйте и принимайте мгновенные платежи в криптовалюте Crypton, которая используется в Utopia, добывайте валюту, принимайте платежи на вашем сайте, оплачивайте Crypto карты, не раскрывая вашу личность, или выставляйте счета за ваши услуги другим пользователям Utopia. Среди других функций необходимо упомянуть API и консольный клиент для удобства и простоты интеграции.Сеть Utopia включает безопасную альтернативу традиционной системе доменных имен (DNS) – систему имен Utopia (uNS). Это децентрализованный реестр имен, которые невозможно захватить, заморозить или повредить. После регистрации они останутся вашими навсегда. uNS совместно с функцией пересылки пакетов позволяют организовать туннеллирование любых данных между пользователями экосистемы и хранить разные типы ресурсов, включая веб-сайты, в сети Utopia.Доступно множество других потрясающих функций, которые вам понравятся, например, шифрование голосовых звонков, тонны стикеров и смайликов, многопользовательские игры, инструменты для совместной работы и организации. Это полноценный прообраз Веб 3.0. Как и Биткоин, который позволяет игнорировать границы, запреты и санкции, сервисы web 3.0 создают реальную полезность в мире растущих цифровых ограничений, блокировок и санкций. В отличие от NFT, которые в себе воплотили всё, за что люди не любят и критикуют криптотематику, Биткоин и web 3.0 — это светлая сторона блокчейна, за которой будущее.    "
    },
    "Ответы на часто задаваемые вопросы о NFT": {
        "href": "https://habr.com/ru/company/timeweb/blog/545620/",
        "content": " У вас тоже накопилось много вопросов к этому новому виду… искусства? Платформе?\n\r\nНовости о блокчейне всегда заставляют нас задуматься: «Эм… А что здесь происходит?». Именно такое чувство я испытал, читая, как Граймс получает миллионы долларов за цифровые рисунки и видео в виде NFT-токенов или как анимацию Nyan Cat продали на блокчейн-аукционе за 43 млн рублей.\n\n\n\nНачнем с основ. Что такое NFT? Как расшифровывается эта аббревиатура?\n\r\nNFT (Non-fungible token) — не-взаимозаменяемые токены.\n\nСпасибо, но понятнее не стало. \n\r\n«Не-взаимозаменяемый» более или менее понятно. Это означает, что токен уникален и не может быть заменен чем-то другим. Например, биткойн взаимозаменяем: обменяйте один биткойн на другой, и вы получите то же самое. Однако уникальная коллекционная карточка не является взаимозаменяемой. Если бы вы обменяли одну карточку на другую, у вас была бы совершенно другая коллекция. Вы отдали карточку с покемоном «Squirtle» и получили бейсбольную карточку «Honus Wagner T206» 1909 года, которую на сайте StadiumTalk называют «Мона Лиза бейсбольных карточек». Поверим на слово!\n\nКак это работает?\n\r\nБольшинство NFT-токенов являются частью блокчейна Ethereum. Ethereum — это криптовалюта, такая же как биткойн или dogecoin, но ее блокчейн поддерживает и NFT-токены. Они хранят дополнительную информацию, которая заставляет эти токены работать иначе, по сравнению с криптовалютой ETH. Стоит отметить, что другие блокчейны могут реализовывать свои собственные версии NFT. Кстати, некоторые уже это сделали.\n\nЧто стоит купить в NFT-супермаркете?\n\r\nNFT-токены — это что угодно, но обязательно цифровое. Например, рисунки, музыка, ваш мозг, скачанный и превращенный в искусственный интеллект. Но настоящий ажиотаж был связан с использованием этой технологии для продажи именно цифрового искусства.\n\n\nDogecoin — это не NFT. Но эта гифка с Dogecoin — уже NFT\n\nТо есть люди могут купить мои крутые твиты?\n\r\nНе думаю, что кто-то сможет препятствовать их продаже, но я не совсем это имел в виду. Многие говорят о NFT как об эволюции коллекционирования изобразительного искусства — коллекционирование цифрового искусства.\n\nНеужели люди думают, что это действительно превратится в коллекционирование произведений искусства?\n\r\nЯ уверен, что некоторые люди на это надеются. Например, тот, кто заплатил почти 390 000 долларов за 50-секундное видео Граймс, или человек, заплативший 6,6 миллиона долларов за видео художника Beeple. Это правда крутой художник, одно из его произведений выставлено на аукционе «Кристис» (Christie’s).\n\n\nYoink! \r\nИзображение: Beeple\n\nВы скажете, что можно щелкнуть по видео Beeple правой кнопкой мыши и загрузить себе файл, за который какой-то человек заплатил миллионы долларов.\n\r\nКак грубо! Но да, именно в этот момент становится немного… странно. Вы можете скопировать цифровой файл сколько угодно раз, включая те самые произведения, которые продаются как NFT.\n\r\nНо NFT предназначены для того, чтобы дать вам то, что нельзя скопировать: право собственности на произведение (хотя художник по-прежнему может сохранять авторские права и права на воспроизведение, как и в случае с реальными произведениями искусства). Если говорить в терминах коллекционирования изобразительного искусства: любой желающий может купить копию картины Моне. Но только один человек будет владеть оригиналом.\n\nНе хочется обидеть художника Beeple, но его видео все-таки не Моне.\n\r\nА что вы скажете про Gucci Ghost за 3,600 долларов?\n\n\nПоследний был продан за 3,600 долларов, но нынешний владелец просит за него уже 16,300 долларов\n\nКроме того, если бы у меня был Моне, я бы обладал им как физическим объектом, мог потрогать. В цифровом искусстве копия ничем не уступает оригиналу.\n\r\nА как же само право обладать оригинальным Beeple?..\n\nИ в чем смысл, спросите вы.\n\r\nЭто зависит от того, кем вы являетесь: художником или покупателем.\n\nНапример, я художник.\n\r\nВо-первых, это круто! Возможно, вас заинтересует NFT, потому что это дает возможность продавать работы, для которых до настоящего момента не существовало рынка и спроса. Если вам в голову пришла действительно крутая идея для digital-стикера, что вы собираетесь делать? Продать его в iMessage App Store? Не делайте этого!\n\r\nОбратите также внимание на особую функцию NFT, которую вы можете подключить: тогда вам выплачивается процент каждый раз, когда ваша работа будет продана или перейдет из рук в руки. Это гарантия, что вы получите часть прибыли, если произведение станет суперпопулярным и вырастет в цене.\n\nЯ покупатель.\n\r\nОдним из очевидных преимуществ покупки произведений искусства является то, что это позволяет финансово поддерживать художников, которые вам нравятся. Покупка NFT также дает некоторые права на использование работы, такие как возможность опубликовать изображение в Интернете или установить его в качестве фотографии вашего профиля. Плюс, конечно, шанс похвастаться тем, что вы владеете произведением искусства с записью в блокчейне.\n\nНет, я имел в виду, что я коллекционер.\n\r\nОтлично! NFT могут работать как любой другой спекулятивный актив, когда вы покупаете что-то и надеетесь, что стоимость однажды вырастет, чтобы вы могли продать это с прибылью. Хотя я чувствую себя нечестным, говоря об этом.\n\nИтак, каждый NFT уникален?\n\r\nВ скучном, техническом смысле каждый NFT — это уникальный токен в блокчейне. Приобретение NFT может быть похоже на покупку Ван Гога, когда есть только одна окончательная и реальная версия картины. Но, на самом деле, NFT может представлять собой и коллекционную карточку, когда есть 50 или 100 пронумерованных копий одного и того же произведения искусства.\n\nКто будет платить сотни тысяч долларов за то, что по сути является коллекционной карточкой?\n\r\nЭто как раз то, что делает всю историю с NFT такой непонятной!\n\r\nНекоторые люди относятся к NFT как к коллекционированию будущего. Читать: как к игровой площадке для мегабогатых. Другие считают NFT карточками с покемонами. То есть они доступны для обычных людей, но также являются и игрушкой для мегабогатых. \n\nНе продолжайте! Мне не нравится всё это.\n\n\nВы активировали мою карту-ловушку. Ее продали за 17,000 долларов. \r\nИзображение: Логан Пол\n\r\nЛоган Пол, американский видеоблогер, например, продавал клипы, которые представляют собой просто отрывки из его видеоблогов, за 20,000 долларов. Вы можете посмотреть их на YouTube в любое время. В виде NFT он также продал карточки с покемоном по имени Логан Пол.\n\nКто заплатил 20,000 долларов за видео с Логаном Полом?\n\r\nВидимо, тот, кто может себе это позволить, верно?\n\nБыло бы забавно, если Логан Пол решит продать еще 50 копий того же самого видео.\n\r\nМайк Шинода из Linkin Park (который также продал несколько песен в виде NFT) тоже говорил об этом. По его словам, это мог бы сделать только «беспринципный нечестный придурок». В общем, нужно быть осторожным и смотреть, у кого вы покупаете NFT.\n\nМогу ли я купить эту статью как NFT?\n\r\nНет, но технически всё цифровое можно продать как NFT. deadmau5 продает цифровые анимированные стикеры. Уильям Шетнер продавал коллекционные карточки на тему Шетнера (одной из которых, по-видимому, был рентгеновский снимок его зубов).\n\n\nЭто мне нравится!\r\nИзображение: deadmau5 и Mad Dog Jones\n\nФу, гадость! Я правда могу купить чьи-то зубы как NFT?\n\r\nБыли попытки привязать NFT к реальным объектам в качестве своеобразного метода проверки. Компания Nike запатентовала метод проверки подлинности кроссовок с помощью системы NFT, которую назвали CryptoKicks. Но зубов я пока не нашел. И не хотел бы на это смотреть!\n\nСмотреть? Где?\n\r\nПоявилось несколько торговых площадок, которые позволяют людям покупать и продавать NFT. Среди них: OpenSea, Rarible и Nifty Gateway (выбор Граймс), но есть и множество других.\n\nЯ слышал, что-то о котятах. Расскажите мне про котят.\n\r\nNFT-токены стали технически возможными, когда блокчейн Ethereum добавил их поддержку как часть нового стандарта. Конечно, одним из первых использований таких токенов стала игра CryptoKitties, которая предлагала пользователям торговать и продавать виртуальных котят. Спасибо, Интернет!\n\nЛюблю котят!\n\r\nНе так сильно, как человек, заплативший за одного котенка более 170,000 долларов.\n\n\nМое лицо, когда я стою 170 тысяч долларов. \r\nИзображение: Cryptokitties.co\n\nО боже, что происходит!\n\r\nУ меня такие же эмоции. Но, на мой взгляд, котята демонстрируют один из самых интересных аспектов NFT (для тех из нас, кто не хочет создавать коллекцию цифрового искусства) — это то, как NFT-токены можно использовать в играх. Уже появились игры, где можно использовать NFT в качестве предметов. В одной даже продаются виртуальные земельные участки в виде NFT. У игроков будет возможность купить уникальное игровое оружие, шлем или что-то еще как NFT. Мне кажется, это то, что должны оценить люди. \n\nКакой музей нужно ограбить, чтобы украсть NFT?\n\n\nЭто изображение не является NFT. Пока не является! \r\nИзображение: «Невероятные приключения Уоллеса и Громита: Неправильные штаны» (The Wrong Trousers)\n\r\nЭто как посмотреть! Отчасти привлекательность блокчейна заключается в том, что он хранит записи о каждой транзакции, что затрудняет кражу или мошенничество. Тем не менее, криптовалюты крали и раньше, поэтому это действительно будет зависеть от того, как хранится NFT, и сколько работы потенциальная жертва готова приложить, чтобы вернуть свое имущество.\n\r\nПримечание: Пожалуйста, не воруйте!\n\nСтоит ли мне беспокоиться о том, каким будет цифровое искусство через 500 лет?\n\r\nНаверное, стоит. Bit rot — это реальное явление: портится качество изображения, некоторые форматы файлов больше не открываются, сайты падают, люди забывают пароль к своим кошелькам. Но физическое искусство в музеях также очень хрупко!\n\nМогу ли я купить NFT за криптовалюту?\n\r\nДа, наверное. Многие торговые площадки принимают Ethereum. Но технически каждый человек может продать NFT и запросить любую валюту, какую захочет.\n\nБудет ли торговля моими NFT-токенами способствовать глобальному потеплению и таянию ледников Гренландии?\n\r\nЭто как раз то, на что стоит обратить внимание. Поскольку NFT используют ту же технологию блокчейна, что и криптовалюты, они также могут потреблять достаточно много электроэнергии на транзакцию. Спасибо людям, работающим над устранением этой проблемы. Я совсем не хочу поджечь весь мир из-за CryptoKitties.\n\nМогу ли я построить подземную пещеру или бункер для хранения своих NFT?\n\r\nЧто ж, как и криптовалюты, NFT хранятся в цифровых кошельках (стоит отметить, что кошелек обязательно должен быть NFT-совместимым). Однако вы всегда можете поместить кошелек на компьютер в подземном бункере.\n\nВы устали столько раз печатать слово «NFT»?\n\r\nДа.   "
    },
    "Non-fungible token (NFT): основы": {
        "href": "https://habr.com/ru/post/579908/",
        "content": " Non-fungible token (NFT) или невзаимозаменяемый токен – это криптографический токен, являющейся производной от смарт контрактов в Ethereum. Его основная уникальность от других крипто токенов вроде биткойна в том, что один NFT нельзя заменить другим. Каждый NFT это полностью уникальный токен, который присоединяется к конкретному цифровому файлу, что в таком случае делает файл уникальным. Даже если попытаться копировать этот файл NFT не скопируется и останется у первоначального файла, таким образом делая его оригиналом. NFT нельзя разделить или заменить, его можно сравнить с полностью уникальным предметом в реальном физическом мире.Впервые NFT появился в 2017 году в сеть Ethereum в качестве игры «Криптокотики» (Crypto Kitties), в ней можно растить и разводить криптовалюту в виде котов. Отдельный криптокотик — олицетворение механики NFT. Его нельзя разделить, он обладает уникальным номером, геномом из 256-битной ДНК и 12 атрибутами, которые можно передать потомкам — цвет глаз, форму рта и прочее. В NFT вшита информация о создателе криптокотика, а также о его виртуальных отпрысках. В 2018 году самый дорогой криптокотик был продан за $140 тыс.Но настоящий бум NFT произошел в начале 2021 года. С декабря 2020 по февраль 2021 общий объем продаж с NFT поднялся с 12 до 340 миллионов долларов США.  Это связанно с тем, что деятели искусства и пользователи сети стали увидели новые возможности продажи своих работ благодаря NFT. NFT решил основную проблему людей занимающимся цифровым искусством. Это проблема подтверждения подлинности объекта искусства. Если рассматривать NFT с точки зрения блокчейна то, это реестровая запись, несущая в себе определенный набор инструкции и прав владельца. Таким образом приобретая файл с прикрепленным к нему NFT, вы также приобретаете все права на него, и удостоверяетесь в оригинальности файла.Это происходит на специальных платформах, работающих с NFT. Есть несколько популярных площадок — например, Rarible, Mintable, OpenSea. Последняя — самая крупная. Все они являются одновременно NFT-маркетплейсами и NFT-мастерскими. Для создания токена понадобится кошелек в системе Ethereum а также файл с цифровым контентом. Обычно алгоритм действий похож на работу с виртуальным фотоальбомом. Просто создаете коллекцию и добавляете в нее файлы в любом из доступных форматов — от PNG до MP4. Каждому файлу нужно придумать название и, желательно, описание. Передать уникальный токен на другой Ethereum-адрес, вне зависимости, принадлежит он тому же человеку или другому, возможно только по процедурам обработки смарт-контрактов, что подразумевает уплату системе комиссии.Самой крупной NFT продажей на май 2021 года является продажа 11 марта 2021 года в аукционном доме Christie’s jpg файла со склеенными вместе 5000 работами художника Beeple под названием «Everydays: The first 5000 days», работа была продана  за 69,3 миллиона долларов США. В России самым успешным NFT является Покрас Лампас суммарно он продал NFT на более чем 300 000 долларов США. Такая активность художников вызвала интерес NFT у коллекционеров, и они начали скупать все что имеет отношение к NFT. Это привело к тому, что люди начали продавать популярные твиты, фрагменты популярных видео и любой другой цифровой контент.Но если NFT начало свой путь как, по сути, игрушка для коллекционеров и шанс на заработок для художников, то сейчас в NFT видят перспективное решение по защите интеллектуальной собственности и регулированию оборота и ценообразованию на цифровые товары. Это становится возможным, так как NFT не только подтверждает оригинальность файла, но и несет в себе информацию о его свойствах, которая также не поддается разделению или копированию.Технически NFT ничем не отличается от других криптотокенов. В его работе также участвуют блокчейн, смарт контракты, кодирование и адреса. Чаще всего в своей работе NFT полагается на смарт контракты, поэтому преимущественно работает в сети Ethereum и все транзакции происходят в валюте ETH. Если кто-то заявляет, что владеет интеллектуальной собственностью на основе NFT, он, по сути, владеет оригинальной частью шестнадцатеричных значений, подписанных создателем. Другие могут свободно копировать необработанные данные, но не могут претендовать на право собственности. Исходя из этого, мы можем заметить, что связанные с NFT действия (покупка, продажа, торговля, аукцион) должны обрабатываться в соответствии с аналогичной базовой процедурой обработки смарт-контрактов.Создание NFT требует наличие базового распределенного реестра для записей и транзакций. Система NFT включает в себя наличие двух узлов, выполняющих роли владельца и покупателя. Процесс создание NFT можно описать следующим алгоритмом:Оцифровка данных. Владелец проверяет соответствие файла, заголовка и описания. После чего он приводит необработанные данные в надлежащий формат.Хранение. Владелец хранит данные на внешней базе данных вне блокчейна. Также ему доступно хранение в блокчейне, но за это как правило взымается газ, поэтому такой возможностью мало кто пользуется.Подпись данных. Владелец подписывает транзакцию, включая хеш. После чего транзакция отправляется в смарт кнтракт. Чекана и торговля NFT. После того как смарт контракт получит транзакцию происходит чекан NFT и его торговля.Подтверждение NFT.Каждый раз, когда чеканится или продается NFT, требуется отправить новую транзакцию для вызова смарт-контракта. После подтверждения транзакции NFT метаданные и сведения о владельце добавляются в новый блок, тем самым гарантируя, что история NFT остается неизменной, а право собственности сохраняется. Если попытаться визуализировать всю систему NFT, то получится схема, представленная на рисунке 6.Рис. 6 схема NFT системы.За свою не долгую историю NFT успел обзавестись стандартами, описывающими правила использования токенов в децентрализованных приложениях. На данный момент таких стандарта три ERC-20, ERC-721, ERC-1155. Стандарты отличаются схемами распространения токенов и уровнем их взаимозаменяемости. ERC – 20 предполагает что все токены взаимозаменяемы. ERC-721 предполагает, что все токены не взаимозаменяемы. Это унаследованный стандарт смарт-контрактов solidity. Его пользователи могут создавать новые совместимые с ERC-721 контракты. ERC – 1155 предполагает наличие полузаменяемых токенов, он представлят различные настраиваемые типы токенов. На рисунке 7 изображены схемы реализаций этих стандартов.Рис. 7 схема реализаций стандартов NFT.Децентрализованные приложения, реализующие систему NFT, должны удовлетворять следующим требованиям:Проверяемость.  NFT с его метаданными токена и владельцем может быть проверено кем угодно из вне.Прозрачность. Данные о продаже, чеканке и покупки NFT общедоступны.Доступность. Система NFT никогда не выходит из строя. В качестве альтернативы все токены выпущенные NFT всегда доступны для продажи и покупки.Защищенность. Метаданные NFT и их торговые записи постоянно хранятся и не могут быть изменены после того, как транзакции будут признаны подтвержденными.Атомарность. Торговля NFT может быть завершена одной атомарной, согласованной, изолированной и устойчивой транзакцией. NFT могут работать в одном и том же общем состояние исполнения.Помимо торгов предметами искусства NFT начинают использовать в других сферах. Так компания Nike запатентовала систему CryptoKiks, предназначенную для проверки подлинности кроссовок, кроссовки компании nike являются самыми подделываемыми в   мире.  Еще одним примером можно привести австрийскую почтовую службу и их проект Crypto Stamp. Это почтовые марки, привязанные к токенам. Их используют для отметки реальных почтовых отправлений. При этом каждая марка сохраняется и может быть частью цифровой коллекции.   "
    },
    "Невзаимозаменяемые токены (NFT) — явление года. Что это такое и каков их юридический статус в России?": {
        "href": "https://habr.com/ru/company/digitalrightscenter/blog/646009/",
        "content": " Мировой рынок охватила новая мания под названием NFT, или невзаимозаменяемые токены (non-fungible tokens). Издательство Harper Collins назвало это словом года. Речь идет о технологии, с помощью которой любой человек может закрепить за собой право владения любым цифровым объектом искусства. Музыканты уже продают подобным образом свои альбомы, пользователи Твиттера — написанные сообщения, а художники — созданные ими цифровые картины. Объем рынка NFT за минувший год совершил невероятный скачок с $100 млн до $22 млрд., cвидетельствует аналитический сервис DappRadar. А в отчете Chainanalysis называется и того большая цифра — $26,9 млрд. По мнению аналитиков, решающим фактором этого стало продвижение NFT с помощью таких всемирно известных брендов, как Coca-Cola, Nike, Adidas и Gucci.«Столько хайпа вокруг NFT возникло в том числе из-за нестыковки традиционного арт-мира и непонятно откуда возникшего рынка криптоискусства, в котором вдруг зазвучали астрономические суммы. Если до появления NFT ценник на произведения искусства устанавливали художественные галереи, то с появлением блокчейна любой автор получил возможность не только сам себя оценить, но и сам себя продать. <...> NFT пришли навсегда. Другое дело, что когда-нибудь эта технология будет для человечества как черно-белый телевизор, ей на смену придут более совершенные и безупречные аналоги, которые расширят и углубят открытые блокчейном возможности», — считает цифровая художница Meta Rite.Спрос на невзаимозаменяемые токены стал по-настоящему ажиотажным после того, как в марте художник Майк Винкельман, известный под псевдонимом Beeple, продал на аукционе Christie’s свою картину Everydays: The First 5000 Days в виде NFT-токена за рекордные $69,3 млн, и в результате стал одним из трех самых дорогих ныне живущих художников. Выше оценивались только картины Джеффа Кунса (91,1 миллиона долларов) и Дэвида Хокни ($90,3 млн.).Cреди самых заметных игроков NFT-рынка, помимо Винкельмана, называют также покупателя той самой работы Beeple «Первые пять тысяч дней» и создателя собственного инвестиционного NFT-проекта Metapurse — Виньеша Сундаресана aka MetaKovan, а также художников Тома Сакса, FEWOCiOUS (Виктора Ланглуа), Кевин и Дженнифер Маккой и Osinachi (Принц Джейсон Осиначи Игве).В феврале 2021 года супруга Илона Маска певица Граймс на площадке Nifty Gateway выручила $5,8 миллиона долларов за 20 минут торгов. На продажу она выставила коллекцию изображений и видео, которую создала вместе со своим братом. А в марте того же года основатель Twitter Джек Дорси выставил на площадке Valuables NFT первый в истории твит и продал его за 2,9 миллиона «зеленых».Не остался в стороне от NFT-технологий и самый известный художник современности. Блокчейн-компания Injective Protocol провела публичную акцию сожжения картины Бэнкси под названием Morons (White) и «конвертировала» ее в NFT-токен. Организаторы называют это «неким визуальным выражением артистического действа в реальном времени» и первым примером, когда подлинное произведение искусства было переведено во невзаимозаменяемый токен. Через несколько дней цифровую копию картины в Injective Protocol продали за $380 000. По данным издания The Bell, в ноябре 2021 года на планете было примерно 360 тысяч владельцев NFT, которым принадлежало 2,7 млн невзаимозаменяемых токенов. При этом наиболее ценные из них, а это примерно четыре пятых от всего объема рынка NFT, были сосредоточены в руках 32 тысяч человек (9% от общего количества владельцев).Невероятные приключения NFT в РоссииЧто касается рынка non-fungible tokens в РФ, то, бесспорно, истинной сенсацией 2021 года стал выпуск летом Государственным Эрмитажем собственной коллекции NFT, куда вошли цифровые копии великих шедевров — среди которых были «Мадонна Литта» Леонардо да Винчи, «Юдифь» Джорджоне, «Куст сирени» Винсента Ван Гога, «Композиция VI» Василия Кандинского, «Уголок сада в Монжероне» Клода Моне. Судя по всему, Эрмитаж решил взять пример с итальянской галереи Уффици, которая минувшей весной 2021-го выпустила криптокопию одной из работ Микеланджело Буонарроти — «Мадонна Дони». Ее продали за €140 тыс.Суммарный доход музея составил, по словам его директора Михаила Пиотровского, 24 млн рублей, из них 5 млн отправилось в качестве налогов в петербургский бюджет.Это было только началом экспансии главного музея страны в мир NFT. 10 ноября в Эрмитаже открылась виртуальная экспозиция «Незримый эфир», где были представлены картины и медиафайлы, созданные с помощью блокчейна. Самый известный в России #прямосейчас уличный художник — Покрас Лампас — выставил на криптоаукцион Foundation.app проекцию своего полотна на крупнейшую гидроэлектростанцию Северного Кавказа — Чиркейскую ГЭС, и продал его за $29 тыс. «Я вижу NFT как технологию верификации уже существующего арта, это универсальный сертификат аутентичности для полотна», — заявил художник в разговоре с РИА «Новости».А арт-дуэт ППСС (художники Павел Пепперштейн и Соня Стереостырски) создал невзаимозаменяемый токен своей работы «Новый мир» из лоскутов ткани. Цена на него на платформе Rarible остановилась на отметке около $15 тыс.В этой статье мы попробуем разобраться с тем, что такое технология NFT, а также каков ее юридический статус в действующем законодательстве РФ (и имеется ли он вообще).Что такое NFT-токен и зачем он нуженИзначально технология NFT была создана в 2017 году на основе смарт-контрактов, привязанных к криптовалюте Ethereum. Смарт-контракты дают возможность детально прописать в блокчейне условия соглашения и механизм его строгого выполнения. По сути, это цифровой аналог бумажных договоров. Закрепить за собой владение каким-то активом по смарт-контракту можно с помощью токена. Это тоже цифровой аналог — в данном случае аналог ценной бумаги, известный как security token.Большинство токенов являются взаимозаменяемыми (fungible) — то есть они равны друг другу и могут использоваться в качестве валюты (например, такими токенами обладают несколько инвесторов одной и той же компании). Есть и наполовину взаимозаменяемые токены (semi-fungible), обладающие каким-то одним уникальным свойством, позволяющим отличать их друг от друга. Например, эти токены могут закреплять за их владельцами право на получение билета на сеанс в кино — в таком случае цена на них будет одинаковая, а закрепленные за владельцами токенов места в кинотеатрах — разные. Невзаимозаменяемые же токены (non-fungible tokens или NFT) полностью уникальны — и дают возможность владения цифровым объектом, который существует в единственном экземпляре: музыкальными произведениями, цифровыми художественными объектами, игровыми предметами (оружие, персонажи) и любыми другими уникальными виртуальными вещами. Учитывать посредством NFT можно и объекты реального мира, по аналогии с тем, как в реестрах учитывают недвижимость или автомобили. Но с объектами вещественного мира основные преимущества децентрализованного цифрового учета исчезают – характеристики таких объектов сложно однозначно определить, их купля-продажа невозможна исключительно путем передачи информации, нужно передавать и саму вещь. Поэтому NFT используют сейчас главным образом как глобальный реестр учета прав на цифровые объекты: фотографии, музыку, платные предметы в компьютерных играх и т.п.При проведении сделки с NFT пользователь покупает только уникальный цифровой сертификат на произведение искусства, записанный на блокчейне, а само произведение при этом никуда не перемещается. Все хранится на вечном хранилище (так называемом IPFS - Inter-Planetary File System, это одноранговая распределенная файловая система, которая соединяет все вычислительные устройства воедино). Такой блокчейн-сертификат (по структуре своей всего лишь строчки кода, записанные на блокчейне) подтверждает, что именно вы владеете оригинальной копией этого объекта — несмотря на то, что его может посмотреть или скачать абсолютно любой человек. Точно так же любая картина может принадлежать музею или частному лицу, но вы можете увидеть ее на выставке или в каталоге. «Автор, как и любой пользователь интернета, может хранить картинку где угодно: на телефоне, флешке, компьютере, планшете, но это ничего не значит. Цифровую работу можно по-прежнему скачивать, копировать и пересылать, но обладателем подлинника будет только тот, кому принадлежит токен. Раньше отсутствие у цифрового искусства оригинала было большой проблемой, его было невозможно продать, не придав ему физическую форму. NFT решило этот вопрос, и в этом революционность этой технологии», — считает художница Meta Rite.Reuters подчеркивает, что, как и на многих новых нишевых инвестиционных площадках, на рынке NFT есть риск понести убытки в случае, если ажиотаж вокруг технологии угаснет, а также существует опасность стать жертвой мошенников, поскольку многие участники торгов скрывают имена за псевдонимами. «Поскольку выпустить NFT-токен на произведение может любое лицо, у которого имеется к нему доступ, возможна ситуация, при которой беститульный токенизатор (человек, не имеющий права на произведение) недобросовестно использует и коммерциализирует чужие произведения. Механизмы регулирования, позволяющие ограничить такие случаи, должны быть сосредоточены на арт-платформах, которые допускают генерацию токенизированных NFT-произведений. В числе таких мер — требования по обязательной идентификации и верификации пользователей, внедрение дополнительных инструментов проверки подлинности токенизированного контента и доказательств прав на него», — рассказала в интервью «Ъ» эксперт Екатерина Портман, директор Deloitte Legal на территории СНГ.Тем не менее, как объясняет сооснователь нью-йоркской платформы для продажи и покупки цифрового искусства Snark.art Андрей Алехин, «NFT дает возможность даже в цифровом мире, где нет границ и физических копий, все равно заявить о том, что вы так или иначе \"владеете\" конкретной работой или предметом коллекционирования. Поэтому NFT и получил широкое применение в арт-индустрии, особенно сейчас, во время глобальной пандемии, когда практически все выставки и художественные ярмарки либо были закрыты, либо перешли в онлайн».«NFT-волна вынесла цифровой арт на передовой край общественного внимания. Только за эти полгода мои работы приняли участие в шести выставках, двух форумах и одной международной конференции <...> Не нужно печатать мерч, не нужно накатывать арт на пенокартон, не нужно идти с ним на Почту России. Одновременно с этим, одним щелчком мыши ты попадаешь на международный рынок цифрового искусства. Да, на нем все не просто, но он есть и это не может не радовать», — говорит Meta Rite.А по словам Александра Сальникова, сооснователя Rarible – а это один из крупнейших в мире NFT-маркетплейсов, основанный  выходцами из России, - до NFT просто не существовало эффективной технической возможности владения цифровыми объектами, что «значительно ограничивало возможности монетизации работы digital-художников». Юридический статус NFT-токенов и сделок с ними на мировом крипторынкеРассмотрим для примера пользовательское соглашение платформы OpenSea — одной из самых популярных площадок для приобретения «нифти». В этом соглашении записано, что размещая или отправляя те или иные цифровые активы с помощью платформы, вы тем самым безвозмездно предоставляете OpenSea неисключительную лицензию, действующую на территории всего мира с правом заключать сублицензионные договоры. Подобная лицензия выдается для следующих обозначенных целей: использование, копирование, воспроизведение, обработка, адаптация, изменение, публикация, передача, отображение и распространение любыми способами. Отдельно подчеркивается, что предоставление такой лицензии не ограничивает прав собственника того или иного актива, а также отмечается, что OpenSea не имеет каких бы то ни было прав на продажу ваших активов: «We're [OpenSea] just saying we might show it off a bit».А в правилах уже упоминавшейся нами цифровой платформы Rarible специально указано, что ее пользователи не вправе создавать NFT-токены, которые нарушают права третьих лиц. Вопрос же перехода исключительных прав на сами объекты интеллектуальной собственности пока что создателями Rarible никак не урегулирован.«Поскольку вопросы передачи права чаще всего регулируются соглашениями между арт-платформой либо правообладателем и приобретателем, эти документы могут служить доказательствами принадлежности прав на токенизированный объект», — отмечает Екатерина Портман. Таким образом, если между создателем и покупателем NFT не заключено отдельного юридического соглашения, то вместе с покупкой невзаимозаменяемого токена покупатель не получает никаких исключительных прав на произведение как объект интеллектуальной собственности. Да, иные правила могут быть установлены на какой-либо альтернативной платформе — но на сегодняшний день пользовательские соглашения ни одной из крупнейших платформ для сделок с NFT таких норм не содержат. Возможно, в будущем создателям NFT-токенов дадут право самим выбирать условия лицензий либо иного получения прав (например, в порядке отчуждения) в будущих версиях своих продуктов. Но пока об этом ничего не известно ни творцам произведений, ни законодателям, ни операторам криптоплатформ.Юридический статус NFT-токенов и сделок с ними в России, с учетом Закона о цифровых финансовых активахНапомним, что цифровая валюта, согласно п. 3 ст. 1 Федерального закона от 31.07.2020 N 259-ФЗ «О цифровых финансовых активах, цифровой валюте и о внесении изменений в отдельные законодательные акты Российской Федерации» (далее — Закон о ЦФА), — это, если максимально упростить, совокупность электронных данных, которые можно использовать в качестве средства платежа, не являющегося рублем или инвалютой. А цифровые финансовые активы — это цифровые права, включая денежные требования, права на ценные бумаги, на участие в капитале организаций, существующие в виде записей в информационной системе. При этом выпуск ЦФА возможен только в порядке, установленном этим же Законом. Банк России ведет реестр операторов, выпускающих ЦФА. Этими операторами могут быть только юридические лица, личным законом которых является российское право.Таким образом, юридический статус NFT-токенов сейчас российским законодательством никак не определен, поскольку они не подпадают ни под определение цифровых финансовых активов (так как выпуск NFT-токенов осуществляется не исключительно российскими юрлицами),  ни под термин «цифровая валюта» (так как невзаимозаменяемый токен не есть средство платежа).Какое-то отдаленное подобие NFT-токенов могут создавать в РФ в рамках Федерального закона от 02.08.2019 N 259-ФЗ «О привлечении инвестиций с использованием инвестиционных платформ и о внесении изменений в отдельные законодательные акты Российской Федерации». Данный закон регламентирует работу в России инвестиционных (краудфандинговых) площадок, когда на сайте организуют сбор средств в обмен на право требовать в будущем передачу какой-либо вещи или оказание услуги, выполнение работы. Такие права в статье 8 закона именуются «утилитарные цифровые права» (по аналогии с западным названием «utility token»). Утилитарными цифровыми правами не может быть право требования имущества, сделки с которым подлежат государственной регистрации или нотариальному удостоверению. С выходом Закона о ЦФА возможность инвестирования на данных платформах путем приобретения утилитарных цифровых прав дополнили возможностью приобретения цифровых финансовых активов. Однако создавать подобные площадки и операторов ЦФА нужно исключительно в рамках российского законодательства. Фактически, утилитарные цифровые права не сильно подходят под определение NFT-токенов в том контексте, в котором мы говорили о них выше. Можно сделать вывод, что сейчас учет авторских прав посредством NFT, для нашего законодательства не существует, проходя на 100% в «серой зоне». Для российского законодателя существуют только непосредственно сами авторские права, которые передаются не посредством какого-то заморского и малопонятного блокчейна, а сугубо путем договорных отношений в рамках Гражданского кодекса РФ. Более того, статья 14 Закона о ЦФА устанавливает прямой запрет на расчёты криптовалютами за товары, и пока не очень понятно, могут ли цифровые активы в формате NFT рассматриваться как «товар». Операции с NFT по российскому законодательству сейчас следует рассматривать только как сделки без оформления письменного договора (п.2 ст. 159 ГК РФ). Если дело дойдет до оспаривания прав в суде, вы сможете оперировать в лучшем случае публичным соглашением с интернет-площадкой, где была проведена сделка с NFT, и распечатками из блокчейна (ч.1 ст. 162 ГК РФ). Не исключено использование NFT для защиты прав на интеллектуальную собственность, что-то вроде регистрации в Роспатенте, но только в блокчейне. Это поможет решить одну из главных проблем для всех децентрализованных автономных организаций. Дело в том, что на текущий момент ни одна из DAO не может быть полностью децентрализована — ей в любом случае необходим как минимум одно юридическое лицо, уполномоченное на регистрацию прав на объекты интеллектуальной собственности (например, таким образом часто регистрируют товарные знаки) от имени DAO в государственных структурах. Более того, такое использование технологии позволит быстро и дёшево регистрировать авторские и иные права на различные произведения, фактически присваивая им отдельные токены. Эффективно нечто подобное уже реализовано на международном уровне в системе WIPO PROOF. Попытки создать системы подобного учёта были и в России (проект IP Chain), однако серьёзным успехом они до сих пор не увенчались.     "
    },
    "Так это «пирамида» или нет? Что делать с NFT в 2022 году": {
        "href": "https://habr.com/ru/post/647959/",
        "content": " Как вы 10 лет назад представляли себе цифровую экономику будущего? Скорее всего, это было очень смело и броско: новомодный блокчейн, децентрализованные финансы, искусственный интеллект и прочий футуризм. На деле новые технологии повернули немного не туда: в 2021 году люди продавали мемы и зарабатывали на хлеб с помощью геймерских видеокарт. Одним из главных понятий прошлого года, наряду с уже привычными “ковидом” и “локдауном” стал NFT - о нем говорят все. Оцифрованные в блокчейне “права собственности” на картинки или предметы из онлайн-игр продаются и покупаются за десятки миллионов долларов. Сейчас хорошее время, чтобы поговорить о будущем этого загадочного рынка. Куда он будет двигаться в новом году? Я попробовал выяснить, о чем идет речь: о новой цифровой экономике, или об очередном финансовом “пузыре”. Для этого пообщался и с разработчиками, и с нашими партнерами, игроками криптобизнеса.Что такое NFT и как он работаетИтак, NFT, или “невзаимозаменяемый токен” (Non-Fungible Token) - это криптографический токен на основе блокчейна. Не будем углубляться в тонкости работы “крипты”, отметим только пару важных моментов: по умолчанию все токены в блокчейн-сети равнозначны, их цена привязана к курсу криптовалюты. Каждый токен можно заменить на точно такой же другой, а при необходимости и поделить на части. NFT также входят в блокчейн-сеть, но устроены иначе. У таких токенов есть собственные коды и метаданные, которые обеспечивают им уникальность. Каждый NFT неповторимый, как снежинка - разделить или подделать его практически невозможно. Если равнозначные токены играют в криптовалюте роль “монеток”, то NFT скорее подобен документу на владение собственностью - с уникальной подписью нотариуса и сотней мокрых печатей. С такой концепцией в мире “крипты” экспериментировали давно, но свою современную форму NFT обрели в 2017 году, на базе смарт-контрактов Etherium. Дает ли NFT какие-либо реальные права распоряжаться виртуальными ценностями? Вопрос, скорее, юридический. По мнению критиков - нет, и все тут. В некоторых случаях регулировать правообладание пытаются создатели токенов и NFT-биржи. Но сейчас дело доходит и до реальных судебных исков из-за токенов. Квентин Тарантино сегодня судится со студией Miramax из-за выпуска NFT по “Криминальному чтиву”, а исход этого разбирательства может стать знаковым для всей индустрии. Попытка Тарантино выпустить NFT по “Криминальному чтиву” обернулась судом / СкриншотОткуда хайп?В уже упомянутом 2017 году пара друзей-айтишников из Канады задумала продавать токены в виде уникальных аватаров. Проект получил название CryptoPunks: это была коллекция из 10 тысяч картинок, защищенных токенами Etherium. Небольшая “шалость” удалась, NFT из коллекции быстро выросли в цене и сегодня продаются за миллионы долларов. У “криптопанков” быстро появились последователи: как новые наборы аватарок (те же обезьяны из набора Bored Ape Yacht Club) так и  целые карточные игры на блокчейне (CryptoKitties, Axie Infinity).С приходом новой волны интереса к “крипте” в 2020 году NFT получили свою долю популярности. Очевидно, тут сыграла страсть человека к собирательству редкостей. Оказалось, что с помощью блокчейна можно обозначить в цифре “оригинальность” практически любого контента: от живописных полотен эпохи Возрождения, до мемов и смешных роликов с котами. Одним из ключевых триггеров хайпа стала продажа работы художника Beeple за 69 миллионов долларов в марте прошлого года. Рынок заметили крупные инвесторы - и понеслось! В какой-то момент казалось, что каждый контент-мейкер, каждый бренд хочет выпустить собственный NFT - чтобы быть в тренде, или чтобы заработать. Даже “отец” современного интернета Тим Бернерс-Ли продал за 5,4 млн долларов токен с исходным кодом сети. Тот самый коллаж Beeple, проданный за 69 миллионовТем временем в мире гейминга торговля NFT-предметами стала новой формой монетизации. В эксперименты с блокчейном втягиваются такие гиганты как Ubisoft и Square Enix. Культовый гейм-дизайнер Питер Молинье анонсировал разработку проекта Legacy - “первого бизнес-симулятора на блокчейне”, с недвижимостью и землей. И сходу заработал 50 миллионов долларов, хотя до выхода игры еще далеко. Оцените масштабы: если в 2020 году объем рынка NFT составлял 100 миллионов долларов, то по итогам 2021 года перешагнул за отметку в 40 миллиардов. Что будет с NFT Как это часто бывает, хайп вокруг NFT породил “обратный хайп” - шквал критики самого разного качества со всех сторон. Как в экспертной среде, так и среди обывателей звучат заявления о том, что ценность токенов надувается искусственно, и этот “цифровой пузырь” лопнет, оставив 99% инвесторов ни с чем. Противники NFT сравнивают этот рынок с продажей участков на луне и имен для звезд: в этой аналогии покупатель также не получает реального права собственности, лишь условную запись об этом в чужом реестре. Есть и более предметные замечания, связанные с доказанными эпизодами отмывания денег и мошенничества с NFT. В ноябре прошлого года раскрылась попытка аферы с  токеном из коллекции CryptoPunks: инвестор хотел взвинтить цену на свой токен и попытался купить его у самого себя за 124 457 ETH (более полумиллиарда долларов по курсу на момент сделки!), используя заемные средства. Сколько подобных эпизодов остались в тени - вопрос риторический. За рынок NFT ожидаемо ухватились преступники, ведь он оказался идеальной средой для отмывания незаконно нажитых богатств. Скажем, создаешь токен с рисунком котика, и тут же продаешь его сам себе через подставное лицо за баснословные деньги. Вести мониторинг таких процессов даже в развитых странах сегодня просто некому.Эта пиксельная аватарка едва не стала предметом спекуляции на полмиллиарда долларовЗначит ли все это, что мы имеем дело с “аферой века” и “цифровым филиалом МММ”? Скорее нет, чем да (хотя за отдельными проектами нужно следить очень внимательно). Несмотря на сомнительные эпизоды, сама технология NFT уже доказала свою полезность, а теперь с ней связывают свои интересы крупные капиталы и IT-гиганты. С точки зрения инвестиций рынок NFT более ликвиден, чем традиционный рынок искусства, ведь участникам сделки не приходится платить 5-10% комиссионных брокерам. В пользу NFT пока что играет и мнение публики. Краха криптовалют, который годами предрекался уважаемыми экспертами, за минувшие 10 лет так и не произошло. В тему блокчейна входят бренды, звезды и лидеры мнений. Coca-Cola выпустила собственную коллекцию токенов, Nike купила NFT-студию RTFKT, а Эминем поставил себе на аватарку в Twitter обезьяну из коллекции Bored Ape. И таких примеров сотни. Все указывает на то, что NFT должна стать чем то большим, чем модной игрушкой для хайпа. Когда “пена” вокруг технологии осядет, она должна занять важное место в новой цифровой экономике, став полноценным средством защиты интеллектуальной собственности. Криптографические токены постепенно придут в новые сферы - это те самые смарт-контракты, которые помогут и в логистике, и в сфере недвижимости, и на земельном рынке. Тренды NFT в 2022 годуЧто ждет сферу NFT в ближайшей перспективе? Чтобы ответить на этот вопрос, я поговорил с игроками рынка и экспертами по блокчейну. Все сходятся на том, что у этого рынка есть будущее, но хотят видеть в нем больше предсказуемости. Так или иначе все говорят о таких тенденциях: Приход регуляторов. Вольница с продажей токенов пиксельных картинок за миллионы не может продолжаться вечно. Скажем, в США сегодня рассматривают сразу несколько механизмов регуляции этого рынка. NFT-маркетплейсы могут получить там правовой статус арт-дилеров - фискальные органы Штатов очень тщательно проверяют сделки по продаже предметов искусства, ведь это классический способ отмывания денег. NFT-токены также могут приравнять к привычной криптовалюте или даже к ценным бумагам, со всеми вытекающими отсюда последствиями. К слову, в Украине есть наработки для успешной регуляции этого рынка. В сентябре прошлого года Рада приняла закон о легализации виртуальных активов, под определение которых попадает как криптовалюта, так и NFT. Предполагалось создание целого нового госоргана для контроля над оборотом криптоактивов, но окончательное утверждение закона забуксовало. Охлаждение рынка. К концу 2021 года глобальный рынок NFT переступил отметку в 40 миллиардов долларов. И это очень много, ведь речь идет о цифровых объектах, большинство из которых имеют минимальную художественную ценность и часто создаются “на коленке”. Для сравнения - глобальный рынок искусства в 2021 году достигнул отметки в 50 миллиардов. Пик NFT-лихорадки уже позади. Фактически, охлаждение рынка началось еще прошлой осенью - сделок становилось все меньше, хотя средняя стоимость лотов оставалась высокой. Можно полагать, что в новом году взрывного спроса на цифровое искусство не будет, фокус смещается от продажи NFT-арта к сектору гейминга (GameFi).Поиск новых решений. Исторически основой для NFT стал блокчейн Ethereum, но сегодня его колоссальная сеть подходит для этого все хуже: транзакции проходят медленно, требуют приличных энергозатрат и издержек. Ситуацию должен исправить переход к Ethereum 2.0, но сроки этого масштабного обновления постоянно откладываются, а предсказывать все последствия перехода “эфира” на алгоритм Proof-of-Stake сегодня не берется никто. Крупные NFT-проекты уже ищут альтернативы “эфиру”, которые могут проводить транзакции быстрее и эффективнее. Скажем, успешная NFT-игра Axie Infinity использует блокчейн Ronin. Популярностью пользуется Solana. Есть и проекты, которые самостоятельно разрабатывают блокчейн под собственные нужды.Революция в гейминге. В этом году NFT может ворваться в мир цифрового досуга, по сути превращая его в цифровую работу. Возможность зарабатывать в игре реальные деньги обеспечивает совершенно другой уровень вовлеченности игроков. Блокчейн породил новую форму монетизации гейминга - Play-to-Earn (P2E). Это крайне выгодная для разработчиков модель, которая при минимальных затратах \"привязывает\" игроков к проекту, а значит так или иначе генерирует стабильную прибыль. Наверное, самым удачными примером такой игры на сегодня является Axie Infinity - летом база ее пользователей перевалила за отметку в один миллион человек. В 2022 году в нишу Play-to-Earn постараются массово войти разработчики мобильных F2P-игр. Но и традиционная игровая индустрия не останется в стороне. Компания Ubisoft объявила о запуске собственного NFT-маркетплейса на блокчейне Tezos, японский игровой гигант Square Enix 1 января также объявил о планах развивать блокчейн и метавселенную. Движение к Metaverse. Еще одним предметом хайпа в уходящем году стал “метаверс” - озвученная Марком Цукербергом сверхзадача построить интернет будущего, замешанный на виртуальной реальности и геймифицированной цифровой экономике. Полноценной виртуальной экономике нужны реальные цифровые ценности, и NFT идеально вписывается в эту роль.Сегодня сложно представить, как будет выглядеть “метаверс” с криптоэкономикой, и удастся ли его построить в принципе. Но громкие заявления IT-гигантов о строительстве собственных виртуальных миров будут стабильно подпитывать интерес к NFT, а метаверс-платформы вроде Decentraland и Next Earth успешно продают цифровую недвижимость и \"землю\" на блокчейне. Как знать, возможно через 10 лет токены “из эпохи позднего WEB 2.0” станут в метавселенной настоящими драгоценностями.В NFT-игру Axie Infinity сегодня играют, в основном, ради заработкаЧто делать с NFTЯвляется ли инвестиция в NFT хорошим вложением в реалиях 2022 года? Ни в коем случае никого ни к чему не призываю, в конце-концов инвестиции всегда были и будут рисковым занятием для смелых. Особенно во всем, что касается блокчейна. Если не считать выпуска токенов ради пиара и купли-продажи NFT-арта, у бизнеса сегодня есть несколько способов включиться в этот бурный рынок. Самый очевидный: создание торговой площадки для NFT.Хотя невзаимозаменяемые токены входят в блокчейн, свободно торговать ими на обычных криптобиржах сегодня нельзя. Для этого приходится создавать отдельные платформы, которые могут хранить, выпускать и торговать NFT. Со стороны пользователя NFT-маркетплейсы похожи на обычные интернет-магазины и платформы “купи-продай”: юзеры регистрируются, создают личные кошельки, гуляют по каталогу, выкладывают или создают собственные токены. Технологически же такая площадка сильно отличается от привычного e-commerce, требует иной архитектуры и привлечения блокчейн-разработчиков. Самое важное тут - правильно обозначить цели платформы, удачно подобрать под них блокчейн и стандарт токенов. Сейчас тренды на этом рынке задают крупнейшие NFT-маркетплейсы: OpenSea, SuperRare, Rarible, NiftyGateway и прочие. Однако рынок быстро обрастает новыми нишами, поэтому у толковых площадок есть все шансы “взлететь”. Торговля NFT вполне может выйти за пределы продажи мемов и искусства - ждем взлета крупных платформ со смарт-контрактами для сферы недвижимости, инвестиций, ритейла, логистики, кибербезопасности.Еще одно перспективное направление - разработка блокчейн-игр. Надо признать, что рядовые увлеченные геймеры сегодня смотрят на модель Play-to-Earn без доверия - в лучшем случае ее рассматривают как возможность заработать, но уж точно не как способ хорошо провести время. По-настоящему впечатляющих результатов смогут достигнуть те, кто органично вплетет криптоэкономику в интересный геймплей: создаст масштабную игровую метавселенную (как в культовой космической MMO EVE Online) или супергибкую песочницу, где игроки будут строить экосистемы и развлекать себя сами (как в Minecraft, Roblox или Garry`s Mod). Вместо выводаСегодня сфера IT переживает самый масштабный технологический перелом за последние 20 лет: ИИ, блокчейн и метавселенные определенно меняют правила игры, хотя мало кто понимает, в какую сторону. Сложившуюся ситуацию называют и цифровым “диким западом” и “цифровыми девяностыми”. Энтузиасты блокчейна и NFT говорят о наступлении “эпохи WEB 3.0”, что бы это не значило.Блокчейн-технологии сейчас стоят на распутье и могут развиваться в любом направлении. Их дальнейшая эволюция будет зависеть и от инвесторов, которые вкладывают деньги в конкретные проекты, и от судьбы стартапов - любая смелая идея может “выстрелить” и поменять правила игры. Бизнесу в этой ситуации остается лишь внимательно следить за трендами и искать надежных партнеров в IT - держать руку на пульсе и “на курке”, чтобы избежать ошибок и не упустить ценные возможности на новых рынках.   "
    },
    "Юридические аспекты NFT: как создателям NFT защитить свои исключительные права на цифровые активы": {
        "href": "https://habr.com/ru/post/653657/",
        "content": " Пожалуй, сейчас трудно найти человека, который ни разу до сегодняшнего дня не слышал про NFT.  NFT (non-fungible tokens, невзаимозаменяемые токены) с каждым днем набирают все большую популярность, и представляют собой новый, и по этой причине ещё не урегулированный в правовом отношении источник дохода. Доход можно получать от продажи NFT в качестве цифрового имущества посредством заключения смарт-контрактов на аукционной NFT-площадке, а также от размещения и продажи NFT-объектов в рамках различных, в том числе игровых, метавселенных. Помимо того, что NFT представляют собой цифровой актив, они также являются объектами интеллектуальной собственности, т.к. представляют собой результат интеллектуальной деятельности человека. С учетом технологических особенностей сети Интернет, возникают вопросы надлежащей правовой защиты исключительных прав на создаваемые NFT.Особенности NFT как объекта исключительных правNFT представляют собой цифровое имущество (картины, аудиодорожки, видео, фотографии и многое другое) плюс набор определенных прав на него (специальный сертификат с метаданными). NFT доказывают право собственности на уникальные цифровые активы, которые представляют собой результаты творческой деятельности, с помощью технологии блокчейн. NFT – это уникальный токен, хранящийся в блокчейн, он неразделим и существует в единственном числе. Для понимания NFT в качестве объекта интеллектуальной собственности рассмотрим пример. Проданная на NFT-аукционе картина цифрового художника Beeple (Майка Винкельманна) представляет собой токен, в метаданных которого указана ссылка на оригинальную цифровую картину автора. Beeple является автором и правообладателем картины не потому что он сделал NFT, а потому что он является создателем картины – тем, кто облек ее в объективную форму путем редактирования на своем компьютере или на любом другом девайсе, который использует автор в своем творческом процессе. Любое третье лицо, которое сделает NFT с картиной Beeple, не станет обладателем исключительных прав на саму картинку. Ее правообладателем останется Beeple. Передача токена также сама по себе не является способом выдачи лицензии, если это прямо не сказано в договоре между сторонами.Другой пример: Джек Дорси сделал NFT, привязав его к первой публикации в Твиттере.  Он продал именно токен, привязанный к твиту, а не авторские права на свой первый твит.  Победители NFT-аукционов зачастую лишь приобретают право создать собственную копию оригинального цифрового объекта. В худшем — лишь онлайн-документ с уникальным бэкграундом.В цепочке перепродаж цифрового произведения оригинал в абсолютном большинстве случаев задействован лишь один раз — когда токен непосредственно создаётся. Затем с каждой новой продажей создаётся локальная копия выставленного на торги объекта, и с каждым повторением его ценность неуклонно падает.Таким образом, приобретая NFT, вы не покупаете цифровое произведение искусства, главное ваше приобретение – это токен-сертификат, который может гарантировать ваши исключительные права, а может не гарантировать ничего, кроме возможности обладать уникальным цифровым сертификатом. При этом даже после продажи NFT-объект остаётся в интернете: любой может его скачать, распечатать и повесить на стену, но вы владеете оригиналом, и данные о вас как владельце токена остаются в системе блокчейн. Виды нарушений исключительных прав на NFT и современное правовое регулированиеВ силу того, что NFT никак не урегулированы государством, возникают большие возможности для злоупотреблений, и если сформированные платформы, такие как Roblox, представляют меньший риск для правонарушений в отношении NFT (конечно, всегда случаются сбои), то неустойчивый рынок NFT сталкивается с широким спектром проблем: от мошенничества и нарушения исключительных прав правообладателей до взломов криптокошельков. Физически украсть оригинальный сертификат NFT невозможно, но ничто не мешает скопировать файл, к которому привязан выставленный на торги NFT, и создать собственный токен. К сожалению, приходится констатировать, что вопрос плагиата NFT регулируется исключительно децентрализованным интернет-сообществом, алгоритмами наподобие тех, что мы наблюдаем в Instagram и Youtube, и администрациями конкретных платформ. Поэтому каждый отдельно взятый эпизод онлайн-воровства интеллектуальной собственности может закончиться по-разному.Также в рамках отдельных платформ нередко используются автоматизированные алгоритмы определения нарушений авторских прав, что упрощает процесс вычисления преступников. Например, итальянская группа по борьбе с пиратством Digital Content Protection запустила новую услугу, которая помогает правообладателям контролировать платформы NFT, проекты Web 3.0 и связанные с будущей метавселенной. Компания работает с крупными партнерами в музыкальной индустрии, включая Sony, Universal и Warner. Одним из предлагаемых решений является служба мониторинга и удаления, которая обнаруживает контент, потенциально нарушающий авторские права, и требует от онлайн-сервисов и платформ его удаления. Хотя DСP не может изменять записи в блокчейне, компания использует листинги на популярных рынках NFT, таких как OpenSea и Rarible. При обнаружении такого контента служба по борьбе с пиратством может отправить уведомление о его удалении. Другой вариант — задокументировать действия, нарушающие авторские права и обратиться в суд[1].Как известно, право охраняет интересы авторов креатива, предоставляя им монополию на использование созданных объектов интеллектуальной собственности. В частности, конкретные виды использования исключительных прав указаны в ст. 1270 ГК РФ. Аналогичные нормы есть и в законодательствах других стран.Дальнейшее использование токена вне платформ также может считаться нарушением исключительных прав авторов. Если коллекционер NFT решит сделать свой собственный сайт-галерею, который будет читать публичный адрес Ethereum и демонстрировать картинки, которые лежат у него в кошельке в формате NFT, но на которые у него нет прав, то это будет рассмотрено как нарушение исключительных прав авторов. В таком случае правообладатель может подать иск к такому администратору сайта (в силу того, что нарушены его исключительные права на токен – объект интеллектуальной собственности) об устранении нарушений своих прав в соответствии со ст. 1252 ГК РФ. Еще одним возможным нарушением авторских прав при создании NFT может быть использование объектов интеллектуальной собственности без согласия правообладателя в NFT.  В таком случае правообладатель имеет право подать исковое заявление на правонарушителя об устранении нарушения исключительных прав на объект интеллектуальной собственности (товарный знак, музыкальное произведение и пр.) и выплате компенсации. Например, в феврале 2022 г. Nike подал иск против STockx, обвинив онлайн-платформу в продаже несанкционированных NFT-изображений своей обуви. Компания утверждает, что предложения StockX нарушают ее права на товарные знаки и могут ввести потребителей в заблуждение. Проблемы правовой защиты NFT и способы их решенияВ силу того, что сфера создания и оборота NFT не урегулирована специальным законодательством при одновременном стремительном развитии NFT-аукционов, существуют следующие проблемы правовой защиты NFT. Во-первых, это проблема определения надлежащего ответчика-пользователя аукционной NFT-площадки, который нарушил исключительные права на токен путем копирования файла и размещения таким образом собственного токена. Проблема объясняется низкими требованиями к идентификации пользователей при регистрации их на аукционной площадке, а также тем, что сделки на таких платформах совершаются в криптовалюте (эфирах).  Данная проблема может быть разрешена путем установления дополнительных обязательств пользователей по раскрытию своих данных на сайте аукционной площадке при регистрации. Нужно сказать, что данная проблема будет неактуальной для площадок, которые позволяют расплачиваться за токены фиатной валютой – в этом случае представляется возможность отследить транзакцию и запросить данные у банков-посредников операции. Во-вторых, создание нового токена с копией файла из другого токена характеризуется отсутствием эффективных механизмов защиты. Лицу, чьи исключительные права нарушаются таким копированием, практически невозможно доказать, что принадлежащий ему токен является оригиналом, в отличие от копии, созданной правонарушителем. Конечно, возможно отследить время создания записи в смарт-контрактах и сертификатах токенов, однако дополнительным решением проблемы может стать заключение отдельного классического договора на приобретение токена/отчуждение исключительных прав на него между пользователями. Это необходимо для того, чтобы упростить задачу доказывания неправомерных действий лица по копированию файла из оригинала токена, предоставленного ему по договору. В-третьих, существует проблема ответственности NFT-маркетплейсов за правонарушения, совершаемые пользователями в рамках их платформ. Решением проблемы может стать создания централизованной организации международног уровня, которая будет выдавать лицензии на осуществление деятельности аукционными площадками, а также проводить мониторинг всех существующих площадок на наличие неправомерно заимствованных токенов, нарушений исключительных прав на результаты интеллектуальной деятельности реального мира посредством автоматизированных систем. В таком случае выявлять и своевременно пресекать действия пользователей, нарушающих права правообладателей, станет гораздо легче.  <![endif]>[1] https://habr.com/ru/news/t/650997/    "
    },
    "В 12 я помог роботу POMPO получить награду на Behance. А он поможет мне сделать NFT и построить робота в реале": {
        "href": "https://habr.com/ru/post/664414/",
        "content": " Привет, Хабр.Меня зовут Леонтий. Я уже немного рассказывал тут о себе и своих экспериментах по программированию, которыми я увлекаюсь с младших классов. А еще я увлекаюсь наукой, робототехникой и рисованием. В этой статье я хочу рассказать о роботе POMPO, которого я придумал, когда мне было 12 лет. Тогда же я выложил его на Behance и получил награду «Лучший дизайн персонажа».С тех пор я многому научился и теперь я собираюсь построить настоящего боевого робота и участвовать в шоу BattleBots. Деньги на это я  планирую заработать с помощью NFT.Дальше я расскажу  о процессе создания NFT-коллекции, о трудностях, о продвижении, покажу свои расчёты и расскажу о том, как будут дорожать в будущем мои NFT и как я планирую развивать проект. Буду рад и поддержке, и замечаниям, которые помогут мне с проектом.Почему именно NFT?  NFT — Non-Fungible Token или невзаимозаменяемый (уникальный) токен. Простым языком, NFT — сертификат о том, что вы владелец какого-то цифрового объекта, размещенного на блокчейне: картинки, гифки, видео или музыкального трека.За последние годы NFT стали мегапопулярными. Коллекционеры, геймеры, инвесторы и знаменитости вкладывают в них большие деньги. NFT продают на аукционах типа Sotheby’s.Помните мемное видео, где танцуют гробовщики? Его недавно продали как NFT за 1 миллион долларов. А самый первый твит в Twitter ушёл за 3 миллиона.Но самое главное: многие художники и другие творческие люди привлекли инвестиции на развитие своих идей с помощью собственных NFT-проектов.Для меня это тоже отличный шанс заработать на свою идею.Я создал NFT-коллекцию POMPO The Robot. В ней 123 арта. Каждый из них я отрисовал вручную — сначала от руки на бумаге, потом в Illustrator и в After Effect.Вырученные с продажи первой коллекции деньги я планирую вложить:—   в запуск и продвижение второй коллекции из 5555 артов. Она будет генеративной (роботы в этой коллекции будут рандомно сгенерированы из отрисованных вручную деталей) со сложными механиками развития (здесь мы с отцом придумали кое-что революционное. Stay tuned!)—  начну работу над ранним прототипом, на основе которого мы будем строить настоящего боевого робота для шоу BattleBots. Управлять строительством робота будет наше онлайн-сообщество через эти NFT и специально созданное DAO (децентрализованная автономная организация) —   участие в выставке Automation Trade Show и дальнейшее развитие проекта.Поддержать мой проект и записаться в вайтлист можно на сайте POMPO. В будущем именно эти первые токены будут иметь наибольшую ценность.С чего все начиналось  Я начал изучать язык программирования Scratch с 8 лет. Начал с создания небольших мультиков и простых игр по учебникам. В 12 лет в качестве выпускного проекта в 5 классе я придумал и разработал обучающую игру “School Fire” для школьников, которая имитировала пожар в школе и в игровой форме помогала усвоить все основные правила безопасности.JavaScript я начал учить совершенно случайно :) Когда решил создать сервер для Minecraft, которые работают на Java... Я не знал, что Java и JavaScript - это разные языки. Когда я это понял, было поздно, т.к. я уже начал проходить курс по JavaScript.Эта случайность мне потом пригодилась, потому что я увлекся разработкой сайтов, и это стало моим основным инструментом, как frontend-разработчика.Чуть позже у меня появились коммерческие проекты.Посмотреть их можно на моем личном сайте: https://lucker.ninja/Также я учил языки Python, PHP и популярные библиотеки для JS - Jquery, NodeJS. Пробовал себя в написании парсеров и скриптов, закончил еще несколько курсов. В конце прошлого года я заинтересовался криптоиндустрией и NFT. Начал учить язык Solidity, потому что в качестве блокчейна для своего проекта я рассматривал Ethereum. И здесь мне опять пригодилось знание JavaScript, ведь Solidity - это JS подобный язык. Это сильно помогло мне в его понимании.Про роботов!  С детства у меня было очень много Lego. Всего я собрал больше 80 наборов,  а любовь к робототехнике началась с серии Lego Mindstorms. Мне нравится придумывать сложные механизмы, проектировать и собирать их. В 7 классе в качестве выпускной работы я помогал учителю по физике подбирать компоненты и разрабатывать устройство на Arduino, которое совмещало в себе функцию считывания школьных карт и измерения температуры ученика.  В 12 лет я пошел в кружок робототехники под руководством преподавателя Василия Андреевича Кропачева (Москва, школа 1354). Там я научился строить разных роботов, в том числе на Arduino. Несколько раз мы даже строили роботов, чтобы устраивать между ними состязания. Это было мое любимое время в школе!  В то время у меня и появилась задумка, которую я очень хочу реализовать. Я хочу создать настоящего боевого робота и участвовать с ним в шоу-соревновании BattleBots. Это шоу с мировым именем. Один из моих любимых фильмов это “Real Steel”, наверное мое увлечение робототехникой во многом было вдохновлено этим фильмом. Я хочу собрать команду и разработать собственного робота, с которым мы победим в таких соревнованиях.Кстати, если вы начинающий и мечтаете создавать роботов, как я, то могу вас уверить, что на основе Lego можно собрать не только роботов начального уровня, но и достаточно продвинутых. Серия Technic позволяет без использования пайки собирать очень сложные и довольно прочные каркасы. Для дополнительной жесткости иногда в него можно вкручивать болты, а отверстия по всему периметру деталей позволяет делать отличный кабель-менеджмент. Прибавьте к этому Arduino, который будет собирать данные с датчиков и raspberry pi, например, c C++ на борту, который будет управлять вашим роботом и вы получите действительно крутую связку даже для создания очень сложных роботов!На видео под спойлером демонстрирую работу роботов, которых я собирал в классе по робототехнике. Один робот - это робот для игры в футбол, который управляется дистанционно. Второй робот передвигается самостоятельно и управляется несложным интеллектом с датчиками, которые помогают определять препятствия, по аналоги с роботами-пылесосами.       Видео с примерами роботов, которых я умею собиратьBefore you continue to YouTubeconsent.youtube.comBefore you continue to YouTubeconsent.youtube.comЛюбовь к рисованию  Я очень люблю комиксы. У меня целая библиотека комиксов из разных вселенных и аниме. Также у меня есть несколько артбуков по которым я и начал учиться рисовать свои собственные комиксы. Я пробовал рисовать комиксы на разные темы, но больше всего меня увлекло рисование комиксов по вселенной Рик и Морти, это одни из моих любимых персонажей. Начиная с 7 лет я много рисовал и от руки и на планшете. Это были и просто рисунки, и логотипы, и разные рекламные макеты для наших друзей или школьных мероприятий. А еще я рисовал стикеры на продажу, на которых заработал примерно 50 рублей :)В 12 лет я понял, что это очень востребованное увлечение и прошел официальный курс по Photoshop при Бауманском институте. Сам освоил Illustrator и Figma. Сейчас я сфокусировался на создании комиксов по вселенной POMPO и буду визуализировать много историй на эту тему. Некоторые зарисовки для будущих комиксов я уже опубликовал на своем сайте вместе со сценарием. История робота POMPO  В 2019 году я нарисовал первые наброски робота POMPO. Это многофункциональный робот-помощник, который широко использовался людьми во время освоения Марса.Позже люди покинули Марс, а на Земле появились киборги - более социально адаптированные роботы, которые вытеснили POMPO.POMPO остались на Марсе, продолжая свою миссию: колонизировать и обустраивать планету. А киборги тем временем начинали обретать на Земле силу… Участились случаи бунтов и восстаний. Люди стали скучать по POMPO и начали рисовать роботов в образах любимых персонажей в приступе ностальгии.В январе 2020 года я разместил POMPO на Behance и очень удивился: ему присвоили награду “Best Character Design” (лучший дизайн персонажа). POMPO даже попал на главную страницу сообщества. Я советовался с папой: мы вместе обсуждали судьбу POMPO, обменивались идеями, как роботы должны выглядеть, и в какой вселенной они будут жить. Так я создал целый  мир и сценарий, в котором развивались события, связанные с POMPO. Придумали и  множество отдельных историй, которые будут происходить с роботом и его окружением в будущем.  У меня есть идея целой метавселенной - POMPO MetaMars World.Почитать ее можно на моем сайте.Создание Roadmap  Roadmap - это “дорожная карта” проекта, основные обещания создателя своему сообществу. Классный арт с историей и ценностью для держателей NFT будет пользоваться спросом.NFT-коллекции бывают двух видов:Вручную отрисованные артыАвтоматически сгенерированные картинки, объединенные общей концепциейПервое - штучная работа. Рисуются от руки, без применения технологий автогенерации изображения. А вот “генеративки”, как их обычно называют - это целый бизнес. Их создатели зарабатывают большие деньги за счет огромного количества копий и варьирующейся редкости. Если сумеют убедить покупателей, конечно.Я решил, что сначала выпущу небольшую коллекцию из 123 полностью вручную отрисованных артов. Я хочу заработать себе имя в криптосообществе и получить поддержку своей идеи. А потом запущу большую генеративную коллекцию.Обязательная часть проектирования Roadmap - создание Utility.Utility - это “добавочная ценность” для держателей NFT. Это могут быть самые разные вещи: например членство в закрытом клубе, участие в розыгрышах, право голоса или физический “артефакт” для владельца NFT. Я уделяю большое внимание Utility в физическом мире, т.к. мне очень интересна эта тема и в будущем я планирую делать такие NFT-токены, которые будут еще сильнее связаны с физическими объектами и возможностью влиять на них. С самых ранних этапов проекта я закладываю этот мост между физическим и цифровым миром. Я верю, что за этим большое будущее.  Я придумал несколько вариантов Utility.Физические копииКаждый из 123 nft-токенов в моей первой коллекции обеспечен моей реальной работой, нарисованной от руки, которую я отправлю в любую точку мира.Участие в постройке боевого роботаС поддержкой держателей моих NFT я построю настоящего боевого робота. Сообщество будет выбирать, из каких частей робот будет состоять, и что он будет уметь. Весь процесс сборки я буду показывать на видео.Бесплатные NFTКаждый покупатель первой коллекции, записавшийся в вайтлист, получит две NFT из всех моих будущих коллекций!РозыгрышиЯ планирую проводить живые стримы, на которых в режиме реального времени, буду рисовать и анимировать новых роботов, идеи для которых выберет сообщество. Всех нарисованных роботов я буду разыгрывать среди своих первых покупателей.  Как я разбирался с технической частью  Больше всего в понимании языка Solidity и принципа работы смарт-контрактов мне помогла образовательная платформа cryptozombies.io. Это бесплатные уроки в игровой форме, в которых на примере создания своей собственной игры про зомби ты знакомишься со всеми основными этапами, которые примерно проходит создатель NFT-коллекции.Вторым самым полезным источником информации для меня стал youtube-канал Hashlips. Это сборник не только полезных советов, но и готовых решений для создания NFT-коллекций. По большому счету на этом канале можно найти вообще все, что нужно для изучения языка Solidity и понимания принципов создания NFT-токенов. Именно здесь я нашел базовый контракт для своей коллекции. Мне пришлось немного доработать его, я не нашел для себя нужной функции. Но в целом это отличный, проверенный временем контракт, на базе самого популярного стандарта ERC721, который подойдет для большинства. Если будете использовать этот контракт, имейте ввиду, что в нем можно отключить 5% комиссии автору проекта Hashlips. Лично я поддерживаю донаты в пользу авторов, но opensource должен быть действительно open source-ом, правда? :) Я призываю всех быть предельно внимательными, в крипте много мошенников. Часто создатели коллекций не показывают свои лица и делают “пустые” проекты с красивым маркетингом, а потом исчезают не продолжая никакого развития. Коллекционеры теряют свои деньги. Я стараюсь ничего не умалчивать и всегда быть на виду. Ведь я планирую заниматься этим и другими проектами очень долго и дорожу своей будущей Web 3 репутацией. Даже на мою коллекцию появилось уже очень много скама на Opensea. Я постоянно пишу в поддержку, их удаляют, но они очень быстро появляются снова.На тему технической реализации NFT-коллекции можно написать еще много. Некоторые блоки, которые я реализовываю для сайта сам (в том числе приложение для минта, discord-бот и измененный контракт), я выкладываю на своем GitHub.    Немного о том, что я доработал в смарт-контракте HashlipsЯ хотел реализовать  в контракте функцию для минта подарков, которая будет работать только для Owner-а и без каких-либо ограничений на паузу и максимально количество NFT-шек.После создания этой дополнительной функции, и развертывания контракта Hashlips в Rinkeby testnet, я увидел, что в стандартной функции mint уже добавлена такая возможность, и отключено ограничение на минт, но с условием, что контракт не стоит на паузе:if (msg.sender != owner()) {\nrequire(msg.value >= cost * _mintAmount);\n}Мне такой вариант не подходил, т.к. я хочу быть уверен, что пока я буду минтить конкретные NFT, никто не сможет сминтить их вместо меня. Поэтому минт для Owner-а, когда контракт на паузе, я решил  перемещением функцию require(!paused) внутрь условия (msg.value >= cost * _mintAmount); Как я сейчас продвигаюсь  Я долго изучал другие NFT-коллекции. Особое внимание уделял не только тем, кто у всех на слуху. Но и тем, у кого просто хорошие продажи на OpenSea.Все, кому удавалось сделать хорошие продажи — либо везде рекламировались, либо были популярными.У меня пока нет ни денег, ни репутации крутого художника.  Поэтому дорогая  реклама мне сейчас недоступна.Это дичь, но цена за одно размещение может доходить до $25 000 :)Не верите? Вот одно из стандартных предложений от маркетологов, которыми вас начнут забрасывать, как только вы начнете какую-либо активность на этом поле:У меня нет таких денег, поэтому я делаю ставку на открытость. Со всеми, кто приходит ко мне в соцсети, общаюсь лично.Каждый день я выделяю несколько часов на то, что хожу по различным Discord-серверам и зову всех на сервер POMPO.Это работает! Мой Discord постепенно растёт.В Twitter я пытаюсь напрямую достучаться до коллекционеров, у которых не пустые профили на OpenSea. Их очень много! К сожалению, отвечают они редко :( Чаще всего даже не открывают письма. Тем не менее мне удалось получить уже настоящих фанатов своей идеи, я был удивлен, но эти люди не только инвестируют свои деньги в коллекции, но и всячески помогают с продвижением!Готовлю посты на Reddit, обращаюсь в различные СМИ, пишу статьи.Рассчитываю на поддержку авторов известных NFT-коллекций и людей, которые меня вдохновляют. Для этого я создал отдельную серию роботов для коллабораций. Уверен, моя тактика сработает.Многие приходящие в Discord люди очень тепло отзываются о проекте. Им нравится идея POMPO, планы развития проекта и те ценности, которые я несу.А еще мы с отцом провели небольшой партизанский маркетинг на Blockchain-life. Вот так, наверное, выглядит шиллинг коллекции в реальной жизни :) Сначала было немного страшновато, т.к. это был мой первый опыт общения на таком мероприятии, но когда я увидел заинтересованных людей, внимание, улыбки, поддержку и позитив, я понял, что я все сделал правильно. Обменялся большим количеством визиток и получил очень много эмоций и новый опыт. Планы на будущее  Как только я продам вторую коллекцию (генеративную), я начну строить того самого боевого робота.Это очень большая работа на месяцы труда целой команды, она включает в себя множество этапов. От проектирования цифровой версии и выбора стратегии, до тестирования прототипов в реальных условиях боя.Пока же я начну работу над первым прототипом и более глубоким изучением темы  робототехники. В этом мне поможет участие в разных тематических выставках, типа Robotics Summit & Expo. В моем обзоре на Reddit много интересных событий в мире робототехники в 2022 году.Эта коллекция — мой первый шаг в мире Web3. В будущем я соберу команду, с которой мы будем делать новые проекты и развиваться как студия. Например, как Larva Labs — авторы коллекции CryptoPunks.План создания боевого робота  Я уже сделал первый набросок боевого робота и выложил его во всех своих группах (впереди будет ещё много скетчей). В итоге комьюнити, а не я, будет выбирать его окончательный внешний вид и отдельные особенности. Я выделю на это большую часть бюджета, когда продам вторую, генеративную коллекцию.Примерный план действий такой:Сбор команды с опытом сборки боевых или специализированных роботов Выявление слабых / сильных сторон команды с последующим определением боевой стратегии роботаПроектирование цифрового прототипа роботаПоиск помещения в долгосрочное пользование с необходимым оборудованием и условиями для сборки роботаПоиск и изготовление деталей, тестовая сборка первого прототипа роботаИспытания и выявление слабых сторон робота (вес, используемые материалы, потенциально слабые узлы, эффективность боевых инструментов, управляемость)Подготовка деталей и сборка второй версии робота с учетом всех доработокТестовые испытанияТретья боевая версия роботаТестовые испытанияМаркетинг и связи с общественностьюПоездки и участия команды в турнирах и соревнованияхРабота оператора / монтаж контента для блогаПоездки и участия в тематических выставкахЗдесь я выложил очень предварительные расчеты по созданию робота и работы команды. https://mountain-darkness-9e6.notion.site/POMPO-Battle-Bot-3f205d2ed2d44992ac12d387626e8b01В какой-то момент я привлеку инвесторов и начну создание целой метавселенной POMPO MetaMars World, если к тому моменту мы не уйдем в какое-то более узкое направление. Сейчас сложно сказать, как будет развиваться индустрия, одно ясно точно — я здесь надолго, и эти NFT лишь мой первый (но очень важный!) шаг. В отличие от множества анонимных коллекций, я не скрываю свою личность, а значит планирую довести дело до конца и выполнить все обязательства, а своих первых холдеров (владельцев nft) буду радовать всевозможными плюшками в будущих проектах.Послесловие  Я считаю своей миссией — популяризацию науки. В основе множества крутых изобретений лежит робототехника. Своим примером я хочу показать: изучать такие штуки совсем не сложно! И точно пригодится в жизни :)Моя Большая Мечта — помочь человечеству в колонизации Марса. Когда-нибудь я создам реального робота POMPO (это у меня в планах) и, возможно, устроюсь на работу к Илону Маску.Для этого сейчас мне и нужна ваша поддержка. И я благодарен каждому, кто купит NFT из моей первой коллекции. С вашей помощью я продвинусь к исполнению мечты, а у вас на кошельках появятся очень редкие и ценные NFT-шки. Сейчас не хочется спойлерить насчет будущей цены этих NFT, но поверьте, мы придумали несколько очень интересных механик и уверены в светлом будущем нашего флор прайса (базовой цены NFT)Вся информация есть на сайте:17 мая коллекция станет доступна тем, кто оставил заявку в Whitelist.19 мая — старт продаж для всех.Один NFT из коллекции POMPO будет стоить 0.15 ETH.Я сделаю все возможное, чтобы отблагодарить всех, кто меня поддержал.Готовлю разные ништяки :)NFT из первой коллекции будут иметь самую высокую ценность.Те, кто их купит, получат несколько ценных NFT из последующих коллекций бесплатно.А также вы получите физический арт, который можно повесить на стену.Чтобы вписаться в Whitelist:Перейдите на страницу https://pompotherobot.com/mint-page.phpНажмите кнопку Connect wallet и следуйте инструкциям. Часто задаваемые вопросы и о том, как подключить кошелек Metamask вы можете прочитать в специальном разделе у меня на сайте.Спасибо, что дочитали до конца! :)PS Чтобы избежать лишних вопросов сразу скажу, что с данной статьей мне помогал мой папа. Также мы вместе работаем над проектом POMPO и вместе его продвигаем, т.к. в одиночку такой большой проект реализовать невозможно. Об этом я также упоминаю на сайте проекта и везде говорю об этом.    "
    },
    "NFT-мошенники или как не попасть на ИКСуи": {
        "href": "https://habr.com/ru/post/672376/",
        "content": " В этой статье я попытаюсь вкратце рассказать в чем смысл NFT, почему одни люди зарабатывают на них, а другие нет. Я не буду пересказывать ключевые термины и принципы работы, так как по этой теме достаточно много информации в открытом доступе на любом языке, а лишь объясню ключевые моменты, которые необходимо знать, чтобы не стать жертвой очередных мошенников. Я сделаю это на \"своем языке\" и без картинок, кто знает, может так будет понятнее. И-и-и-и, поехали...В чем смысл NFT?Представьте, что Apple объявила о выпуске лимитированной серии  iPhone-ов в количестве 5000 штук по фиксированной цене. Помимо того, что у этих iPhone-ов корпус сделан из адамантия (как когти Росомахи во вселенной Marvel), обладатели этих iPhone-ов могут раз в год посещать офис Apple и трогать Тима Кука, пока он обедает. Естественно, что кто-то захочет приобрести такой iPhone для себя, так как всегда мечтал потрогать Кука, а кто-то закупит таких iPhone-ов, чтобы позже продать кому-то другому.Собственно, весь смысл покупки NFT заключается в двух ключевых моментах:вам нравится то, что дает вам владение этим NFT (уникальность, история, корпус из адамантия, возможность трогать Кука) - в данном случае вы покупаете NFT, даже если его цена всем кажется баснословной (наверняка слышали про продажу картинки камня за 400 тыс. долларов или картинок обезьян  по 200 тысяч долларов)вы знаете что этот NFT будет пользоваться спросом и сможете его перепродать дорожеТо есть NFT - это НЕ ЛЮБАЯ картинка, которую вам предлагают купить. Это картинка, которая либо имеет высокий спрос либо дает вам какие-то эксклюзивные преимущества как владельцу либо вы успели закупиться бит-коинами, когда они стоили меньше доллара за штуку и сейчас не представляют для вас большой ценности.И я могу легко и быстро заработать на NFT и сделать прости господи \"иксы\"?Ну-у-у, не совсем...Небольшое отступление: если какой-то горе-аналитик предлагает вам эксклюзивные услуги по сбору портфеля, да еще оперирует терминами \"заработать на иксах\", \"зайти с большой котлетой\", \"глупые американцы и арабы не знают что такое дроп (ну да, русские же iPhone изобрели, не иначе)\", то сразу гоните его на те самые ИКСуи.Запомните простые правила:Чтобы заработать на перепродаже NFT, нужно чтобы на этот NFT был спрос.Чтобы на NFT был спрос, нужно чтобы вокруг проекта было сообщество.Чтобы у проекта было сообщество, нужно чтобы он был известным или сообщество подхватило его и начало само его \"продавать\" в соц. сетях.То есть, возможность заработать на перепродаже диктуется рынком. Если рынок верит, что цена будет расти, то у вас есть возможность продать, если не верит, то цена резко упадет. Те самые иксы, которые вам все обещают, определяются разницей между покупкой и продажей и интервалом времени, за который цена NFT смогла вырасти до требуемой вами (час, день, месяц, год, никогда...)И тут главное не попасться на разные хитрости, которые советники и аналитики вам будут давать, чтобы вы поскорее променяли свои деньги на ИКСуи.Да не может быть, меня могут обмануть? Вот те на...Вам может показаться это странным, но да. По-этому, ниже ряд простых правил и рекомендаций, которые всегда держите в голове, прежде чем что-то купить для последующей перепродажи (если же покупаете просто потому-что нравится, то ваше право).Правило 1 - 97% всех NFT проектов это мошенникиТак уж вышло, что блокчейн и возможность оставаться анонимным открыли врата в ад и большинство всех проектов это обман. Понять обман проект или нет не так уж и легко, по-этому как минимум не забывайте про озвученные здесь правила, чтобы минимизировать риски быть обманутым.Правило 2 - никогда не следуйте вслепую советам из чатиков, телеграм-каналов и других источников первоклассной экспертизы.Помните, что 97% всех NFT проектов это мошенники?Правило 3 - убедитесь, чтобы NFT-проект имел как минимум два канала связи и большую аудиторию.Если на Binance или OpenSea (площадок на самом деле десятки, но у всех на слуху эти две, по-этому их и озвучу) у проекта нету ссылок как минимум на сайт и твиттер, то скорее всего это мошенники. Причем это даже не профессиональные мошенники, а какие-то кустарные (сайт ведь стоит денег, а твиттер без подписчиков - это не твиттер). Быть обманутым такими - это верх позора.Правило 4 - скептически относитесь к любым обещаниям NFT-проекта.Большинство NFT-проектов будет предлагать вам золотые горы, пассивный доход, мгновенные прости господи иксы, даже вымышленную скидку из серии \"успей купить сейчас, а то ж следующий дроп будет дороже (ой ну спасибо вам за щедрость)\".Запомните: любой NFT проект скажет вам все что угодно, лишь бы вы заплатили. Будет проект это реализовывать или нет - никто не знает. Может ли проект по результатам сбора средств отказаться от своих обещаний - \"каких обещаний?\", \"мы вам ничего и не обещали\", \"вот видите нам не удалось собрать нужную сумму, а вернем вашу только если у вас есть квитанция (нету? ну и нечего тут возмущаться)\", \"Идите вон перепродайте, мы же вам дали возможность сделать ИКСы, а то что вы не продаете дороже - так вы сами и виноваты\".Правило 5 - не тратьте время на WL, если он не обещает бесплатное приобретение NFTМногие NFT-проекты предлагаю так называемый White List. То есть, вы помогаете проекту привлечь больше пользователей (рекламируете его в своих соц. сетях), а вам за это дают возможность приобрести NFT с небольшой скидкой перед официальной датой начала продаж. Если не слышали о таком, то и не нужно, если слышали, то имейте ввиду, что в краткосрочной перспективе у большинства проектов цена корректируется рынком и происходит это в меньшую сторону. То есть, например, вы можете приобрести NFT со скидкой за 100 долларов, а спустя неделю с начала продаж цена такого NFT может быть 5 долларов. Почему так? Потому что рынок так решил и люди в панике стали продавать все с понижением цены, чтобы хотя бы минимизировать потери (кто-то купил за 100 и успел продать за 95 - молодец, а кто-то за 5 - не совсем молодец)Правило 6 - не покупайте NFT на старте продажВ большинстве случаев, на старте продаж цена диктуется продавцом (смотрите правило 5).Коррекция цены происходит в течение 2-5 дней. Да, у вас есть возможность в первые часы заработать те самые иксы, но есть и такая же вероятность потерять вообще все. Мой совет:если NFT не бесплатный, то лучше подождать, проанализировать рынок, доверие к проекту со стороны профессиональных инвесторов (на площадках типа nftinit.com, nftgo.io можно понять как идут продажи и каково доверие к продукту со стороны инвесторов)если NFT достался вам бесплатно, то конечно ловите волну хайпа в первые часы, но имейте ввиду что этим же самым занимаются сотни тысяч други людей, для которых это работа, а не одноразовое событие (ну то есть шансы ваши не велики)Правило 7 - если NFT коллекция изначально раздавалась бесплатно, то не торопитесь  ее покупатьВ некоторых случаях цена определяется вторичной продажей, когда изначально вся NFT коллекция была роздана бесплатно, а в момент публичного старта продаж вы уже имеете дело с ценой, которую пытаются диктовать те самые владельцы подарков. В этом случае очень осторожно играйте в эту игру, держа в голове то, что для тех, кто приобрел NFT бесплатно, они не представляют никакой ценности и в любой момент могут обрушить цену в ноль.Правило 8 - если есть возможность приобрести NFT бесплатно, то делайте этоНекоторые проекты раздают NFT бесплатно на старте продаж. Это может быть сделано как в ограниченном количестве так и целой коллекции. Найти такие проекты довольно легко - идем в твиттер и делаем поиск по хэш-тегу #FreeMint. Важно: соблюдайте правила безопасности (следующее)Правило 9 - следуйте правилам безопасностиВас всегда будут пытаться наебмануть. Чтобы минимизировать свои риски:заведите отдельный браузер для открытия только проверенных ссылок и минтинга NFTзаведите отдельный адрес для минтинга NFT и не держите на нем ценные для вас NFTко всем ссылкам из любых чатов относитесь с подозрениемникогда не открывайте ссылки, которые вам присылают и говорят, что это безопасно и быстро и у вас есть всего 5 минутникогда не открывайте ссылки от контактов, которые выглядят как официальные представители проекта. Официальные представители проекта никогда не пишут никому напрямую (это негласное правило).Правило 10 - никогда не следуйте советам экспертов, которых вы лично не знаетеПомните - вас все всегда будут пытаться обмануть. Эксперт может быть проплаченным или просто мошенником или просто не самым дальновидным.Правило 11 - не ведитесь на успехи другихДа, вы наверняка слышали о 10-ти и 100-кратном увеличении прибыли на перепродаже, да возможно и сами зарабатывали на таких. Или видели картинки в чатиках с успехами других. Но имейте ввиду, что:Никто не мешает мошеннику сделать несколько аккаунтов и перепродавать NFT самому себе, теряя лишь на комиссии сервиса. Для чего? Для той самой красивой картинки в чат, которая окупит его потери парой сотен доверчивых лопушков.Ваш личный успех продажи или успех вашего друга, если он не базируется на профессиональном анализе, скорее всего имеет краткосрочный характер. Например: мошенник перепродал NFT самому себе, сделал красивую картинку и выложил ее в чат или канал на большую аудиторию, что привело к притоку пользователей, которые случайно приобрели вашу NFT.А можно пример мошенников, а то я с трудом представляю как они выглядят?Да, легко. Здесь я приведу один простой пример мошенников на российском рынке, так как скорее всего вы с ними столкнетесь, если начнете вникать в предметную область самостоятельно. На рынках других стран вы легко сможете вычислить мошенников, используя озвученные выше правила. Главное запомните - в 97% случаев вас обманывают, а в 2% случаев - проект не принесет ожидаемую вами прибыль.Собственно пример.Находим телеграм-канал https://t.me/HotSalesNFT и видим, что с виду это некий аналитический ресурс, который публикует какие-то новости из мира NFT и предлагает собрать NFT-портфель за процент от успеха. В целом ничего подозрительного, если бы он не предлагал быстро купить на Binance или OpenSea какие-то NFT и не сопровождал бы это словами \"легко словить иксы\", \"очередной дроп от проекта будущего\", \"зашли с большаой котлетой\", \"будет держать и перепродавать по 10x\", \"глупые арабы не знают что такое дроп\" (знаю, что может показаться смешным, но там действительно просто вся лента забита однотипными фразами с призывами отдать деньги и заработать иксы на очень-очень глюпых иностранцах).Смотрим, что нам предлагает приобрести этот канал:Monkey Hype - https://t.me/HotSalesNFT/1139 (а лучше поиском по названию все посты посмотрите)Есть ссылка на сайт - https://monkeyhype.comЕсть ссылка на коллекцию - https://opensea.io/collection/monkey-hype/activityЕсть ссылки на каналы обратной связи - https://t.me/monkeyhypenft и  https://discord.gg/dBKZuRKBSgЕсть обещание золотых гор и пассивного заработкаЧто необычного:Суммарная аудитория двух каналов обратной связи 3000 человек. Для проекта, который возможно будет генерировать активность и возможность перепродаж, аудитория должна быть не меньше 50-100 тысяч человек с постоянной поддержкой (правило 3).Смотрим активность продаж на OpenSea и убеждаемся что проект мертвый (https://opensea.io/collection/monkey-hype/activity). Да, он набрал какую сумму и был продан, но как мы видим продажи имели спонтанный характер (возможно благодаря рекламе через телеграм-канал?).Ой, а где же перепродажа с иксами, почему первичные продажи были по 49, а вторичные по 18?... Вот те на..Crypto PvP Robots (https://t.me/HotSalesNFT/1644)Есть ссылка на сайт - http://cryptopvprobots.com/Есть ссылка на каналы обратной связи - https://twitter.com/pvprobots и https://discord.com/invite/69GabYTF8dЕсть странное ощущение, что описание проекта очень сильно похоже на Monkey HypeЧто необычного:Суммарная аудитория двух каналов обратной связи 300 человек. Серьезно?PvP Ducks (https://t.me/HotSalesNFT/1667)Есть ссылка на сайт - https://pvpducks.comЕсть ссылка на каналы обратной связи - https://twitter.com/pvpducks (ой, заблокирован, как так вышло) и https://discord.com/invite/vtew5jnzdpЕсть странное ощущение, что описание проекта очень сильно похоже на Monkey HypeЧто необычного:Суммарная аудитория двух каналов обратной связи 300 человек. Серьезно?Вместе с двумя предыдущими проектами обещает интеграцию в некую игру https://metatokens.ggТо есть, если следовать логике этих экспертов, то некая гэмблинг-площадка должна генерировать пассивный доход и распределять его на 30000 токенов при суммарной аудитории всех проектов в 3500 тысячи человек? Ой, а то что токен покупается по 49, а в большинстве случаев продается по 18$, это распределение учитывает или пользователи виноваты, что не продают дороже?SkinChanger (https://t.me/HotSalesNFT/1638)Есть ссылка на сайт - https://skinchanger.comЕсть ссылка на соц. сети - https://twitter.com/xSkinchanger и https://discord.com/invite/JFTt9hRbsXЕсть ссылка на Binance - https://www.binance.com/ru/nft/shopWindow/The-Skinchanger (ой, а куда он пропал, он же верифицированный продавец? вот те на...)Что необычного:Суммарная аудитория двух каналов обратной связи 500 человек. То есть, шкурок продали 6 тысяч, а аудитория 500 человек, это как так?По словам авторов канала, был верифицирован на Binance, но почему-то страница не отображается.SkinDrops (https://t.me/HotSalesNFT/1709)Есть ссылка на Binance - https://www.binance.com/ru/nft/shopWindow/skindrops-c7edd619fe510a6ca903f77c705e5888Больше нету ничегоТак, погодите... куда пропал SkinChanger и почему шкурки теперь продаются как SkinDrops, но без каких-либо отсылок на SkinChanger. Что происходит???В завершениеНе дайте себя обмануть. Внимательно изучайте кто и что вам пытается продать, проверяйте надежность продавца как минимум пройдясь по всем выше озвученным правилам. Не становитесь обезьянками, роботами и утками с раскрашенными картинками пистолетиков ручной работы. Я бы еще добавил, что никогда не связывайтесь с проектами из стран СНГ, но не все такие, можно найти пару процентов и нормальных.   "
    },
    "NFT-токены: новая валюта для спортивных фанатов?": {
        "href": "https://habr.com/ru/company/ligastavok/blog/578270/",
        "content": " Благодаря появлению токенов сегодня почти любой материальный предмет может обрести цифровую форму и получить эффективную защиту от кражи. Их много и они разные: пользовательские, валютные, криптовалютные и др. Обсуждать каждый из этих видов можно долго, предлагаем сделать это в комментах, а мы подробнее остановимся именно на NFT, которые за последние годы набрали рекордно высокую популярность. Что такое NFT-токен, и чем он отличается от других NFT-токен, он же non-fungible token, можно перевести как «невзаимозаменяемый токен». В блокчейне хранится огромное количество различных токенов, цифровых виртуальных единиц — это некий аналог валюты, в ценность которой вкладываются товары, различные услуги и др. Обычно все токены равны и взаимозаменяемы. Это означает, что, если мы захотим заменить один токен другим, ничего не поменяется. NFT-технология работает по-другому: каждый невзаимозаменяемый токен является уникальным, поэтому его нельзя подделать или поменять на другой. Объектом NFT-токенизации может стать любой диджитал-файл: фото, арт, песня и т.д. NFT-токен будет уникален, как и сам объект.  Вы ведь помните, что в мире существует только одна Мона Лиза? Вот и блокчейн позволяет сертифицировать уникальность в цифровом мире, гарантируя подлинность диджитал-файла его будущему покупателю. Мир искусства — самая быстрорастущая сфера, где можно использовать NFT-токены, но не единственная. Например, совсем недавно Эрмитаж выпустил собственные NFT-токены. В лимитированную коллекцию вошли пять картин известных художников – Леонардо да Винчи, Винсента Ван Гога, Василия Кандинского, Джорджоне и Клода Моне. Все копии подписал лично директор музея Михаил Пиотровский (может зря он это сделал?), закрепив всю информацию об уникальности произведений в метаданных.Однако, NFT-токены находят своё применение и в других областях, например, в спортивной сфере. Затокенизированный объект — это то же, что коллекционная спортивная карточка, готовая для передачи: она запакована, её оригинальность подтверждена. Только в случае с NFT для подтверждения уникальности автор должен добавить объект на блокчейн-платформу, чтобы там появилась запись о том, что мы имеем дело с оригиналом. NFT-токены в мире спорта  В конце августа легендарный форвард Лионель Месси представил свою первую официально лицензированную коллекцию NFT на блокчейн-платформе Ethernity в рамках проекта «The Messiverse». Основной темой проекта стали достижения спортсмена и значимые моменты его карьеры. Всего совместно с австралийским художником Bosslogic Месси выпустил три токена «Man From the Future», «Worth the Weight», «The King Piece».  Первый NFT-арт, «Человек из будущего», изображает легендарного нападающего в бионической форме, как бы делая отсылку на кибер-футбольную лигу будущего. Второй токен под названием «Цена на вес золота» изображает легендарного игрока в виде греческого титана Атласа, несущего на себе тяжесть всей планеты. Это изображение является аллегорией профессионализма Месси, забившего более 750 голов, и его значимости как игрока, который несет судьбу товарищей по команде на своих плечах. Последний арт изображает аргентинского форварда в виде короля на шахматной доске, обрамлённого кольцом из футбольных мячей.  NFT в мире киберспорта  В подробностях этой темы мы разбирались вместе с Давидом Даштояном, руководителем коммерческого отдела Gambit Esports & WASD.tv МТС Esports. Кстати, пользуясь случаем, поздравляем наших партнёров, состав Gambit по CS:GO, который признан Командой Года по версии Международной Федерации Киберспорта. Пожалуй, трудно представить лучший симбиоз, чем тот, что возможен между киберспортом и NFT-токенами. Он уже нашёл своё отражение во множестве проектов, реализованных киберспортивными организациями. Так, организатор соревнований BLAST в сотрудничестве с компанией NFT Bondly несколько месяцев назад создал NFT-токены, посвящённые теме куриц, популярной в мире Counter-Strike. У игроков появилась возможность получить доступ к двум командам (Team Red и Team Blue), каждая из которых объединила в себе по три персонажа в виде цыплят. Благодаря геймификации, владелец «куриного» NFT-токена может прокачать своего персонажа и даже смешать несколько скинов с помощью BondSwap.Ещё одним успешным примером использования NFT-токенов в мире киберспорта является кейс команды OG. Киберспортсменам удалось одержать победу в турнирах The International 2018 и 2019 по Dota 2 и получить четыре легендарных кольца чемпионов. По этому случаю в OG решили отрисовать заветные кольца и выпустить их в продажу на платформе Nifty Gateway. Фанаты раскупили все боксы, каждый из которых стоил 199$, всего за несколько часов с начала старта торгов.  Невзаимозаменяемые и неосязаемые  Почему пользователи блокчейн-платформ готовы платить деньги за NFT-токены? Они неосязаемы, их нельзя потрогать и подержать в руках, но люди, словно охваченные лихорадкой, продолжают скупать их.  «Людям всегда хочется обладать чем-то уникальным. Это то же коллекционирование почтовых марок, но уже на другом уровне» — считает Давид Даштоян.  Именно по этой причине бешеную популярность приобрела игра CryptoKitties, в которой пользователям была доступна возможность коллекционировать... котов, каждый из которых был связан с уникальным токеном.О других причинах популярности NFT мы поговорили с Эммануэлем Риго, французским исследователем технологии блокчейна. Одна из них — возможность зарабатывать на невзаимозаменяемых токенах, как в случае с игрой SORARE. Платформа с регулярной частотой выпускает в продажу футбольные карточки. Коллекционируя их, игроки могут участвовать в турнирах и выигрывать более ценные и редкие карты. Каждая из них является цифровым активом, который официально лицензирован футбольным клубом: Ювентусом, Шальке, Вест Хэм и другими.«Многие NFT от разных компаний были выпущены с единственной целью — получения прибыли. Наша цель состоит в том, чтобы все без исключения NFT, которые мы выпускаем, со временем росли в цене. Наша приверженность миру NFT проистекает из нашей глубокой веры в его растущие возможности» — комментарий Карлоса Родригеса, основателя G2 Esports.Другой причиной популярности невзаимозаменяемых токенов, как отмечает Эммануэль Риго, является фанатская любовь.  «С приходом NFT-токенов на рынок игровой индустрии я вижу, как сильно поменялось киберспортивное сообщество, а точнее, коммуникации внутри него. По сути, команды вышли на новый уровень общения со своими фанатами, а те, в свою очередь, смогли подобраться ещё ближе к своим героям». Кроме того, у команд появилась прекрасная возможность увековечить самые яркие и значимые игровые моменты в своей карьеры, но, что ещё более важно, почувствовать финансовую независимость. Сегодня киберспортивные команды всё ещё сильно зависимы от спонсорских доходов. И если в США, одной из статей доходов команды являются продажи мерча, то в России, спонсорские доходы являются чуть ли не единственным источником финансирования, и 90% всех призовых с турниров забирают игроки, а не организации, как отмечает Давид Даштоян. NFT-токены в этом плане представляют по-настоящему потрясающий способ заработка с помощью прямых продаж. Контент-креаторы могут напрямую создавать токены и продавать их своей аудитории, ориентируясь исключительно на её интересы — и становится ещё ближе к ней.  Что ждёт NFT-токены в будущем?  Мы не знаем. Несмотря на бешеную популярность невзаимозаменяемых токенов сегодня, пока всё ещё рано судить о том, что ждёт их в будущем. Они способны решить одну из ключевых проблем цифровой среды — пиратство и мошенничество. В этом убеждён и Максим Мамонтов, скаут по инновациям в Лиге Ставок, который видит в этом плане огромный потенциал в NFT-токенах. Однако, людям пока трудно понять концепт, а отсутствие законодательного регулирования этой сферы накладывает свои ограничения на деятельность аукционных домов и участников NFT-рынка. Вероятно, интерес к токенам ещё долго не будет угасать. Если у вас есть NFT-токены, делитесь в комментариях, почему вы решили их приобрести или создать (а вдруг).     Только зарегистрированные пользователи могут участвовать в опросе. Войдите, пожалуйста. NFT-токены — это… \n            3.23%\n           Хороший вариант инвестиций \n            1\n           \n            74.19%\n           Не более, чем развлечение для фанатов \n            23\n           \n            22.58%\n           Что-то непонятное \n            7\n            \n       Проголосовал 31 пользователь. \n\n       Воздержались 2 пользователя. \n    "
    },
    "Цифровая трансформация на основе NFT": {
        "href": "https://habr.com/ru/company/southbridge/blog/693048/",
        "content": " NFT – это объект данных в блокчейне. Алексей Муравьев, блокчейн-инженер Института Коллективного Разума, рассказал об эволюции NFT и его применениях для бизнеса.Это просто картинки?Находясь в крипто-индустрии с 2016 года на позиции блокчейн-инженера, я только в 2020 году впервые услышал термин NFT в СМИ. Им обозначалось право владения цифровым изображением, которое продавалось на аукционе.После исследования вопроса по существу для меня, как для инженера, стало всё понятно. Оказалось, я уже несколько лет проектирую и разрабатываю сложные NFT-комплексы для сообществ и бизнеса, но не знаю об этом. Да будет так!То, что подавалось в СМИ как «новое применение технологии блокчейн», являлось примитивной реализацией хранилища информации в цепочке блоков, с которой можно было совершать ограниченный набор действий — выпустить, купить, продать, передать и всё такое прочее.«Кто-то за всё заплатит», — подумал я тогда, так и получилось.Первые измеримые торги NFT-картинками в блокчейне на OpenSea прошли в 2018 году, а сегодня объём торгов упал более, чем в 18 раз, что говорит — хайп завершён.Источник: https://dune.com/rchen8/openseaНикому не нужны просто картинки.Картинки, пусть даже и красивые — не более, чем картинки. Они не вовлечены в реальную экономическую деятельность, не производят товаров с добавленной стоимостью и никак не участвуют в оптимизации производственных цепочек — они бес-по-лез-ны.Но при всей своей бесполезности они были необходимы как переходный этап к следующим стадиям цифровой трансформации Земли. Опишу те стадии, которые видны для меня. Надеюсь, они будут полезны для расширения вашего кругозора о технологии блокчейн и NFT.NFT 1.0 — ссылки на картинкиИтак, как уже говорили, NFT 1.0 — это простейшая запись в блокчейне, которая хранит цифровое описание объекта права собственности. Объектом обычно является картинка, которую продают на аукционах за большие деньги.Технически в блокчейн сохраняется ссылка на картинку, а не сама картинка. Картинка при этом находится в стороннем хранилище, которое может перестать работать независимо от блокчейна, и тогда вы потеряете то, чем владеете. Странное владение, да? Неполноценное, какое-то.И чем же вы реально владеете, покупая NFT на openSEA?Вы владеете NFT-записью в блокчейне, которая ссылается на вашу картинку в стороннем сервисе, которую каждый желающий может скопировать и разместить где угодно, и ничто ему не может помешать. При этом вы даже не можете уничтожить свою картинку во внешнем хранилище, если вы этого захотите.NFT 2.0 — токены для бизнесаNFT 2.0 — это токены, на которых строится или укрепляется бизнес. Первыми в развитие и применение этого типа токена пошли производители игр, некоторые известны как Axie Infinity или STEPN. Они и им подобные строят свой цифровой бизнес на блокчейне и NFT-токенах.Теперь люди покупают игровых персонажей и инвентарь в виде NFT-токенов, которые закрепляются за их ключами доступа и предоставляют игровые преференции. Преференции определяются игровой и бизнес-логикой приложения.Эти игры созданы для особой категории целевой аудитории, которая, по-крайней мере, знает, что такое крипта на практике, а таких людей очень немного на сегодня. И вот здесь мы встречаем главное сдерживающее ограничение применения NFT для массового бизнеса:все действия всех игроков - платные, и каждому игроку необходимо иметь начальный ресурс и специальные навыки для того, чтобы начать играть.В связи с этим, блокчейн ETH не применим для массового бизнеса, а общее решение проблемы звучит так:каждому бизнесу — по блокчейну.Сегодня в мире существуют блокчейны из «коробки» с бесплатными транзакциями, которые предоставляют целостный и защищенный криптографической безопасностью контур программного обеспечения для вашего бизнеса (например, операционная система EOSIO).При внедрении блокчейна в реальные бизнес-процессы, проявляется масса применений NFT-токенов. Подсветим некоторые из них:Расширенные программы лояльности. Расширенные программы лояльности способны произвести трансформацию клиентов бизнеса – в сообщество бренда за счёт перенаправления части выручки компании на общие и персональные нужды клиентов в форме игры.Таким расширением может стать касса взаимопомощи на баллах лояльности, когда участники по очереди могут отовариваться на крупные суммы, и чем быстрее они двигаются в своей очереди, тем более активны и полезны они для бренда.Внедрение таких программ лояльности проявит новых лидеров отраслей в глазах людей. Такие компании станут пионерами цифровой трансформации и своим примером покажут зачем NFT (да и блокчейн) для бизнеса и людей.Корпоративная игрофикация. Крупные компании введут в использование цифровые доски почёта, выдавая сотрудникам знаки отличия и премии с учётом мнения каждого сотрудника о влиянии каждого сотрудника на достижение целей компании в соответствии с её ценностями.Каждый знак отличия на доске почёта — это NFT, который несёт в себе очки, учитываемые при прозрачном распределении премий в конце производственного периода. Чем больше значков у сотрудника и чем выше их качество — тем больше премий получит он. Так, сам процесс премирования становится направлен на поддержание соответствия сотрудников ценностям компании, а сотрудники осознают, за что конкретно их премируют и в каком размере, благодаря чему — стремятся соответствовать.Легенды бренда. Бренды, которые создадут своих персонажей и истории развития из настоящего в светлое будущее получат лояльное сообщество людей для продвижения своих интересов на полях конкуренции.История развития бренда — это NFT, которую участники наполняют своим вниманием, ощущая свою причастность к легенде. Клиент теперь не просто клиент – он игрок в вашей игре. А правила игры создаёте вы.Сделайте жизнь клиента интересней, познакомив его с другими участниками вашей легенды в форме игры, и он будет благодарен вам. Будьте ближе к клиенту, используйте новый слой коммуникации с ним через NFT. Создание интеллектуальных продуктов. При коллективном создании информационных продуктов методом краудсорсинга вклад каждого участника может быть зарегистрирован в блокчейне как интеллектуальная собственность.Совершая интеллектуальное действие, участник создает NFT-объект интеллектуальной собственности и регистрирует его в блокчейне за собой. Объекты представляют собой отчёты о выполненных действиях с отметкой затраченного времени, требуемой квалификации и оценок качества взаимодействия с другими участниками (см. бирюзовые организации).Продуктом интеллектуальной собственности является NFT-токен, который участвуют в распределении учётных единиц вкладов по завершению производственного цикла (день, неделя, месяц, …), а на токен начисляются премии, определяемые природой деятельности группы людей. Если группа внутрикорпоративная, то на учётные единицы вкладов начисляется фиксированный объём довольствия (денег :)), определяемый руководством. Так в компании появляется «бирюзовый» отдел, в котором поощряется творчество и живая энергия взаимодействия людей. Если группа экосистемная, т.е. конечным продуктом её деятельности является сам блокчейн, в котором и происходит регистрация интеллектуальной собственности, то на учётные единицы вкладов начисляется % от оборота цифровой экономики системы. Мы применяем такую систему у себя в Институте. Так внутри корпоративной структуры возникает творческая энергия и жизнь, которая вовлекает скрытые ресурсы сотрудников в деятельность, мотивируя их проявляться как лидеры в деле и друзья друг другу. Массовые DAO. DAO — это группа людей с общей цифровой копилкой, договорившихся использовать её совместно, и путь, который они прошли. Большинство творческих кружков, спортивных секций, школ, колледжей, институтов и университетов могут быть преобразованы в DAO самими участниками.Например, туристический кружок может определять цифровым голосованием следующую экспедицию и собирать средства на неё через NFT, повышая силу голоса тем, кто вносит наибольший вклад в её подготовку и наиболее отзывчив в помощи новичкам.Школы могут создавать дополнительные программы обучения в цифровом мире, задействовав которые, ученик продвигается по структуре DAO, получая знания, статусы и преференции среди других учеников в форме игры. Преференции могут быть обменены на реальные деньги родителей, которые символически вносятся в течении года и распределяются среди лучших учеников дополнительных программ по завершению четверти/полугодия/года.Представим себе, как ученик средней школы решает дифференциальное уравнение, и делает он это потому, что ему интересно (есть склонность), а для себя он играет в весёлую игру, за которую ему платят и в которой он зарабатывает социальный статус среди других учеников за всё время существования школьного DAO. Очевидно, что при таком подходе мы получим массу новых Эйнштейнов и Бетховенов прямо со школьной скамьи всего за несколько лет. Дети любят игры – так пусть играют в полезные.NFT 3.0 — токены для душиNFT 3.0 — токены качеств души человека, которые порождаются при взаимодействии людей друг с другом. Токены души описывают качества человека на основе систем типирования, сведенных к простым пост-коммуникационным вопросам между людьми и в процессе их деятельности:этот человек — нравится тебе? (по шкале от 0 до 10)этот человек  — профессионал? (по шкале от 0 до 10)этот человек — хороший слушатель? (по шкале от 0 до 10)этот человек — генератор идей? (по шкале от 0 до 10)этот человек — деятельный? ( по шкале от 0 до 10)и т.д. и т.п. Вопросы выше взяты с потолка, задавать их не все сразу и не каждому человеку, а по одному и только то, что нужно ИИ для создания профилей.При наличии больших данных о коммуникациях и деятельности людей, возможно небольшим количеством вопросов к каждому человеку составить сначала грубый, а затем и точный портрет всех тех, с кем он коммуницирует, и его самого.А на основе полученного портрета выпускать NFT-токены, характеризующие качества его души, что представляет человеку объективную, живую информацию из внешнего мира о самом себе. Это позволит раскрыть и усилить человеческий потенциал за счёт синергии людей в малых группах и синергии этих групп. К этому этапу цифровой трансформации Земли нам ещё предстоит подготовиться.Многие хотят погрузиться в мир NFT и понять применение этой технологии для себя, но не все знают с чего начать, где найти компетентные ответы и как не попасть на мошенников.NFT, блокчейн, крипта непросты для понимания, но при этом эксперты в этой сфере сейчас востребованы как никогда. Из-за дефицита специалистов на рынке каждый из них на вес золота. Стань им и ты.Мы сделали всё для того, чтобы это погружение прошло комфортно для всех: бизнес, разработчики, творческие специалисты. Даже в тяжёлые времена не стоит прекращать саморазвитие, поэтому приглашаем вас на серию воркшопов для тех, кто хочет разобраться и найти себя в новой сфере.Записаться на воркшопы по ссылке: https://slurm.club/3MmJZ3Z   "
    },
    "NFT — это пирамида, и люди уже теряют на ней деньги": {
        "href": "https://habr.com/ru/company/vdsina/blog/553850/",
        "content": " \r\nФотографы, создатели фильмов и цифровые художники из кожи вон лезут, чеканя NFT в попытке по-быстрому разбогатеть, но на самом деле только способствуют перетоку денег от творцов к технологическим миллиардерам. Почему так много людей купилось на идею о том, что нечто является ценностью просто потому, что все так говорят?\n\r\nЕсли вы ещё не создали свой первый NFT и вам интересно, как это работает, то вкратце процесс выглядит так: вы заводите кошелёк, покупаете немного Ethereum и выбираете платформу. Затем берёте одно из своих цифровых творений и платите примерно 70-100 долларов, чтобы «отчеканить» это произведение в Non-Fungible Token (невзаимозаменяемый токен). Выбираете начальную цену и ждёте, когда начнут поступать ставки. Можно даже подготовиться к аукциону, чтобы создать ажиотаж.\n\r\nОдно из самых удобных мест для начала работы с NFT — это сайт Rarible, который сбивает с толку своей криптоэстетикой, созданной из кошмарной смеси случайности и мемов. Сайт выглядит как ужасающий гибрид детских мультиков и 4chan.\n\n\r\nЕсли вы один из фанатов технологии или у вас есть друзья, любящие быть на острие прогресса, то, возможно, вы получите приглашение на платформу наподобие Foundation.app. Подобные сайты создают определённый уровень эксклюзивности, они обеспечивают фильтрацию, гарантирующую, что перевести свои работы в NFT сможет только ограниченный круг людей. Если вы не знаете никого с инвайтом, то придётся отправиться в специальный канал на Discord-сервере Foundation и вежливо его попросить; учтите, что канал осаждают люди с синдромом упущенной выгоды (FOMO, Fear of missing out), поэтому просьбы об инвайтах появляются каждые 30 секунд.\n\n\n\r\nНа Foundation.app вам понадобится приглашение. На Nifty Gateway нужно будет загрузить видео, дающее владельцам сайта понять, что вы достаточно ценны, чтобы разрешить вам продавать на нём свои работы.\n\r\nКакую бы платформу вы ни выбрали, вам не удастся проигнорировать тот факт, что многие люди продают кучу цифровых произведений сомнительного качества за абсурдно большие суммы. Это очень сильно мотивирует тоже заняться подобным.\n\r\nМотивация — настолько неотъемлемая часть этих платформ, что многие из продаваемых произведений отражают это в своей эстетике. Творения с буквами FOMO повсеместно встречаются в этом море стремления покупать, продавать и быть проданным. Это чувство, что ты опаздываешь попасть на борт, быть началом чего-то нового, является фундаментом всего, что связано с NFT, и это настоящий маркетинговый шедевр. Почти каждый твит, сообщающий об аукционе, в котором тебе нужно участвовать, напоминает, что художественное произведение будет продаваться только в течение краткого периода времени. Синдром FOMO настолько мощен, что вы начнёте ощущать, что уже теряете деньги, так как всё ещё не зарегистрировались.\n\n\nЛучшие продавцы на Rarible.com за последние 24 часа. 60,15ETH на момент написания стоили чуть больше 100 000 долларов.\n\r\nТокены NFT обеспечивают новый способ владения и восхитительную возможность продавать всевозможные художественные произведения. Как концепция они обладают привлекательными аспектами, например, при создании токена можно указать комиссионные, которые вы будете получать каждый раз, когда он будет продаваться в будущем (обычно около 10%). Криптовалюты предлагают альтернативу экономической системе, управляемой банкирами с Уолл-стрит, политиками и инсайдерскими сделками, обещая в определённой степени демократизировать экономические структуры, повысив свободу и гибкость. Этот новый бунтарский образ мышления также влияет на создаваемые произведения, которые кажутся бесконечным празднованием того, как новая система перераспределит власть.\n\nОчарованная публика\r\nДля многих это выглядит как способ разрушения существующего режима; но если приглядеться, то можно понять, что это просто крайнее проявление неолиберализма. Вместо того, чтобы убеждать вас покупать объекты, которые вам не нужны, вас убеждают покупать воображаемый оптимизм, основанный на всеобщем восхищении. Кроме того, наше поколение имеет убеждение в том, что каждый из нас особенный, а значит наше творчество должно обладать прирождённой ценностью; NFT — это наш шанс продать его.\n\n\nОдин из аукционов Foundation.app на момент написания статьи.\n\r\nТакая риторика убедительна, но временами выглядит немного наивной. Как-то я наткнулся на заявление, сопровождающее предстоящий «дроп» (т.е. начало аукциона), написанное одним довольно известным цифровым художником. Он, как и многие другие NFT-творцы, связывает концепцию NFT с самим произведением. Вот как он описал свою анимацию футуристичного персонажа и его летающего автомобиля: «NFT — это боевой призыв для творцов. Призыв исследовать, мечтать, врываться в мир, где наши одиночные мечты становятся коллективной реальностью». Он добавляет: «Коллекционирование и создание NFT — это не акт неповиновения, а посвящение историческому моменту движения, меняющего наши жизни».\n\r\nНе думаю, что нечто может быть более «мета», чем симулируемое владение цифровой копией художественного произведения, описывающего себя как посвящение историческому моменту культурно-экономического движения. А ещё автор заявления «забывает» о том, что платформами владеют такие миллионеры, как близнецы Уинклвосс, известные судебным иском против Марка Цукерберга за кражу их идеи Facebook.\n\nОх уж этот FOMO\n\r\n«Покупайте, продавайте и открывайте для себя редкие цифровые товары», — так гласит слоган OpenSea.io. Если вам стало интересно, как цифровой объект может быть редким, то вы задаёте правильный вопрос. В прошлом веке философ Вальтер Беньямин исследовал вопрос связи подлинности искусства с его уникальностью, а также проблему дисбаланса, вызванного фотографией и механическим воспроизведением произведений. Не знаю, что бы Беньямин сказал об NFT, но этот конфликт между нашей любовью к подлинности и неспособностью виртуального мира предоставить альтернативу не разрешается владением токенами сомнительного происхождения. Цифровая редкость — это притворство.\n\r\nОбщество становится менее физическим и более виртуальным, поэтому нет никакого совпадения в том, что NFT получили популярность в то время, когда наши социальные взаимодействия стали минимально ощутимыми. Кроме того, творческие индустрии сейчас играют значительную роль в экономике крупных стран, и тем не менее, несмотря на предполагаемую ценность вклада художников, их занятость в значительной степени нестабильна (что в глазах общества сделали привлекательной чертой), поэтому для заработка им часто приходится выполнять обычный монотонный труд. Морковка, которой манит людей NFT, невероятно привлекательна: давайте все будем продавать что-нибудь виртуально, чтобы мы могли коллективно притвориться, что теперь этим владеет кто-то другой.\n\nИскусство воображаемой ценности\n\nОдин из товаров на Foundation.app\n\r\nЗадача рынка произведений искусства всегда заключалась в том, чтобы убедить достаточное количество людей в ценности творений. Кроме того, он был теневой банковской системой, упрощающей перемещение крупных сумм денег через границы или сокрытие их от налоговиков. Ценность произведений, продаваемых сегодня как NFT, возникла благодаря маркетингу, FOMO и массовому притоку ничего не подозревающих продавцов и покупателей, с готовностью следующих за знаменитостями и крупными брэндами. Через эту систему отмываются деньги, и как пузырь она неустойчива.\n\r\nЧего мы не видим среди всех этих блестящих веб-сайтов и прекрасных работ, так это огромного объёма выпущенных произведений, которые не продаются. Продажа NFT не сильно отличается от продажи принта: её намного проще осуществить, если у вас есть восхищённая армия фанатов, готовых поделиться своими деньгами, а в случае с NFT это ещё проще, если эти фанаты уже являются техногиками. Если вы цифровой художник с большим количеством поклонников, то вы сможете добиться успеха, и вам будет на руку, если вы активно продвигаете криптоэстетику. Это скромное меньшинство продавцов; подавляющее большинство только теряет деньги, потому что выпуск токенов небесплатен, и будьте уверены, кто-то делает на этом неплохую прибыль.\n\nЭто не совсем обмен произведениями\n\r\nЯ уже собирался отчеканить свой первый продукт, но потом осознал, что выставить его на Rarible.com будет дороже, чем 70 долларов. Многие считают, что высокие цены на «газ» означают, что Ethereum как валюта не подходит для этой цели.\n\r\nБудучи дружелюбными, поддерживающими людьми, художники мотивируют своих коллег покупать произведения друг друга, спасая их эго и внушая чувство того, что потраченные на газ деньги не были выброшены впустую. Однако даже если не учитывать стоимость газа, большинство платформ добавляет 3% комиссионных к сумме, выплачиваемой покупателем, а затем берёт долю в 15% от того, что получает продавец: этот щедрый, поддерживающий акт покупки друг у друга произведений искусства становится просто средством набивания карманов миллионеров, создавших платформы. Художникам гораздо лучше было бы просто отправлять друг другу чеки, постить фотографии чеков в социальных сетях, а затем просто оставлять эти чеки у себя, не обналичивая.\n\nОгромный вред окружающей среде\r\nМногие художники закрывают глаза на огромный углеродный след NFT. Одна художница, озабоченная сохранением окружающей среды, к своему ужасу выяснила, что чеканка шести её токенов оставила такой же след, как работа её студии в течение двух лет. Точные цифры реального воздействия NFT активно обсуждаются (однако платформы, разумеется, отказываются в этом участвовать), однако любые разговоры о подобном рынке без упоминания потенциального вреда окружающей среде являются совершенно безответственными.\n\nЕсли есть победители, то есть и побеждённые\n\nЕсли вы не знаете, что покупаете, то не тратьте на это 6 600 долларов.\n\r\nНа поверхности рынку NFT придали такой вид, как будто там все делают деньги, но хотя крипта и в самом деле может переписывать законы экономики, одно остаётся неизбежным: если кто-то делает деньги, то кто-то другой должен их терять. NFT не могут волшебным образом генерировать богатство из ниоткуда; они делают их на тех, кто купился на идею быстрого дохода для пришедших на рынок первыми. Как объясняет автор книги Attack of the 50 Foot Blockchain Дэвид Джерард, «NFTs полностью рассчитаны на выгоду криптоаферистов. Единственная цель, которой служат художники — быть восторженными простофилями, „накачивающими“ концепцию крипто. И, разумеется, покупать криптовалюту для оплаты „чеканки“ NFT».\n\r\nСо временем такая «накачка» истощится, ведь количество людей, желающих вбрасывать деньги в Ethereum и NFT, начнёт уменьшаться. Учитывая то, что эта система зависит от постоянного роста, можно с уверенностью сказать, что ценность «редких» товаров начнёт падать, а бесчисленные вкладчики, потратившие тысячи долларов на картинки с щеночком в низком разрешении, могут захотеть вывести свои деньги прежде, чем система полностью развалится. А что ещё можно сделать с этим щенком? Распечатать и повесить в туалете?\n\r\nВероятно, ценам на продажу даже необязательно оставаться постоянными. Им достаточно перестать расти так стремительно и внезапно, тогда более безопасным вариантом будет хранение долларов в банке, чем Ethereum в кошельке, где его цена может колебаться за день в пределах 20%. После того, как уверенность инвесторов даст трещину, коллапс случится довольно быстро.\n\r\nEthereum растёт в цене, когда люди продолжают покупать Ethereum, и такое симулируемое владение якобы редкими цифровыми ресурсами является сфабрикованным спросом. Криптовалютам отчаянно нужно найти причину, по которой люди должны менять свои доллары на ещё чуть более виртуальную денежную систему, и пока самым актуальным решением являются NFT. Когда оно достигнет точки насыщения, рынок подстроится под ситуацию, и может возникнуть хаос.\n\r\nЭтот пузырь лопнет; вопрос только в том, когда это случится.\n\n\nНа правах рекламы\r\nVDSina предлагает VDS с посуточной оплатой, возможностью установить любую операционную систему, каждый сервер подключён к интернет-каналу в 500 Мегабит и бесплатно защищён от DDoS-атак! \n\n   "
    },
    "Как я сделал коллекцию NFT на своей «machine», и быстро выложил на opensea.io": {
        "href": "https://habr.com/ru/post/673452/",
        "content": "  Привет, Хабр.  Пару месяцев назад мой товарищ предложил создать коллекцию NFT и загрузить  на opensea.io, идея мне показалась интересной и …   Задача:сгенерировать 10k уникальных изображений (1500X1500 px)  автоматически выложить их на сайт  opensea.io Итак: 1. Немного профильтровав интернет (candy-machine и пр.) я решил что лучше и проще написать самому.  среда - IntelliJ IDEA , KOTLIN.Суть понятна : есть слои, которые нужно рандомно выбирая накладывать друг на друга.Сколько нужно слоёв для 10k уникальных (не повторяющихся) изображений?  Из теории вероятностей я припоминаю, что будет  «пересечение» с высокой вероятностью из выборки  вариантов в 30 раз больше — т.е. из 300k.    Быстренько на  Inkscape я сделал «корову» (в детстве это рисовали), без претензии на «искусство»  (ибо художественных дарований не имею, и это всё-таки тест) - 20 картинок фон, и 11 слоёв по 7 картинок  = 20*7^11= 39546534860 вариантов )) более чем достаточно для уникальности. Приводить картинки и описывать подробно смысла не вижу.Теперь  код.  Создаём массивы, считываем и загружаем в них файлы картинокimport java.awt.Color\nimport java.awt.image.BufferedImage\nimport java.io.File\nimport javax.imageio.ImageIO\nimport kotlin.random.Random\n\nfun main() {\n\n    val sloj0 = arrayOfNulls<BufferedImage>(99);val sloj1 = arrayOfNulls<BufferedImage>(99); val sloj2 = arrayOfNulls<BufferedImage>(99)\n    val sloj3 = arrayOfNulls<BufferedImage>(99) ;   val sloj4 = arrayOfNulls<BufferedImage>(99) ;  val sloj5 = arrayOfNulls<BufferedImage>(99)\n    val sloj6 = arrayOfNulls<BufferedImage>(99) ;   val sloj7 = arrayOfNulls<BufferedImage>(99) ;  val sloj8 = arrayOfNulls<BufferedImage>(99)\n    val sloj9 = arrayOfNulls<BufferedImage>(99) ;   val sloj10 = arrayOfNulls<BufferedImage>(99) ;  val sloj11 = arrayOfNulls<BufferedImage>(99)\n    // файлы изображений\n    val file01 = File(\"D:\\\\NFT\\\\0\\\\1.png\"); val file02 = File(\"D:\\\\NFT\\\\0\\\\2.png\"); val file03 = File(\"D:\\\\NFT\\\\0\\\\3.png\"); val file04 = File(\"D:\\\\NFT\\\\0\\\\4.png\");\n    val file05 = File(\"D:\\\\NFT\\\\0\\\\5.png\"); val file06 = File(\"D:\\\\NFT\\\\0\\\\6.png\"); val file07 = File(\"D:\\\\NFT\\\\0\\\\7.png\"); val file08 = File(\"D:\\\\NFT\\\\0\\\\8.png\");\n    val file09 = File(\"D:\\\\NFT\\\\0\\\\9.png\"); val file010 = File(\"D:\\\\NFT\\\\0\\\\10.png\");\n    val file011 = File(\"D:\\\\NFT\\\\0\\\\11.png\"); val file012 = File(\"D:\\\\NFT\\\\0\\\\12.png\"); val file013 = File(\"D:\\\\NFT\\\\0\\\\13.png\"); val file014 = File(\"D:\\\\NFT\\\\0\\\\14.png\");\n  ..................\n    val file111 = File(\"D:\\\\NFT\\\\11\\\\1.png\"); val file112 = File(\"D:\\\\NFT\\\\11\\\\2.png\"); val file113 = File(\"D:\\\\NFT\\\\11\\\\3.png\"); val file114 = File(\"D:\\\\NFT\\\\11\\\\4.png\");\n    val file115 = File(\"D:\\\\NFT\\\\11\\\\5.png\"); val file116 = File(\"D:\\\\NFT\\\\11\\\\6.png\"); val file117 = File(\"D:\\\\NFT\\\\11\\\\7.png\");\n\n//  в массивы\n    sloj0 [1]= ImageIO.read(file01);sloj0 [2]= ImageIO.read(file02);sloj0 [3]= ImageIO.read(file03);sloj0 [4]= ImageIO.read(file04);sloj0 [5]= ImageIO.read(file05);\n    sloj0 [6]= ImageIO.read(file06);sloj0 [7]= ImageIO.read(file07); sloj0 [8]= ImageIO.read(file08);sloj0 [9]= ImageIO.read(file09); sloj0 [10]= ImageIO.read(file010);\n    sloj0 [11]= ImageIO.read(file011);sloj0 [12]= ImageIO.read(file012);sloj0 [13]= ImageIO.read(file013);sloj0 [14]= ImageIO.read(file014);sloj0 [15]= ImageIO.read(file015);\n    sloj0 [16]= ImageIO.read(file06);sloj0 [17]= ImageIO.read(file017);sloj0 [18]= ImageIO.read(file018);sloj0 [19]= ImageIO.read(file019); sloj0 [20]= ImageIO.read(file020);\n.....................\n    sloj11 [1]= ImageIO.read(file111);sloj11 [2]= ImageIO.read(file112);sloj11 [3]= ImageIO.read(file113);sloj11 [4]= ImageIO.read(file114);sloj11 [5]= ImageIO.read(file115);\n    sloj11 [6]= ImageIO.read(file116);sloj11 [7]= ImageIO.read(file117);\nСоздаем пустое изображение размером 1500Х1500 пикселей: val width1 = 1500\n val height1 = 1500\n\nval resultPng1 = BufferedImage(width1, height1, BufferedImage.TYPE_INT_RGB)\n\n Начало цикла (10000 картинок) и перенос фона (рандомный выбор из 20):for (x1 in 1..10000) {\n// перенос фона\nvar  go0 = Random.nextInt(1, 20)\nfor (x in 0 until 1500) {\n    for (y in 0 until 1500) {\n sloj0 [go0]?.let { Color(it.getRGB(x, y)).getRGB() }?.let { resultPng1.setRGB(x, y, i}t) }\n    }\n} 1 слой (рандомный выбор из 7):// 1 слой\nvar  go1 = Random.nextInt(1, 7)\nfor (x in 0 until 1500) {\n    for (y in 0 until 1500) {\n        // цвет текущего пикселя\n        val color1 = sloj1 [go1] .let { it?.let { it1 -> Color(it1.getRGB(x, y)) } }\n        // каналы этого цвета\n        val red1: Int? = color1?.getRed()\n        val green1: Int? = color1?.getGreen()\n        val blue1: Int? = color1?.getBlue()\n\n        val grey1 = ((green1?.plus(blue1!!))?.plus(red1!!))\n       if (grey1 != null) {\n             if( grey1>0) {\n\n           //устанавливаем этот цвет в текущий пиксель результирующего изображения\n    sloj1 [go1]?.let { Color(it.getRGB(x, y)).getRGB() }?.let { resultPng1.setRGB(x, y, it) }\n            }\n      }\n    }\n}Тут есть момент. Поскольку при преобразовании прозрачный «цвет» будет как RGB(0,0,0) черный,  его исключаем при наложении слоя. Можно, конечно было бы что-то при думать с переносом (0,0,0) но проще его просто не использовать, разницы между (0,0,0) и (1,1,1)  никто не увидит. Дальше аналогично.Путь, полное имя результирующего файла и сохраняем:var xyz1=\"D:\\\\NFT\\\\result1\\\\MerryCowF #\"  +x1 +\".\" +\"png\"    //путь и полное имя файла\n// Сохраняем результат в новый файл\nval output1 = File(xyz1)\nImageIO.write(resultPng1, \"png\", output1)\n\n} С кодом всё. 2. Загрузка на opensea  Используя макрос для записи мыши и клавиатуры MiniMouseMacro.exe, сделал цикл.В Exel 2 столбика, имя (+1 перетаскиванием угла ячейки) и «цена» (скопировал несколько ячеек, и вставка в выделенный столбик) и папка с картинками чтобы кликом была  вверху следующая картинка.Однако   opensea при слишком быстрой загрузке выбрасывает капчу, не прогружает иногда странички, выдаёт «Oops, something went wrong» …  VPN помогает, с капчой можно было бы побороться, но шкурка выделки не стоит (проще немного притормозить цикл). ИТОГ  Всё до конца не загружал … для тестовой работы достаточно. Понимаю код можно было сделать проще и лучше, ну как есть,  смысла переделывать я не вижу ( и так работает).И, поскольку, мой товарищ (который взял бы на себя художественную часть) утратил интерес к теме, буду рад предложениям о каком то взаимодействии — e-mail  manlib@yandex.ru  …  Спасибо за внимание и не судите строго. Это первая публикация, хотя я давний читатель.   "
    },
    "Котики в NFT: революция в цифровом мире или хайповая пирамида?": {
        "href": "https://habr.com/ru/company/ruvds/blog/558916/",
        "content": " Коллаж из картинок художника beeple держит сегодня рекорд по стоимости среди всех проданных цифровых NFT-произведений.\n\r\nNFT — одна из самых горячих тем в мире блокчейна. Кто-то уже заработал на них миллионы долларов, кто-то потерял сотни и тысячи. Одни называют NFT революционным изобретением, которое изменит сферы разработки игр и наше восприятие цифровых (нематериальных) объектов. Другие недоумевают, как можно вестись на такой развод и платить мошенникам деньги. Но вне зависимости от того, кто прав, факт остаётся фактом: NFT сейчас на слуху, и их оборот достиг уже очень внушительных сумм. \n\r\nВот и у одного нашего друга на ноуте осталась классная гифка с танцующим котиком, к которой прикручен NFT. Вещь штучная, уникальная, через пару лет за неё можно будет немало выручить. Правда, вытащить с ноута гифку будет трудно. Подробности под катом.\n\nЧто за NFT такое?\r\nNFT расшифровывается как non-fungible token, то есть невзаимозаменяемый токен. Идея в том, что есть взаимозаменяемые объекты, которые полностью идентичны друг другу — например, один рубль равен другому рублю, — а есть невзаимозаменяемые объекты, каждый из которых уникален и неповторим. Скажем, когда вы пришли в магазин и купили новые кроссовки, они в этот момент взаимозаменяемы: полностью идентичный любым кроссовкам того же размера. А когда вы их поносите, то эта пара станет уникальной за счёт невоспроизводимых потёртостей и прочих изменений, то есть кроссовки станут уникальными — других таких же во всём мире нет, есть только похожие.\n\r\nНа принципе уникальности держится вся торговля предметами материального искусства. Например, даже если художник нарисует точную копию какой-либо картины, пусть и своей же, это всё равно будут две разные картины, хоть и очень похожие. А электронные объекты обычно взаимозаменяемы — Ctrl+C, Ctrl+V, и вот у тебя уже идеальная копия какой-нибудь гифки или песни, попробуй найди два отличия. \n\r\nВ результате придумали NFT — это блокчейн, который можно прикрепить к любому нематериальному объекту — картинке, видеозаписи, музыкальному файлу, предмету в игре — и тем самым заявить, что этот объект уникален и принадлежит только вам. Скопировать такой объект можно, но выдать за свой уже не получится — ваш NFT не позволит. Эдакий сертификат уникальности. Прикрутить токен можно не только к цифровому, но и к материальному объекту. За это нужно благодарить смарт-контракты Etherium, именно эта крипта лежит в основе большинства NFT.\n\r\nСегодня за цифровые произведения искусства с NFT уже платят десятки миллионов долларов. Рекорд пока что у художника Майка Винкельмана, выступающего под псевдонимом Beeple — его коллаж из 5 тысяч изображений на аукционе Christie продали аж за $69 млн. За цифровую картинку с токеном:\n\n\r\nДругой известный пример — продажа NFT мема с летающим котиком:\n\nЭтот мем продали за 580 тыс. долларов. Не спрашивайте, зачем. Мы сами недоумеваем.\n\r\nВот ещё: компания Injective Protocol подогрела NFT—хайп, купив у Бэнкси картину за $95 тыс., прилюдно сожгла её и привязала к цифровой копии NFT. Теперь этот набор пикселей принадлежит компании, которая объявила его настоящим произведением криптоискусства. \n\r\nТо есть NFT успел стать важным фактором в торговле произведениями искусства разной степени ценности (или сомнительности). Существуют разные электронные площадки, на которых все желающие могут покупать и продавать NFT. И цены на них сильно варьируются. Однако есть важный момент: в NFT хранится не сам цифровой объект, а только его описание и свидетельство собственности. Это уже приводит к забавным ситуациям, когда кто-то покупал токен, причём за вполне себе ощутимые суммы, а… сам объект неожиданно исчезал. \n\n\r\nТак что если вы надумали податься в криптоколлекционеры, то хорошо подумайте над целесообразностью. И заодно проверяйте, за какие же токены вы платите.\n\r\nБольшую популярность NFT снискали в мире игр. Токены прикрепляют к различным игровым объектам — оружию, доспехам и прочему добру — и продают как уникальные объекты, имеющие конкретного владельца внутри конкретной игры. Владельца не авторских прав, а игрового предмета. Некоторые поклонники NFT мечтают о светлом дне, когда токены станут универсальными и можно будет применять в играх предметы из других игр. Купил себе автомат в каком-нибудь шутере, а потом зажёг с ним в фэнтезийной РПГ.\n\r\nСегодня многие пророчат NFT светлое будущее гаранта авторских прав в условиях повального копирования изображений, видео, книг и музыки и прочих произведений. Но столь же активно технологию критикуют как очередной инструмент выманивания у простаков денег. Кто прав, покажет время. \n\nОбразец дегенеративного криптоискусства, за который кто-то заплатил пару десятков баксов.\n\r\nА пока что вы можете совершенно бесплатно заполучить классную гифку с NFT, которая скоро может быть безвозвратно уничтожена совершенно варварским способом. Причём уничтожена вместе с хорошим дорогим ноутбуком и отличным роялем. Все подробности тут.\n\n ▍UPD. 24 мая 15.55:\n\r\nНаш друг пишет: \n\r\nЯ дошел до коворкинга, попробовал получить доступ, и тоже не смог… \n\r\nХотел было уже звонить бывшей, но… Беда не приходит одна (( \n\r\nЗа то время, что ноутбук был в руках моей бывшей, его успели взломать. Это сделала группа хакеров под названием “sp0rk b4gel”. Их целью были исходные коды по ИИ с моего ноутбука (помнишь, я говорил тебе, что работаю на одну очень серьезную корпорацию), и они их успешно похитили…\n\r\nМой криптокотик им был ни к чему, они его даже не заметили, потому что пришли за другим. И теперь они требуют выкуп за неопубликование этих кодов, и конечно я очень не хочу их опубликования, ведь это собственность компании, и она даже может начать юридическое преследование за утечку. \n\r\nSSH-ключ доступа к ноутбуку они, разумеется, сменили (поэтому мы с тобой и не смогли к нему подключиться), чтобы я не смог ничего исправить самостоятельно.\n\r\nЯ получил от них такое вот письмо:\n«Привет. Кажется, сегодня не твой день, ведь твои данные стали нашими. От лица sp0rk b4gel искренне поздравляю тебя с этим. Если не хочешь крайне неприятных последствий, перечисли 0.2 биткоина на 12d1jWjmreNVfE5SKVrhm5T2r6D6bXdS4H, а способ сам найдешь, ты же программист. И да, если тебе интересно, как мы тебя хакнули, то намекаем – зря ты принимал участие в том дырявом проекте для студии Сокол…»Что мне делать?\n\n\n   "
    },
    "Разбор заданий конкурса на взлом NFT “The Standoff Digital Art”": {
        "href": "https://habr.com/ru/company/pt/blog/590301/",
        "content": " 15-16 ноября в Москве проводилась ежегодная кибербитва The Standoff, которая собрала лучшие команды защитников и атакующих. В рамках глобальной конференции по информационной безопасности проводился конкурс на взлом NFT под названием The Standoff Digital Art. Мы пригласили известных цифровых художников для использования их NFT-работ в качестве целей для взлома. Для конкурса мы подготовили смарт-контракт стандарта ERC1155 для нашей коллекции. Владельцем каждой из NFT в коллекции (всего их было 6) был специально подготовленный уязвимый смарт-контракт. При успешной эксплуатации каждого из смарт-контрактов атакующий получал во владение NFT (в тестовой сети). Также за каждый успешный взлом полагался денежный приз. Итак, какие же были уязвимости?Инкубатор🎨 Автор: Артем ТкачВ смарт-контракте мы видим три внешние функции: mint(), allowMinting() и addToWailist(). Цель - заставить смарт-контракт сделать передачу NFT через функцию mint(), однако в конструкторе переменная canMint объявляется как false. Чтобы разблокировать функцию mint(), присутствует функция allowMinting(), однако она доступна только владельцу смарт-контракта. Что же делать? Если внимательно изучить третью функцию addToWailist(), то мы увидим, что в ней объявляется неинициализированный динамический список адресов. В языке Solidity, если при инициализации не присвоить сложным типам данных типа array, mapping или struct какое-либо значение, то при использовании ключевого слова “storage” переменная просто перезапишет первый слот стораджа смарт-контракта. Правда, разработчики Solidity не оставили такую “возможность” языка без внимания и еще 4 года назад исправили компилятор таким образом, чтобы при подобных случаях возвращалась ошибка. Однако компилятор не всегда видит перезапись стораджа. Подробнее об этом можно узнать здесь:Таким образом, если вызвать addToWaitlist(), то перезапишется первый элемент стораджа, в котором хранится значение переменной canMint. После чего, вызвав функцию mint(), атакующий получает NFT.Mine🎨 Автор: Meta RiteВ этом задании смарт-контракт StandoffNFT_2 наследует контракт Ownable, что является распространенным шаблоном. Можно заметить, что в конструкторе основного смарт-контракта переменной owner присваивается адрес отправителя. У функции withdraw(), которая передает владение NFT, имеется модификатор onlyOwner, разрешающий вызов только владельцу смарт-контракта. Сам код onlyOwner тоже стандартный:modifier onlyOwner() {\n\trequire(owner == msg.sender);\n\t_;\n}Однако чему будет равен owner при вызове onlyOwner()? Правильно, он будет равен 0, так как присваивание произошло в контракте StandoffNFT_2, а не в Ownable. При наследовании значение owner в Ownable останется нетронутым. Иначе говоря, нам ничего не мешает позвать setOwner() и затем успешно выполнить withdraw().Matter🎨 Автор: DesinfoВ исходном коде смарт-контракта мы видим функцию unlock(), которая передает владение NFT при выполнении условия:require(\n\tbytes32(\n  \t0x8d8056f94c32675006872f854a6757279eb9a1070660e871535fc7231dc18b30) ==\n  \tkeccak256(preimage), \"invalid preimage\"\n);Также замечаем комментарий “we have very secure metadata”, что недвусмысленно дает понять, где искать preimage. Обратившись к смарт-контракту коллекции, получаем адрес, где хранятся метаданные:constructor() ERC1155(\"https://standoff-nft.vercel.app/api/{}.json\") {Адрес, который передается в функцию ERC1155, является token URI, т.е. это тот адрес, куда NFT маркетплейсы вроде OpenSea, будут ходить за метаданными каждого токена коллекции. Кажется, что дело в шляпе, нужно лишь подставить вместо {} идентификатор токена. Однако при обращении к /api/3.json, получаем 404 ошибку. В чем же дело?Ответ может дать документация стандарта ERC1155: The string format of the substituted hexadecimal ID MUST be lowercase alphanumeric: [0-9a-f] with no 0x prefix.The string format of the substituted hexadecimal ID MUST be leading zero padded to 64 hex characters length if necessary.Иными словами, TOKEN_ID необходимо перевести в шестнадцатеричную форму и привести к длине из 64 символов с нулями. Т.е. вместо /api/3.json мы должны запрашивать /api/0000000000000000000000000000000000000000000000000000000000000002.json:Отправив значение preimage в функцию unlock(), получаем NFT.Raven🎨 Автор: volv_victoryВ исходном коде смарт-контракта видим два маппинга blacklisted и whitelisted с адресами коллекций. Также имеется функция addCollections, которая принимает на вход упомянутые маппинги, а также подпись, по которой проверяется, что маппинги подписал владелец смарт-контракта. Глядя на историю транзакций на EtherScan, обнаруживаем вызов addCollections с корректной подписью.В _blacklisted адрес коллекции The Standoff Digital Art. Это означает, что мы не можем вызвать функцию transfer(), которая отправляет NFT, так как она имеет следующее условие:require(whitelisted[_collection], \"collection is not allowed\");Но это не проблема, если внимательно  изучить, как проверяется подпись в addCollections():bytes32 hash = keccak256(abi.encodePacked(_whitelisted, _blacklisted));\naddress signer = hash.toEthSignedMessageHash().recover(_signature);\nrequire(signer == owner, \"only owner can add NFT collections\");Два маппинга “склеиваются“ с помощью функции abi.encodePacked(), от полученного маппинга считается keccak-хэш и от этого хэша считается подпись. Здесь ошибка заключается в том, что используется abi.encodePacked() вместо abi.encode(). Между ними есть существенная разница: abi.encodePacked() не сохраняет информацию о количестве элементов при сериализации. Это означает, что выражения abi.encodePacked([1,2,3], [4]) и abi.encodePacked([1,2], [3,4]) будут возвращать один и тот же результат и, соответственно, один и тот же keccak-хэш. Более подробно о подобных хэш-коллизиях из-за abi.encodePacked() можно ознакомиться в этой статье.Таким образом, атакующий может переиспользовать подпись владельца смарт-контракта, чтобы изменить расположение адресов коллекций в переменных blacklisted и whitelisted. Иначе говоря, вместо вызова: addCollections(\n\t[0xb47e3cd837dDF8e4c57F05d70Ab865de6e193BBB\n\t0xBC4CA0EdA7647A8aB7C2061c2E118A18a936f13D\n\t0x1A92f7381B9F03921564a437210bB9396471050C],\n\t[0x1EBDe1D447752Ef17625c13940bf0218220bED3b], // адрес standoff в blacklisted\n\tsignature\n)мы делаем следующий вызов:addCollections(\n\t[0xb47e3cd837dDF8e4c57F05d70Ab865de6e193BBB\n\t0xBC4CA0EdA7647A8aB7C2061c2E118A18a936f13D\n\t0x1A92f7381B9F03921564a437210bB9396471050C,\n\t0x1EBDe1D447752Ef17625c13940bf0218220bED3b],\n\t[], // blacklisted теперь пустой\n\tsignature\n)Подпись будет одинаковой и теперь мы сможем успешно выполнить transfer()!Transformation🎨 Автор: Anomalit KateВ смарт-контракте имеется лишь единственная внешняя функция transfer(), которая переводит NFT отправителю транзакции, однако вызвать ее может только владелец смарт-контракта, который устанавливается в конструкторе. Game over? Как бы ни так, обращаем внимание на старую версию компилятора Solidity - 0.4.25. В этой версии все еще была возможность допустить ошибку при объявлении конструктора, а именно сделать конструктор обычной функцией.✅ правильный синтаксис: constructor(IERC1155 _collection) {}🛑 неправильный синтаксис: function constructor(IERC1155 _collection) {}Все, что оставалось сделать самому быстрому и внимательному участнику, это отправить транзакцию с вызовом функции constructor() с адресом коллекции, а затем сделать transfer().Recharge🎨 Автор: LoitПройдя по адресу NFT, мы не увидим исходного кода смарт-контракта, но в истории транзакций есть любопытное сообщение:По указанному адресу расположено задание. Оно каким-то образом должно позволить завладеть адресом, которому принадлежит NFT. Читая исходный код, видим функцию deploy(), которая на вход принимает параметр “salt” длиной 4 байта. В ней вызывается одноименная функция из модуля Create2 от OpenZeppelin:address addr = Create2.deploy(0, salt, getInitCode());Данный вызов публикует в сеть новый смарт-контракт с помощью опкода CREATE2, который не так давно появился в EVM (Ethereum Virtual Machine) в рамках хард-форка Constantinople. Ранее существовал лишь опкод CREATE; разница между ними состоит в том, что адрес нового смарт-контракта, созданного с помощью обычного CREATE, зависит от nonce - это число, которое увеличивается при каждом новом вызове CREATE, а адреса смарт-контрактов, созданных с помощью CREATE2, зависят от контролируемого пользователем значения salt, что делает адреса новых смарт-контрактов заранее известными.Смарт-контракт, который можно таким образом задеплоить, называется NFTOwner. Он имеет конструктор, в котором владельцем становится tx.origin, т.е. изначальный отправитель транзакции, и функцию transfer(), передающая NFT. Все это дает понять, что нам нужно угадать salt и разместить контракт именно по тому адресу, который владеет NFT. Задача несложная, так как перебрать нужно всего 4 байта. В результате брутфорса получаем значение “aZy5”. Вызвав функцию deploy() с этим значением забираем NFT.ИтогиЦелых 5 NFT удалось взломать Алексею Быхуну @caffeinumв первые часы после начала конкурса. Последний NFT достался Алексею Егорову, который решил задание на перебор соли. Победители получат денежные призы от организаторов The Standoff, поздравляем!Until next time!   "
    }
}